[{"url":"https://www.startech.com.bd/xtra-active-r16-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r16/active-r16-01-228x228.webp","title":"XTRA Active R16 Bluetooth Calling Smartwatch","product_list_short_description":["Display: 1.39\" HD, 360*360 Resolution","Supports Bluetooth Calling","Multi-Sport Mode, 100+ Watch Face","Li-polymer 220mAh, IP67 Water Resistance"],"price_new":2990,"price_old":3299,"price_single":2990,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XTRA Smartwatch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XTRA Smartwatch at the best price in Bangladesh. Latest XTRA Smartwatch and Fitness Tracker available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XTRA Smartwatch","status":"In Stock","code":"33662","brand":"XTRA","product_page_short_description":["Model: Active R16","Display: 1.39\" HD, 360*360 Resolution","Supports Bluetooth Calling","Multi-Sport Mode, 100+ Watch Face","Li-polymer 220mAh, IP67 Water Resistance"],"emi_price":302,"full_description":"<h2>XTRA Active R16 Bluetooth Calling Smartwatch</h2><p style=\"text-align: justify; \">The XTRA <span style=\"font-weight: bold;\">Active R16</span> Smart Watch is an advanced smart gadget that will improve your everyday life with its remarkable capabilities and beautiful appearance. This wristwatch has an ultra-clear big screen that provides maximum sight even in harsh sunshine. The 1.39-inch HD screen, with a high resolution of 360 x 360, displays a complete one-screen overview of message reminders, motion statistics, and other information. With a peak brightness of 280 nits, you can readily see information on the display even in bright light. Stay connected easily with the Bluetooth voice call function, which allows you to answer incoming calls directly from your wrist with a simple button click. This function is convenient since it allows you to manage calls while on the road without having to reach for your smartphone. Once the watch is smoothly connected to the accompanying smartphone app, you will be able to experience the power of intelligent voice assistance. Voice commands provide hands-free control of many tasks, making interactions with your wristwatch more simple and easy. The XTRA Active R16 Smart Watch is designed to follow you in a variety of settings, including wet ones, owing to its IP67 waterproof rating. This degree of water resistance means that the watch can tolerate everyday contact with water, making it appropriate for activities like handwashing and rain. Improve your fitness journey with the multi-sport mode, which allows you to track and monitor your activity across various workouts. You may also personalize your watch face with over 100 different options to match your style and tastes. The XTRA Active R16 <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">Smart Watch</a> blends design, functionality, and durability to provide a smooth and feature-rich experience for consumers looking for a flexible wearable device in their everyday lives.</p><h2><span style=\"color: inherit; font-family: inherit;\">Buy </span>XTRA Active R16 Bluetooth Calling Smartwatch<span style=\"color: inherit; font-family: inherit;\"> from the best Smart Watch Shop in Bangladesh: Star Tech</span><br></h2><p>In Bangladesh, you can get original <span style=\"font-weight: bold;\">XTRA Active R16 Bluetooth Calling Smartwatch</span> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xtra-smartwatch\" target=\"\">XTRA Smart Watch</a> to purchase. Order online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech </a>Shop to get yours at lowest price. The XTRA Active R16 Smart Watch comes with a 06-months warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.39\" HD Display, 360*360 Resolution"},{"key":"Battery","value":"Li-polymer 220mAh"},{"key":"Connectivity","value":"Bluetooth"},{"key":"Material","value":"Body: Poly Carbonate,"},{"key":"OS","value":"Android 4.4+ / iOS 9.0+"},{"key":"SpecialFeatures","value":"Bluetooth Calling"},{"key":"Others","value":"Heart rate monitoring, Blood Pressure, Sleep monitoring, Blood Oxygen, Weather, Music control, Sync message"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Black, Blue, Grey"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"06-months warranty"}]}],"latest_price":{"heading":"What is the price of XTRA Active R16 Smart Watch in Bangladesh?","paragraph":"The latest price of XTRA Active R16 Smart Watch in Bangladesh is 2,990৳. You can buy the XTRA Active R16 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r16/active-r16-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r16/active-r16-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r16/active-r16-03-500x500.webp"],"product_seo_title":"XTRA Active R16 Bluetooth Calling Smart Watch Price in BD | Star Tech","product_seo_description":"Buy XTRA Active R16 Bluetooth Calling Smart Watch at the best price in Bangladesh. Latest XTRA Active R16 Smart Watch at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"XTRA Active R16 Bluetooth Calling Smart Watch"},{"url":"https://www.startech.com.bd/xtra-active-r7-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r7/active-r7-01-228x228.webp","title":"XTRA Active R7 Bluetooth Calling Smartwatch","product_list_short_description":["Display: 1.32” 360*360 pixel","Supports Bluetooth Calling","32+ Sport Mode, 100+ Watch Face","Li-polymer 260mAh, Up to 5 Day"],"price_new":3090,"price_old":3699,"price_single":3090,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XTRA Smartwatch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XTRA Smartwatch at the best price in Bangladesh. Latest XTRA Smartwatch and Fitness Tracker available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XTRA Smartwatch","status":"In Stock","code":"28868","brand":"XTRA","product_page_short_description":["Model: Active R7","Display: 1.32” 360*360 pixel","Supports Bluetooth Calling","32+ Sport Mode, 100+ Watch Face","Li-polymer 260mAh, Up to 5 Day"],"emi_price":315,"full_description":"<p></p><h2>XTRA Active R7 Bluetooth Calling Smart Watch</h2><p></p>The XTRA Active R7 Bluetooth Calling Smartwatch is a feature-packed wearable device designed to enhance your daily life. It features a 1.32\" display with a resolution of 360*360 pixels, providing clear and vibrant visuals. Powered by the RTL8763EWE chipset and equipped with 128MB of flash storage, the smartwatch offers smooth performance and ample space for storing data. With Bluetooth Calling functionality, you can make and receive calls directly from your wrist. The smartwatch includes 32+ sports modes to track your fitness activities accurately. It offers a wide selection of watch faces, allowing you to customize the look to match your style. The built-in voice assistant provides convenient voice control for various tasks. With an IP67 water resistance rating, the smartwatch is protected against water and dust. The Li-polymer 260mAh battery provides up to 5 days of usage on a single charge, and recharging is easy with the 2-pin magnetic charger. The smartwatch features a durable Zn-alloy body frame, stainless steel buckle, and comfortable silicone strap. It is compatible with Android 4.4+ and iOS 9.0+ devices, ensuring wide connectivity options. With camera and music control, sleep monitoring, heart rate and blood pressure monitoring, weather updates, and more, the XTRA Active R7 smartwatch offers a range of functions to support your active lifestyle. It has 01-Year warranty.<p></p><p></p><h2>Buy XTRA Active R7 Bluetooth Calling Smartwatch from the best Smart Watch Shop in Bangladesh: Star Tech</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/xtra-active-r7-smart-watch\" target=\"\">XTRA Active R7 Bluetooth Calling Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xtra-smartwatch\" target=\"\">XTRA&nbsp;Smart Watch</a> to purchase. Order online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech </a>Shop to get yours at lowest price. The XTRA Active R7 Bluetooth Calling Smart Watch comes with no warranty.</p><p></p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"RTL8763EWE"},{"key":"Display","value":"1.32” Display, 360*360 pixel"},{"key":"Memory","value":"Flash: 128MB"},{"key":"Battery","value":"Li-polymer 260mAh, Up to 5 Day"},{"key":"Connectivity","value":"Bluetooth"},{"key":"Material","value":"Body: Zn-alloy Frame, Buckle: Stainless steel, Strap: Silicone"},{"key":"OS","value":"Android 4.4+ / iOS 9.0+"},{"key":"SpecialFeatures","value":"Bluetooth Calling"},{"key":"Others","value":"Sleep monitoring, Sync message, Heart rate, Blood Pressure, Weather, Music Control, Alarm, Sedentary remind"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01-year warranty"}]}],"latest_price":{"heading":"What is the price of XTRA Active R7 Smart Watch in Bangladesh?","paragraph":"The latest price of XTRA Active R7 Smart Watch in Bangladesh is 3,090৳. You can buy the XTRA Active R7 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r7/active-r7-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r7/active-r7-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r7/active-r7-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r7/active-r7-04-500x500.webp"],"product_seo_title":"XTRA Active R7 Bluetooth Calling Smart Watch Price in BD | Star Tech","product_seo_description":"Buy XTRA Active R7 Bluetooth Calling Smart Watch at the best price in Bangladesh. Latest XTRA Active R7 Smart Watch at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"XTRA Active R7 Bluetooth Calling Smart Watch"},{"url":"https://www.startech.com.bd/xtra-active-s18-bluetooth-calling-smartwatch","img":"https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s18/active-s18-grey-01-228x228.webp","title":"XTRA Active S18 Bluetooth Calling Smartwatch","product_list_short_description":["Display: 1.96\" large color Display","Bluetooth Calling","Battery: 230mAh","Water resistance: IP68"],"price_new":2990,"price_old":3699,"price_single":2990,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XTRA Smartwatch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XTRA Smartwatch at the best price in Bangladesh. Latest XTRA Smartwatch and Fitness Tracker available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XTRA Smartwatch","status":"In Stock","code":"29931","brand":"XTRA","product_page_short_description":["Model: Active S18","Display: 1.96\" large color Display","Bluetooth Calling","Battery: 230mAh","Water resistance: IP68"],"emi_price":339,"full_description":"<h2>XTRA Active S18 Bluetooth Calling Smartwatch</h2><p style=\"text-align: justify; \">The XTRA Active S18 Bluetooth Calling Smartwatch is a cutting-edge wearable device designed to provide seamless connectivity and convenience on the go. With its sleek and modern design, it offers a plethora of features that make it an ideal companion for busy individuals who want to stay connected and organized throughout the day. The smartwatch boasts a generous 1.96-inch large color display, providing users with a vivid and clear interface for easy navigation and viewing of various functions. The XTRA Active S18 is its Bluetooth calling capability. Users can make and receive calls directly from their smartwatch, allowing them to stay connected even when their phone is not easily accessible. Equipped with a 230mAh battery, the XTRA Active S18 ensures that you can make the most out of its features without worrying about frequent recharging. It offers extended battery life to keep up with your daily activities. The smartwatch is rated IP68, making it highly resistant to water and dust. This means you can wear it during your workouts or even in the rain without concern about potential damage. The XTRA Active S18 Bluetooth Calling Smartwatch is a perfect blend of style and functionality. Whether you're a fitness enthusiast, a busy professional, or someone who simply wants to stay on top of things, this smartwatch is designed to enhance your daily life by providing essential features and reliable connectivity on your wrist. Stay connected, track your activities, and manage your day with ease using this impressive smartwatch.</p><h2 style=\"text-align: justify;\">Buy XTRA Active S18 Bluetooth Calling Smartwatch from the best Smart Watch Shop in Bangladesh: Star Tech</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/xtra-active-s18-bluetooth-calling-smartwatch\" target=\"\">XTRA Active S18 Bluetooth Calling Smartwatch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"_blank\">Smart Watch</a> to purchase. Order online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech </a>Shop to get yours at lowest price. The XTRA Active S18 Bluetooth Calling Smartwatch comes with a 01-year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.96\" Display, Resolution 320*386"},{"key":"Battery","value":"230mAh"},{"key":"Connectivity","value":"Bluetooth"},{"key":"SpecialFeatures","value":"Bluetooth Calling Smart Watch"},{"key":"Sensor","value":"Blood Oxygen, Blood Pressure, HRM, BLOOD GLUCOSE, AOD, Password"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01-year Warranty"}]}],"latest_price":{"heading":"What is the price of XTRA Active S18 Bluetooth Calling Smartwatch in Bangladesh?","paragraph":"The latest price of XTRA Active S18 Bluetooth Calling Smartwatch in Bangladesh is 2,990৳. You can buy the XTRA Active S18 Bluetooth Calling Smartwatch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s18/active-s18-grey-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s18/active-s18-blue-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s18/active-s18-black-01-500x500.webp"],"product_seo_title":"XTRA Active S18 Bluetooth Calling Smartwatch Price in BD | Star Tech","product_seo_description":"Buy XTRA Active S18 Bluetooth Calling Smartwatch at the best price in Bangladesh. Latest XTRA Active S18 Smart Watch at Star Tech Shop. Order online to get delivery in BD.\n","product_seo_keywords":"XTRA Active S18 Bluetooth Calling Smartwatch"},{"url":"https://www.startech.com.bd/xtra-active-r28-bluetooth-calling-smartwatch","img":"https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r28/active-r28-01-228x228.webp","title":"XTRA Active R28 Bluetooth Calling Smartwatch","product_list_short_description":["Display: 1.45\" TFT Full-Screen Touch Display","Bluetooth Calling","Battery: 250mAh","Water resistance: IP68"],"price_new":3450,"price_old":4999,"price_single":3450,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XTRA Smartwatch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XTRA Smartwatch at the best price in Bangladesh. Latest XTRA Smartwatch and Fitness Tracker available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XTRA Smartwatch","status":"In Stock","code":"29939","brand":"XTRA","product_page_short_description":["Model: Active R28","Display: 1.45\" TFT Full-Screen Touch Display","Bluetooth Calling","Battery: 250mAh","Water resistance: IP68"],"emi_price":458,"full_description":"<h2>XTRA Active R28 Bluetooth Calling Smartwatch</h2><p style=\"text-align: justify; \">The XTRA Active R28 Bluetooth Calling Smartwatch is a feature-packed wearable designed to enhance your daily life. This stylish smartwatch boasts a 1.45\" TFT full-screen touch display that offers a user-friendly interface for effortless navigation. With Bluetooth calling capabilities, you can easily make and receive calls directly from your wrist, keeping you connected on the go. The smartwatch is powered by a 250mAh battery, ensuring long-lasting performance throughout the day. To optimize battery consumption, users can set the Always On Display mode from the display options, allowing them to see the time at a glance without draining unnecessary power. With its impressive IP68 water resistance rating, the XTRA Active R28 smartwatch is protected against dust and water ingress, making it suitable for various activities, including swimming and outdoor workouts. This smartwatch goes beyond just telling time. It includes a Breathe mode, guiding users through breathing exercises lasting from one to five minutes. This feature promotes relaxation and helps users take care of their mental and physical well-being, especially during stressful moments. The smartwatch offers Female Health Tracking, empowering users to record their menstrual period. Using this data, the watch can provide intelligent predictions about the timing and duration of upcoming menstrual and fertile periods. This feature gives women peace of mind and helps them plan ahead. The XTRA Active R28 smartwatch is a versatile health companion. It leverages the built-in gyroscope and accelerometer to track your movements accurately. Moreover, it can detect the different stages of your sleep cycle, providing valuable insights into the quality of your rest and overall sleep patterns. Whether you're looking for a device to keep you connected, improve your well-being, or monitor your health, the XTRA Active R28 Bluetooth Calling Smartwatch offers a comprehensive set of features to meet your needs. Stylish, functional, and technologically advanced, this smartwatch is the perfect companion for your modern lifestyle.</p><h2><span style=\"text-align: justify; color: inherit; font-family: inherit;\">Buy </span><span style=\"text-align: justify;\">XTRA Active R28 Bluetooth Calling Smartwatch<span style=\"color: inherit; font-family: inherit;\"> Shop in BD</span></span><br></h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/xtra-active-r28-bluetooth-calling-smartwatch\" target=\"\">XTRA Active R28 Bluetooth Calling Smartwatch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"_blank\">Smart Watch</a> to purchase. Order online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech </a>Shop to get yours at lowest price. The XTRA Active R28 Bluetooth Calling Smartwatch comes with a 01-year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.45\" TFT Display, Resolution , 360*360 pixels"},{"key":"Battery","value":"250mAh"},{"key":"Connectivity","value":"Bluetooth 5.3"},{"key":"SpecialFeatures","value":"Bluetooth Calling Smart Watch"},{"key":"Sensor","value":"Sports Mode, wrist up to light up the screen, sleep"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"47*12.5*22mm"},{"key":"Weight","value":"50g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01-year Warranty"}]}],"latest_price":{"heading":"What is the price of XTRA Active R28 Bluetooth Calling Smartwatch in Bangladesh?","paragraph":"The latest price of XTRA Active R28 Bluetooth Calling Smartwatch in Bangladesh is 3,450৳. You can buy the XTRA Active R28 Bluetooth Calling Smartwatch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r28/active-r28-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r28/active-r28-02-500x500.webp"],"product_seo_title":"XTRA Active R28 Bluetooth Calling Smartwatch Price in BD | Star Tech","product_seo_description":"Buy XTRA Active R28 Bluetooth Calling Smartwatch at the best price in Bangladesh. Latest XTRA Active R28 Smartwatch at Star Tech Shop. Order online to get delivery in BD.\n","product_seo_keywords":"XTRA Active R28 Bluetooth Calling Smartwatch"},{"url":"https://www.startech.com.bd/xtra-active-r38-bluetooth-calling-smartwatch","img":"https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r38/active-r38-02-228x228.webp","title":"XTRA Active R38 Bluetooth Calling Smartwatch","product_list_short_description":["Display: 1.43\" AMOLED Full-Screen Touch Display","Bluetooth Calling","Battery: 250mAh","Water resistance: IP68"],"price_new":3990,"price_old":5599,"price_single":3990,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XTRA Smartwatch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XTRA Smartwatch at the best price in Bangladesh. Latest XTRA Smartwatch and Fitness Tracker available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XTRA Smartwatch","status":"In Stock","code":"29937","brand":"XTRA","product_page_short_description":["Model: Active R38","Display: 1.43\" AMOLED Full-Screen Touch Display","Bluetooth Calling","Battery: 250mAh","Water resistance: IP68"],"emi_price":513,"full_description":"<h2>XTRA Active R38 Bluetooth Calling Smartwatch</h2><p style=\"text-align: justify; \">The XTRA Active R38 Bluetooth Calling Smartwatch - a stylish and feature-packed wearable designed to keep you connected and help you stay mindful of your well-being. The smartwatch boasts a vibrant 1.43\" AMOLED Full-Screen Touch Display, providing a clear and interactive interface for effortless navigation. With Bluetooth Calling capabilities, you can answer or make calls directly from your wrist, making communication more convenient when your phone is out of reach. Equipped with a 250mAh battery, the XTRA Active R38 ensures long-lasting usage throughout your day, eliminating the need for frequent charging. Its IP68 water resistance rating ensures that the smartwatch can handle water splashes and brief immersions, making it suitable for everyday wear and various activities. This smartwatch is in the Breathe Training mode. This mode serves as a helpful guide to focus on your breathing for one to five minutes, aiding in relaxation and promoting mindfulness. By taking short moments to refocus and de-stress, you can take better care of your mental and physical well-being. For female users, the XTRA Active R38 includes an invaluable Female Health Tracking feature. By recording your menstrual period, the smartwatch can intelligently predict the timing and duration of your future menstrual and fertile periods. This proactive capability allows women to plan ahead and be prepared, providing peace of mind and greater control over their reproductive health. With its blend of communication, health monitoring, and mindfulness features, the XTRA Active R38 Bluetooth Calling Smartwatch is a versatile companion that helps you lead a more balanced and connected life. Whether you're managing calls on the go or taking a moment to focus on your well-being, this smartwatch has you covered.</p><h2><span style=\"text-align: justify;\"><span style=\"color: inherit; font-family: inherit;\">Buy </span>XTRA Active R38 Bluetooth Calling Smartwatch<span style=\"color: inherit; font-family: inherit;\">&nbsp;from the best Smart Watch Shop in BD</span></span><br></h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/xtra-active-r38-bluetooth-calling-smartwatch\" target=\"\">XTRA Active R38 Bluetooth Calling Smartwatch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"_blank\">Smart Watch</a> to purchase. Order online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech </a>Shop to get yours at lowest price. The XTRA Active R38 Bluetooth Calling Smartwatch comes with a 01-year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.43\" AMOLED Display, Resolution 466*466"},{"key":"Battery","value":"250mAh"},{"key":"Connectivity","value":"Bluetooth 5.3"},{"key":"SpecialFeatures","value":"Bluetooth Calling Smart Watch"},{"key":"Sensor","value":"24H Heart Rate Monitor,"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"25.5x47x13 mm"},{"key":"Weight","value":"52g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01-year Warranty"}]}],"latest_price":{"heading":"What is the price of XTRA Active R38 Bluetooth Calling Smartwatch in Bangladesh?","paragraph":"The latest price of XTRA Active R38 Bluetooth Calling Smartwatch in Bangladesh is 3,990৳. You can buy the XTRA Active R38 Bluetooth Calling Smartwatch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r38/active-r38-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-r38/active-r38-01-500x500.webp"],"product_seo_title":"XTRA Active R38 Bluetooth Calling Smartwatch Price in BD | Star Tech","product_seo_description":"Buy XTRA Active R38 Bluetooth Calling Smartwatch at the best price in Bangladesh. Latest XTRA Active R38 Smartwatch at Star Tech Shop. Order online to get delivery in BD.\n","product_seo_keywords":"XTRA Active R38 Bluetooth Calling Smartwatch"},{"url":"https://www.startech.com.bd/xtra-active-s8-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s8/active-s8-02-228x228.webp","title":"XTRA Active S8 Bluetooth Calling Smartwatch","product_list_short_description":["2.01\" IPS Large Display, 240x282 Resolution","Li-polymer 210mAh (Up to 6 Days)","Waterproof: IP67","Bluetooth Calling, HD Original Sound, Multi Sports Mode"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XTRA Smartwatch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XTRA Smartwatch at the best price in Bangladesh. Latest XTRA Smartwatch and Fitness Tracker available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XTRA Smartwatch","status":"Out Of Stock","code":"32593","brand":"XTRA","product_page_short_description":["Model: Active S8","2.01\" IPS Large Display, 240x282 Resolution","Li-polymer 210mAh (Up to 6 Days)","Waterproof: IP67","Bluetooth Calling, HD Original Sound, Multi Sports Mode"],"emi_price":0,"full_description":"<h2>XTRA Active S8 Bluetooth Calling Smartwatch</h2><p style=\"text-align: justify; \">The XTRA <span style=\"font-weight: bold;\">Active S8</span> Smart Watch stands out as a flexible and intelligent wearable made for those who value connection as well as an active lifestyle. The gadget has a large 2.01-inch IPS display with a 240x282 resolution that provides consumers with a bright and rich visual experience. Because of the large amount of screens real estate, alerts, fitness tracking statistics, and other information are easily accessible and readable. The XTRA Active S8's Li-polymer 210mAh battery outperforms the competition, lasting up to 6 days. This function alleviates consumer concerns about regular charging, allowing them to go about their everyday lives uninterrupted. The <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">smartwatch</a> has an IP67 waterproof rating, making it resistant to water exposure and perfect for use during diverse activities such as workouts and outdoor excursions. The XTRA Active S8's rugged build guarantees that it can survive the rigors of an active lifestyle. The device goes beyond the capabilities of a regular wristwatch by providing Bluetooth calling with HD original sound quality. Users may accept calls smoothly from their wrists, increasing convenience and efficiency. Furthermore, the watch has a multi-sports mode that caters to fitness aficionados by properly monitoring activities like running and cycling. This function delivers vital performance information, making it a useful tool for individuals dedicated to their fitness objectives. Another highlight of the XTRA Active S8 is its comprehensive health tracking, which includes functions like as heart rate monitoring and sleep tracking. This provides consumers with a comprehensive perspective of their health, allowing them to make educated health decisions. Smart notifications keep users up to date by sending call, message, and app alerts straight to their wrist. The XTRA Active S8's sleek and modern design adds a touch of flair to its utility, making it a versatile accessory appropriate for a variety of events. The XTRA Active S8 Smart Watch is a dependable and feature-packed companion that smoothly blends into the everyday lives of those seeking a balance between remaining connected and staying active. It is compatible with both Android and iOS smartphones. The XTRA Active S8 is designed to enhance your experience and keep you connected on the go, whether you're in a business meeting or working out.</p><h2 style=\"\">Buy XTRA Active S8 Bluetooth Calling Smartwatch from the best Smart Watch Shop in Bangladesh: Star Tech</h2><p>In Bangladesh, you can get original <span style=\"font-weight: bold;\">XTRA Active S8 Bluetooth Calling Smartwatch</span> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"_blank\">Smart Watch</a> to purchase. Order online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech </a>Shop to get yours at lowest price. The XTRA Active S8 Bluetooth Calling Smart Watch comes with a 01-year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"2.01’’ IPS Display, 240x282 Resolution"},{"key":"Battery","value":"Li-polymer 210mAh (Up to 6 Days)"},{"key":"Connectivity","value":"Bluetooth"},{"key":"Material","value":"Zinc alloy+ABC+PC"},{"key":"SpecialFeatures","value":"Bluetooth Calling Smart Watch"},{"key":"Sensor","value":"Heart rate monitoring, Blood Pressure, Sleep monitoring, Blood Oxygen, ECG, Weather, Music control, Sync message"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"06-months Warranty"}]}],"latest_price":{"heading":"What is the price of XTRA Active S8 Smart Watch in Bangladesh?","paragraph":"The latest price of XTRA Active S8 Smart Watch in Bangladesh is 1,870৳. You can buy the XTRA Active S8 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s8/active-s8-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s8/active-s8-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s8/active-s8-03-500x500.webp"],"product_seo_title":"XTRA Active S8 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy XTRA Active S8 Smart Watch at best price in Bangladesh. Latest XTRA Active S8 Bluetooth Calling Smartwatch available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"XTRA Active S8 Bluetooth Calling Smartwatch"},{"url":"https://www.startech.com.bd/xtra-active-s7-bluetooth-calling-smartwatch","img":"https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s7/active-s7-green-01-228x228.webp","title":"XTRA Active S7 Bluetooth Calling Smartwatch","product_list_short_description":["Display: 1.83\" large color Display","Battery: Long Battery life","Game: 4 Built In Game","Bluetooth Calling: Yes"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XTRA Smartwatch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XTRA Smartwatch at the best price in Bangladesh. Latest XTRA Smartwatch and Fitness Tracker available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XTRA Smartwatch","status":"Out Of Stock","code":"28178","brand":"XTRA","product_page_short_description":["Model: Active S7","Display: 1.83\" large color Display","Battery: Long Battery life","Game: 4 Built In Game","Bluetooth Calling: Yes"],"emi_price":0,"full_description":"<h2>XTRA Active S7 Bluetooth Calling Smart Watch</h2><p></p>The XTRA Active S7 Bluetooth Calling  has the ability to make, accept, and reject calls. It has a microphone and speaker built-in. XTRA Active S7 Smart Watch has a 1.83-inch large colorful display panel featuring a resolution of 240x280 pixels. The display is very bright and sharp. you can make calls, accept calls, and refuse calls. It has a built-in speaker and mic. You can see all of your smartwatch's notifications and replay your SMS from this smartwatch. Bluetooth 5.1 for a more stable connection. This device is more stylish and durable due to its aluminum frame. XTRA Active S7 Feels and looks very premium. This device also has music control, in-built games, spo2, heart rate, sleep monitoring, a steep counter, an alarm, and many more features.<p></p><h3>1.83\" Inch  Large Color Display</h3><p></p>The 1.83-inch display panel on the XTRA Active S7  features a 240x280 pixel resolution large and color display. At this price point, the sharpness and brightness of the display are up to the mark.<p></p><h3>BT 5.1 Bluetooth Calling</h3><p></p>In this device with 5.1 Bluetooth calling you can receive and reject calls and you can talk with the built-in speaker and mic. The voice quality is good enough. You can also make call from this device.<p></p><h3>4 Built In Game</h3><p></p>The XTRA Active S7 Bluetooth Calling Smart Watch has 4 built-in games for your refreshment. Now you do not have to boar you can play game in your smartwatch.<p></p><h2>Buy XTRA Active S7 Bluetooth Calling Smart Watch from the best Smart Watch Shop in Bangladesh: Star Tech</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/neckband\" target=\"_blank\">XTRA Active S7 Bluetooth Calling Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"_blank\">Smart Watch</a> to purchase. Order online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech </a>Shop to get yours at lowest price. The XTRA Active S7 Bluetooth Calling Smart Watch comes with a 01-year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.83\" Display, Resolution 240*284"},{"key":"Battery","value":"230mAh"},{"key":"Connectivity","value":"Bluetooth"},{"key":"SpecialFeatures","value":"Bluetooth Calling Smart Watch"},{"key":"Sensor","value":"Blood Oxygen, Blood Pressure"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01-year Warranty"}]}],"latest_price":{"heading":"What is the price of XTRA Active S7 Smart Watch in Bangladesh?","paragraph":"The latest price of XTRA Active S7 Smart Watch in Bangladesh is 2,220৳. You can buy the XTRA Active S7 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s7/active-s7-green-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s7/active-s7-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s7/active-s7-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s7/active-s7-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/xtra/active-s7/active-s7-grey-01-500x500.webp"],"product_seo_title":"XTRA Active S7 Bluetooth Calling Smart Watch Price in BD | Star Tech","product_seo_description":"Buy XTRA Active S7 Bluetooth Calling Smart Watch at the best price in Bangladesh. Latest XTRA Active S7 Smart Watch at Star Tech Shop. Order online to get delivery in BD.\n","product_seo_keywords":"XTRA Active S7 Bluetooth Calling Smart Watch"}]