[{"url":"https://www.startech.com.bd/targus-smart-surge-4-power-strip","img":"https://www.startech.com.bd/image/cache/catalog/power-strip/targus/smart-surge-4/smart-surge-4-02-228x228.webp","title":"Targus Smart Surge 4 with 2 USB Ports Power Strip","product_list_short_description":["Outlet x 4 plus USB x 2 (12W / 2.4A)","Surge Protection 1,000 JOULES","Maximum Current: 250V, 10A or 2,500W","2M / 6.6FT Power Cord, Child Safety Shutter"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Targus Power Strip Price in Bangladesh | Star Tech","cat_seo_description":"Buy Targus Power Strip at the best price in Bangladesh. The latest Targus Power Strip is available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Targus Power Strip","status":"Out Of Stock","code":"26907","brand":"Targus","product_page_short_description":["Model: APS13","Outlet x 4 plus USB x 2 (12W / 2.4A)","Surge Protection 1,000 JOULES","Maximum Current: 250V, 10A or 2,500W","2M / 6.6FT Power Cord, Child Safety Shutter"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">Targus Smart Surge 4 with 2 USB Ports Power Strip</h2><p style=\"text-align: justify; \">The Targus Smart Surge 4 features two USB ports. Power Strip is a handy and adaptable gadget that offers customers several outlets and USB ports for charging and powering their devices. Users can quickly connect their cell phones, tablets, laptops, and other gadgets to the power strip, which has four outlets and two USB connections. Because of the USB Smart Detection technology, the USB ports are intended to deliver optimal charging speed. This technology enables the power strip to recognize the precise charge required by the connected devices and give the fastest charging speed possible. This guarantees that your gadgets are charged fast and effectively, without being overloaded or damaged. Targus Smart Surge 4 with Dual USB Port Power Strip also provides up to 1,000 JOULES of surge protection. This implies that in the case of a power surge or spike, the power strip will aid in the protection of your connected devices. The power strip has a maximum current rating of 250V, 10A, or 2,500W, making it appropriate for a wide range of gadgets and appliances. The 2M / 6.6FT power cable is long enough to reach your gadgets, and the child safety shutter protects youngsters from electrical risks. The power strip also has a circuit breaker to prevent power overload. In the case of an electrical overload, this function protects the power strip and any attached devices. Overall, the Targus Smart Surge 4 with 2 USB Ports Power Strip is a dependable and efficient power option. Surge protectors from Targus keep your equipment from drawing more power than the power multiplier can manage. Surge protectors cut electricity, avoiding electrical fires and increasing the life of your equipment by absorbing damage caused by unstable voltage. The USB smart detection recognizes the precise charge required by the connected devices and gives the fastest charging speed possible.</p><h2>Buy Targus Smart Surge 4 with 2 USB Ports Power Strip from the best Power Strip Shop in BD</h2><p>In Bangladesh, you can get original&nbsp;<a href=\"https://www.startech.com.bd/targus-smart-surge-4-power-strip\" target=\"\">Targus Smart Surge 4 with 2 USB Ports Power Strip</a> From Star Tech. We have a large collection of the latest Targus <a href=\"https://www.startech.com.bd/accessories/power-strip\" target=\"\">Power Strip</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at the lowest price. The&nbsp;Targus Smart Surge 4 with 2 USB Ports Power Strip has no warranty.</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Sockets","value":"Outlet x 4 plus"},{"key":"USB Port","value":"2 (12W / 2.4A)"},{"key":"Cable Length","value":"2M / 6.6FT"},{"key":"Current","value":"250V, 10A or 2,500W"},{"key":"Others","value":"Plug Type: Type-B"}]},{"heading":"Manufacture Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Targus Smart Surge 4 with 2 USB Ports Power Strip in Bangladesh?","paragraph":"The latest price of Targus Smart Surge 4 with 2 USB Ports Power Strip in Bangladesh is 1,850৳. You can buy the Targus Smart Surge 4 with 2 USB Ports Power Strip at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/power-strip/targus/smart-surge-4/smart-surge-4-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/power-strip/targus/smart-surge-4/smart-surge-4-06-500x500.webp","https://www.startech.com.bd/image/cache/catalog/power-strip/targus/smart-surge-4/smart-surge-4-05-500x500.webp"],"product_seo_title":"Targus Smart Surge 4 with 2 USB Ports Power Strip price in Bangladesh","product_seo_description":"Buy Targus Smart Surge 4 with 2 USB Ports Power Strip at the best price in Bangladesh. Order latest Targus Smart Surge 4 Power Strip from Star Tech Online shop in BD.","product_seo_keywords":"Targus Smart Surge 4 with 2 USB Ports Power Strip"}]