[{"url":"https://www.startech.com.bd/monarch-mystery-box-x5-gaming-case","img":"https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5/mystery-box-x5-01-228x228.webp","title":"Monarch Mystery Box X5 Desktop Gaming Case","product_list_short_description":["Motherboard Support: ITX, M-ATX","Tempered Glass Panel: Front Glass, Left Glass","Pre-installed Fans: 5 x 120mm ARGB","Interface: USB3.0 x 1, USB2.0 x 2"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Monarch Casing Price in Bangladesh | Star Tech","cat_seo_description":"Buy Monarch Casing at the best price in Bangladesh. Latest Monarch Computer Casing available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Monarch Casing","status":"Out Of Stock","code":"34548","brand":"Monarch","product_page_short_description":["Model: Mystery Box X5","Motherboard Support: ITX, M-ATX","Tempered Glass Panel: Front Glass, Left Glass","Pre-installed Fans: 5 x 120mm ARGB","Interface: USB3.0 x 1, USB2.0 x 2"],"emi_price":0,"full_description":"<h2>Monarch Mystery Box X5 Desktop Gaming Case</h2><p>The Monarch <strong>Mystery Box X5</strong> Desktop Gaming <a href=\"https://www.startech.com.bd/component/casing\" target=\"\" style=\"color: rgb(0, 0, 0);\">Case </a>is a robust enclosure built to house your gaming powerhouse in elegance and functionality. This case, designed to fit both ITX and M-ATX motherboards, provides adaptability for a variety of system configurations while assuring compatibility with a wide range of hardware. The Mystery Box X5 has tempered glass panels on the front and left sides, providing not only durability and protection but also a clear view of your components, allowing you to show off your build in all its splendor. The Mystery Box X5's main feature is its amazing cooling capability. This case is equipped with five pre-installed 120mm ARGB fans, precisely arranged to maximize airflow and heat dissipation, ensuring maximum thermal performance even during the most intensive games. Addressable RGB lighting adds a dynamic and customized aesthetic touch to any setup, allowing you to create spectacular visual effects. The Mystery Box X5's interface is both convenient and versatile. It has one USB 3.0 connector and two USB 2.0 connections, allowing you to easily connect peripherals, storage devices, and other accessories, simplifying your gaming experience. The Monarch Mystery Box X5 Desktop Gaming Case is a sleek, powerful, and feature-rich option for gamers and enthusiasts looking for a perfect balance of style and performance. Whether you're starting a new build or updating an old one, this case is the ideal canvas for displaying your gaming expertise and taking your gaming experience to new heights.</p><h2>Buy Monarch Mystery Box X5 Desktop Gaming Case from Star Tech</h2><p>In Bangladesh, you can get original <strong>Monarch Mystery Box X5 Desktop Gaming Case</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/monarch-casing\" target=\"\">Monarch Casing</a> to purchase for your <a href=\"https://www.startech.com.bd/desktops\" target=\"\">Desktop PC</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Monarch Mystery Box X5 Desktop Gaming Case comes with no warranty.</p>","specifications":[{"heading":"Case Type","values":[{"key":"Type","value":"Mid Tower"},{"key":"Tempered Glass Panel","value":"Front Glass, Left Glass"},{"key":"Motherboard Support","value":"ITX, M-ATX"}]},{"heading":"External Features","values":[{"key":"Color(s)","value":"Black"},{"key":"Dimensions","value":"350*270*350mm"},{"key":"Pre- Installed Fans","value":"5x 120mm ARGB Fan"},{"key":"I/O Port","value":"USB3.0 x 1, USB2.0 x 2"}]},{"heading":"Additional Feature","values":[{"key":"PSU","value":"No Built-In Power Supply"},{"key":"Side Panel","value":"Tempered Glass"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Monarch Mystery Box X5 Desktop Gaming Case in Bangladesh?","paragraph":"The latest price of Monarch Mystery Box X5 Desktop Gaming Case in Bangladesh is 3,200৳. You can buy the Monarch Mystery Box X5 Desktop Gaming Case at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5/mystery-box-x5-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5/mystery-box-x5-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5/mystery-box-x5-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5/mystery-box-x5-04-500x500.webp"],"product_seo_title":"Monarch Mystery Box X5 Gaming Case Price in Bangladesh | Star Tech","product_seo_description":"Buy Monarch Mystery Box X5 Gaming Case at best price in Bangladesh. Latest Monarch Mystery Box X5 Desktop Gaming Case available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Monarch Mystery Box X5 Desktop Gaming Case\n"},{"url":"https://www.startech.com.bd/monarch-ice-cooler-x5-gaming-case-white","img":"https://www.startech.com.bd/image/cache/catalog/casing/monarch/ice-cooler-x5/ice-cooler-x5-001-228x228.webp","title":"Monarch Ice Cooler X5 ARGB Desktop Gaming Case White","product_list_short_description":["Motherboard: MICRO-ATX / ITX","Cooling Fan: Ice Cooler+ 5 Argb Fan","Drive Bays: 1*HDD , 1*SSD","Internal I/O Ports: USB3.0*1, USB2.0X2"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Monarch Casing Price in Bangladesh | Star Tech","cat_seo_description":"Buy Monarch Casing at the best price in Bangladesh. Latest Monarch Computer Casing available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Monarch Casing","status":"Up Coming","code":"36441","brand":"Monarch","product_page_short_description":["Model: Ice Cooler X5","Motherboard: MICRO-ATX / ITX","Cooling Fan: Ice Cooler+ 5 Argb Fan","Drive Bays: 1*HDD , 1*SSD","Internal I/O Ports: USB3.0*1, USB2.0X2"],"emi_price":0,"full_description":"<h2>Monarch Ice Cooler X5 ARGB Desktop Gaming Case White</h2><p>The Monarch <strong>Ice Cooler X5</strong> ARGB Desktop Gaming <a href=\"https://www.startech.com.bd/component/casing\" target=\"\" style=\"color: rgb(0, 0, 0);\">Case </a> White is an excellent choice for gaming fans and PC builders seeking a balance of design, cooling efficiency, and practicality. This case accepts both MICRO-ATX and ITX motherboards, making it suitable for a variety of build combinations. The Monarch Ice Cooler X5's main feature is its powerful cooling technology. It incorporates an Ice Cooler and five ARGB fans that not only add to the case's visual appeal with customizable lighting effects, but also assure ideal airflow to keep your components cool throughout long gaming sessions. The cooling support is thorough, with space for two 120mm fans at the top, two 120mm fans at the bottom, and one 120mm fan at the back, offering plenty of options for keeping a cool internal environment. The Monarch Ice Cooler X5's storage solutions are practical and suitable for the majority of gaming systems. The Ice Cooler X5 case has one HDD slot and one SSD bay, allowing you to install both a large hard disk and a fast solid-state drive for better data management and faster startup times. The White casing has four PCI card slots, allowing you to install extra components like as graphics cards, sound cards, or network cards. The internal I/O connections are conveniently positioned, with one USB 3.0 connector for fast data transfer and two USB 2.0 ports for extra peripheral access. The Monarch Ice Cooler X5 ARGB White Desktop Gaming Case provides superb cooling performance, diverse motherboard support, practical storage options, and crucial connection features, making it a dependable and elegant addition to any gaming setup.</p><h2>Buy Monarch Ice Cooler X5 ARGB Desktop Gaming Case White from Star Tech</h2><p>In Bangladesh, you can get original <strong>Monarch Ice Cooler X5 ARGB Desktop Gaming Case White</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/monarch-casing\" target=\"\">Monarch Casing</a> to purchase for your <a href=\"https://www.startech.com.bd/desktops\" target=\"\">Desktop PC</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Monarch Ice Cooler X5 ARGB Desktop Gaming Case White comes with no warranty.</p>","specifications":[{"heading":"Case Type","values":[{"key":"Type","value":"Mid Tower"},{"key":"Tempered Glass Panel","value":"Front Glass, Left Glass"},{"key":"Motherboard Support","value":"ITX, M-ATX"}]},{"heading":"External Features","values":[{"key":"Color(s)","value":"White"},{"key":"Weight","value":"2.25kg"},{"key":"Dimensions","value":"L280*W190*H375mm"},{"key":"Fan Support","value":"TOP: 120MM*2"},{"key":"Drive Bays","value":"1*HDD , 1*SSD"},{"key":"I/O Port","value":"USB3.0*1, USB2.0X2"}]},{"heading":"Additional Feature","values":[{"key":"Cooling System","value":"Cooling Fan: Ice Cooler+ 5 ARGB Fan"},{"key":"Side Panel","value":"Tempered Glass"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Monarch Ice Cooler X5 ARGB Gaming Case White in Bangladesh?","paragraph":"The latest price of Monarch Ice Cooler X5 ARGB Gaming Case White in Bangladesh is 0৳. You can buy the Monarch Ice Cooler X5 ARGB Gaming Case White at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/casing/monarch/ice-cooler-x5/ice-cooler-x5-001-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/ice-cooler-x5/ice-cooler-x5-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/ice-cooler-x5/ice-cooler-x5-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/ice-cooler-x5/ice-cooler-x5-04-500x500.webp"],"product_seo_title":"Monarch Ice Cooler X5 Gaming Case White Price in Bangladesh | Star Tech","product_seo_description":"Buy Monarch Ice Cooler X5 Gaming Case White at best price in Bangladesh. Latest Monarch Ice Cooler X5 Gaming Case White available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Monarch Ice Cooler X5 ARGB Desktop Gaming Case White"},{"url":"https://www.startech.com.bd/monarch-ice-cooler-x5-argb-gaming-case","img":"https://www.startech.com.bd/image/cache/catalog/casing/monarch/ice-cooler-x5-bk/ice-cooler-x5-bk-01-228x228.webp","title":"Monarch Ice Cooler X5 ARGB Desktop Gaming Case","product_list_short_description":["Motherboard: MICRO-ATX / ITX","Cooling Fan: Ice Cooler+ 5 Argb Fan","Drive Bays: 1*HDD , 1*SSD","Internal I/O Ports: USB3.0*1, USB2.0X2"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Monarch Casing Price in Bangladesh | Star Tech","cat_seo_description":"Buy Monarch Casing at the best price in Bangladesh. Latest Monarch Computer Casing available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Monarch Casing","status":"Up Coming","code":"36444","brand":"Monarch","product_page_short_description":["Model: Ice Cooler X5","Motherboard: MICRO-ATX / ITX","Cooling Fan: Ice Cooler+ 5 Argb Fan","Drive Bays: 1*HDD , 1*SSD","Internal I/O Ports: USB3.0*1, USB2.0X2"],"emi_price":0,"full_description":"<h2>Monarch Ice Cooler X5 ARGB Desktop Gaming Case </h2><p>The Monarch <strong>Ice Cooler X5</strong> ARGB Desktop Gaming <a href=\"https://www.startech.com.bd/component/casing\" target=\"\" style=\"color: rgb(0, 0, 0);\">Case </a> is a good choice for gamers and PC builders looking for a blend of style, cooling efficiency, and functionality. This case supports both MICRO-ATX and ITX motherboards, making it suitable for a wide range of build configurations. The Monarch Ice Cooler X5's standout feature is its strong cooling technology. It has an Ice Cooler and five ARGB fans, which not only enhance the case's visual attractiveness with customizable lighting effects, but also provide optimal airflow to keep your components cool throughout extended gaming sessions. The cooling support is extensive, with room for two 120mm fans at the top, two 120mm fans at the bottom, and one 120mm fan at the rear, providing several options for maintaining a cool internal environment. The Monarch Ice Cooler X5's storage options are practical and appropriate for the majority of gaming systems. The Ice Cooler X5 case contains one HDD slot and one SSD space, allowing you to install both a huge hard disk and a fast solid-state drive for improved data management and startup speeds. The Ice Cooler X5 case contains four PCI card slots, which let you to insert additional components like as graphics cards, sound cards, and network cards. The internal I/O connectors are well-positioned, with one USB 3.0 connector for quick data transmission and two USB 2.0 ports for additional peripheral access. The Monarch Ice Cooler X5 ARGB Black Desktop Gaming Case features superior cooling performance, broad motherboard support, practical storage options, and critical connectivity.</p><h2>Buy Monarch Ice Cooler X5 ARGB Desktop Gaming Case from Star Tech</h2><p>In Bangladesh, you can get original <strong>Monarch Ice Cooler X5 ARGB Desktop Gaming Case</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/monarch-casing\" target=\"\">Monarch Casing</a> to purchase for your <a href=\"https://www.startech.com.bd/desktops\" target=\"\">Desktop PC</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Monarch Ice Cooler X5 ARGB Desktop Gaming Case comes with no warranty.</p>","specifications":[{"heading":"Case Type","values":[{"key":"Type","value":"Mid Tower"},{"key":"Tempered Glass Panel","value":"Front Glass, Left Glass"},{"key":"Motherboard Support","value":"ITX, M-ATX"}]},{"heading":"External Features","values":[{"key":"Color(s)","value":"Black"},{"key":"Weight","value":"2.25kg"},{"key":"Dimensions","value":"L280*W190*H375mm"},{"key":"Fan Support","value":"TOP: 120MM*2"},{"key":"Drive Bays","value":"1*HDD , 1*SSD"},{"key":"I/O Port","value":"USB3.0*1, USB2.0X2"}]},{"heading":"Additional Feature","values":[{"key":"Cooling System","value":"Ice Cooler+ 5 Argb Fan"},{"key":"Side Panel","value":"Tempered Glass"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Monarch Ice Cooler X5 ARGB Gaming Case in Bangladesh?","paragraph":"The latest price of Monarch Ice Cooler X5 ARGB Gaming Case in Bangladesh is 0৳. You can buy the Monarch Ice Cooler X5 ARGB Gaming Case at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/casing/monarch/ice-cooler-x5-bk/ice-cooler-x5-bk-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/ice-cooler-x5-bk/ice-cooler-x5-bk-03-500x500.webp"],"product_seo_title":"Monarch Ice Cooler X5 Gaming Case Price in Bangladesh | Star Tech","product_seo_description":"Buy Monarch Ice Cooler X5 Gaming Case at best price in Bangladesh. Latest Monarch Ice Cooler X5 ARGB Gaming Case available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Monarch Ice Cooler X5 ARGB Desktop Gaming Case "},{"url":"https://www.startech.com.bd/monarch-infinity-x10-atx-gaming-case","img":"https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10/infinity-x10-04-228x228.webp","title":"Monarch Infinity X10 ARGB ATX Gaming Case","product_list_short_description":["Motherboard: ATX / M-ATX / ITX","Drive Bays: 1*HDD / 2*SSD","PCI Slots: 7","I/O Panel: USB3.0*2, Type-C*1"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Monarch Casing Price in Bangladesh | Star Tech","cat_seo_description":"Buy Monarch Casing at the best price in Bangladesh. Latest Monarch Computer Casing available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Monarch Casing","status":"Up Coming","code":"36445","brand":"Monarch","product_page_short_description":["Model: Infinity X10","Motherboard: ATX / M-ATX / ITX","Drive Bays: 1*HDD / 2*SSD","PCI Slots: 7","I/O Panel: USB3.0*2, Type-C*1"],"emi_price":0,"full_description":"<h2>Monarch Infinity X10 ARGB ATX Gaming Case</h2><p>The Monarch <strong>Infinity X10</strong> ARGB ATX Gaming <a href=\"https://www.startech.com.bd/component/casing\" target=\"\" style=\"color: rgb(0, 0, 0);\">Case </a>is a design and performance for dedicated gamers and PC enthusiasts. This sleek, modern box accommodates a broad range of motherboard sizes, including ATX, M-ATX, and ITX, making it ideal for various build setups and future upgrades. The Monarch Infinity X10 was designed with adequate storage solutions in mind, with one 3.5\" drive bay for an HDD and two 2.5\" drive bays for SSDs, giving you plenty of room for both high-capacity storage and lightning-fast performance. This makes it ideal for gamers who want ample storage for their game libraries and quick access to regularly used programs. The Infinity X10 casing is designed for expansion, with seven PCI slots to allow numerous graphics cards, sound cards, and other PCI expansion cards. This provides you the freedom to build a strong multi-GPU configuration or add other peripherals to improve your gaming experience. The I/O panel is deliberately designed to meet current connectivity demands, with two high-speed USB 3.0 ports and one adaptable USB Type-C port. These ports offer rapid data transmission rates and are ideal for connecting a variety of devices, including external storage, VR headsets, and peripherals. One of the Monarch Infinity X10's distinguishing characteristics is its ARGB lighting system. This technology not only improves the aesthetics of your gaming rig, but it also allows for bespoke lighting effects, allowing you to tailor your setup to your preferences. ARGB lighting may be synced with other compatible components to create a seamless and dynamic light display. The Monarch Infinity X10 ARGB ATX Gaming Case includes full motherboard compatibility, many of storage options, wide expansion capabilities, current connection features, and magnificent ARGB lighting. It is an excellent choice for gamers and PC builders wishing to construct a high-performance, visually appealing gaming system. </p><h2>Buy Monarch Infinity X10 ARGB ATX Gaming Case from Star Tech</h2><p>In Bangladesh, you can get original <strong>Monarch Infinity X10 ARGB ATX Gaming Case</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/monarch-casing\" target=\"\">Monarch Casing</a> to purchase for your <a href=\"https://www.startech.com.bd/desktops\" target=\"\">Desktop PC</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Monarch Infinity X10 ARGB ATX Gaming Case comes with no warranty.</p>","specifications":[{"heading":"Case Type","values":[{"key":"Type","value":"Mid Tower"},{"key":"Tempered Glass Panel","value":"Front Glass, Left Glass"},{"key":"Motherboard Support","value":"ATX, ITX, M-ATX"}]},{"heading":"External Features","values":[{"key":"Color(s)","value":"Black"},{"key":"Expansion Slots","value":"7"},{"key":"Drive Bays","value":"1*HDD / 2*SSD"},{"key":"I/O Port","value":"USB3.0*2, Type-C*1"}]},{"heading":"Additional Feature","values":[{"key":"Side Panel","value":"Tempered Glass"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Monarch Infinity X10 ARGB ATX Gaming Case in Bangladesh?","paragraph":"The latest price of Monarch Infinity X10 ARGB ATX Gaming Case in Bangladesh is 0৳. You can buy the Monarch Infinity X10 ARGB ATX Gaming Case at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10/infinity-x10-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10/infinity-x10-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10/infinity-x10-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10/infinity-x10-03-500x500.webp"],"product_seo_title":"Monarch Infinity X10 Gaming Case Price in Bangladesh | Star Tech","product_seo_description":"Buy Monarch Infinity X10 Gaming Case at best price in Bangladesh. Latest Monarch Infinity X10 ARGB ATX Gaming Case available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Monarch Infinity X10 ARGB ATX Gaming Case\n"},{"url":"https://www.startech.com.bd/monarch-infinity-x10-atx-gaming-case-white","img":"https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10-wh/infinity-x10-wh-01-228x228.webp","title":"Monarch Infinity X10 ARGB ATX Gaming Case White","product_list_short_description":["Motherboard: ATX / M-ATX / ITX","Drive Bays: 1*HDD / 2*SSD","PCI Slots: 7","I/O Panel: USB3.0*2, Type-C*1"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Monarch Casing Price in Bangladesh | Star Tech","cat_seo_description":"Buy Monarch Casing at the best price in Bangladesh. Latest Monarch Computer Casing available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Monarch Casing","status":"Up Coming","code":"36447","brand":"Monarch","product_page_short_description":["Model: Infinity X10","Motherboard: ATX / M-ATX / ITX","Drive Bays: 1*HDD / 2*SSD","PCI Slots: 7","I/O Panel: USB3.0*2, Type-C*1"],"emi_price":0,"full_description":"<h2>Monarch Infinity X10 ARGB ATX Gaming Case White</h2><p>The Monarch <strong>Infinity X10</strong> ARGB ATX Gaming <a href=\"https://www.startech.com.bd/component/casing\" target=\"\" style=\"color: rgb(0, 0, 0);\">Case </a> White is a design and performance option for avid gamers and PC enthusiasts. This sleek, modern box can support a wide range of motherboard sizes, including ATX, M-ATX, and ITX, making it suitable for a variety of build configurations and future upgrades. The Monarch Infinity X10 was created with suitable storage solutions in mind, with one 3.5\" HDD drive bay and two 2.5\" SSD drive bays, providing ample space for both high-capacity storage and lightning-fast performance. This makes it excellent for gamers who want enough of storage for their game libraries and easy access to frequently used apps. The Infinity X10 case is built for expansion, with seven PCI slots to accommodate a variety of graphics cards, sound cards, and other PCI expansion cards. This White Casing allows you to create a powerful multi-GPU system or connect additional peripherals to enhance your gaming experience. The I/O panel is purposefully intended to match modern connectivity requirements, including two high-speed USB 3.0 ports and one flexible USB Type-C port. These ports provide fast data transfer rates and are suitable for connecting a wide range of devices, including external storage, VR headsets, and peripherals. One of the Monarch Infinity X10's standout features is its ARGB lighting system. This technology not only enhances the looks of your gaming rig, but it also enables for custom lighting effects, allowing you to personalize your setup to your specific needs. ARGB lighting may be used with other suitable components to produce a smooth and dynamic light. The Monarch Infinity X10 ARGB ATX Gaming Case White offers complete motherboard compatibility, several storage options, extensive expansion capabilities, current connectivity features, and stunning ARGB lighting. It is a good choice for gamers and PC builders looking to build a powerful, visually stunning gaming machine.</p><h2>Buy Monarch Infinity X10 ARGB ATX Gaming Case White from Star Tech</h2><p>In Bangladesh, you can get original <strong>Monarch Infinity X10 ARGB ATX Gaming Case White</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/monarch-casing\" target=\"\">Monarch Casing</a> to purchase for your <a href=\"https://www.startech.com.bd/desktops\" target=\"\">Desktop PC</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Monarch Infinity X10 ARGB ATX Gaming Case White comes with no warranty.</p>","specifications":[{"heading":"Case Type","values":[{"key":"Type","value":"Mid Tower"},{"key":"Tempered Glass Panel","value":"Front Glass, Left Glass"},{"key":"Motherboard Support","value":"ATX, ITX, M-ATX"}]},{"heading":"External Features","values":[{"key":"Color(s)","value":"White"},{"key":"Expansion Slots","value":"7"},{"key":"Drive Bays","value":"1*HDD / 2*SSD"},{"key":"I/O Port","value":"USB3.0*2, Type-C*1"}]},{"heading":"Additional Feature","values":[{"key":"Side Panel","value":"Tempered Glass"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Monarch Infinity X10 ARGB ATX Gaming Case White in Bangladesh?","paragraph":"The latest price of Monarch Infinity X10 ARGB ATX Gaming Case White in Bangladesh is 0৳. You can buy the Monarch Infinity X10 ARGB ATX Gaming Case White at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10-wh/infinity-x10-wh-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10-wh/infinity-x10-wh-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10-wh/infinity-x10-wh-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/infinity-x10-wh/infinity-x10-wh-04-500x500.webp"],"product_seo_title":"Monarch Infinity X10 Gaming Case White Price in Bangladesh | Star Tech","product_seo_description":"Buy Monarch Infinity X10 Gaming Case White at best price in Bangladesh. Latest Monarch Infinity X10 ARGB Gaming Case available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Monarch Infinity X10 ARGB ATX Gaming Case White\n"},{"url":"https://www.startech.com.bd/monarch-aqua-x7-gaming-case","img":"https://www.startech.com.bd/image/cache/catalog/casing/monarch/aqua-x7/aqua-x7-001-228x228.webp","title":"Monarch Aqua X7 ARGB ATX Gaming Case","product_list_short_description":["M/B Support: ATX / M-ATX / ITX","Drive Bays: 1*HDD / 2*SSD","PCI Slots: 7","I/O Panel: USB3.0*2, Type-C*1"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Monarch Casing Price in Bangladesh | Star Tech","cat_seo_description":"Buy Monarch Casing at the best price in Bangladesh. Latest Monarch Computer Casing available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Monarch Casing","status":"Up Coming","code":"36449","brand":"Monarch","product_page_short_description":["Model: Aqua X7","M/B Support: ATX / M-ATX / ITX","Drive Bays: 1*HDD / 2*SSD","PCI Slots: 7","I/O Panel: USB3.0*2, Type-C*1"],"emi_price":0,"full_description":"<h2>Monarch Aqua X7 ARGB ATX Gaming Case</h2><p>The Monarch <strong>Aqua X7</strong> ARGB ATX Gaming <a href=\"https://www.startech.com.bd/component/casing\" target=\"\" style=\"color: rgb(0, 0, 0);\">Case </a>is an excellent alternative for gamers and PC enthusiasts who want a combination of performance, adaptability, and eye-catching design. This Aqua X7 casing is adaptable to a broad range of motherboard sizes, including ATX, M-ATX, and ITX, making it perfect for both new and experienced builders. The Monarch Aqua X7 has extensive storage capabilities, with dedicated drive bays for one HDD and two SSDs. This configuration guarantees that you have enough storage for your huge gaming collection, massive media files, and quick-access SSDs for your operating system and critical programs. This combination of storage solutions improves capacity and performance. The Monarch Aqua X7's seven PCI slots make it ideal for expansion. This enables the installation of numerous graphics, sound, network, and other PCI-based expansion cards. The ability to expand and improve your system's capabilities makes this case a perfect basis for a high-performance gaming machine or a powerful workstation. The Monarch Aqua X7's I/O panel is intended to meet current connection requirements. It has two USB 3.0 connections for quick data transfer and a flexible USB Type-C port that can accommodate a variety of devices, including external storage and VR headsets. This guarantees that you can easily connect all of your devices and accessories. One of the Monarch Aqua X7's distinguishing characteristics is its sophisticated ARGB lighting system. This system supports configurable and dynamic lighting effects, allowing you to adapt your setup to fit your individual style. The ARGB lighting may be synced with other compatible components, resulting in a unified and visually attractive light display that improves the overall look of your gaming setup. The Monarch Aqua X7 ARGB ATX Gaming Case includes full motherboard compatibility, many of storage options, wide expansion capabilities, current connectivity features, and an outstanding ARGB lighting system. It is an excellent choice for gamers and PC builders seeking to create a strong, adaptable, and visually appealing gaming machine.</p><h2>Buy Monarch Aqua X7 ARGB ATX Gaming Case from Star Tech</h2><p>In Bangladesh, you can get original <strong>Monarch Aqua X7 ARGB ATX Gaming Case</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/monarch-casing\" target=\"\">Monarch Casing</a> to purchase for your <a href=\"https://www.startech.com.bd/desktops\" target=\"\">Desktop PC</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Monarch Aqua X7 ARGB ATX Gaming Case comes with no warranty.</p>","specifications":[{"heading":"Case Type","values":[{"key":"Type","value":"Mid Tower"},{"key":"Tempered Glass Panel","value":"Yes"},{"key":"Motherboard Support","value":"ATX, ITX, M-ATX"}]},{"heading":"External Features","values":[{"key":"Color(s)","value":"Black"},{"key":"Weight","value":"11.72KG"},{"key":"Dimensions","value":"L460*W285*H490mm"},{"key":"Expansion Slots","value":"7"},{"key":"Fan Support","value":"Front Right: 3*120mm Fans(Or 240/280 Cooling),"},{"key":"Drive Bays","value":"1*HDD / 2*SSD"},{"key":"I/O Port","value":"USB3.0*2, Type-C*1"}]},{"heading":"Additional Feature","values":[{"key":"Cooling System","value":"360 Cooling, Bottom: 360 Cooling"},{"key":"Side Panel","value":"Tempered Glass"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Monarch Aqua X7 ARGB ATX Gaming Case in Bangladesh?","paragraph":"The latest price of Monarch Aqua X7 ARGB ATX Gaming Case in Bangladesh is 0৳. You can buy the Monarch Aqua X7 ARGB ATX Gaming Case at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/casing/monarch/aqua-x7/aqua-x7-001-500x500.webp"],"product_seo_title":"Monarch Aqua X7 Gaming Case Price in Bangladesh | Star Tech","product_seo_description":"Buy Monarch Aqua X7 Gaming Case at best price in Bangladesh. Latest Monarch Aqua X7 ARGB ATX Gaming Case available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Monarch Aqua X7 ARGB ATX Gaming Case\n\n"},{"url":"https://www.startech.com.bd/monarch-aqua-x7-gaming-case-white","img":"https://www.startech.com.bd/image/cache/catalog/casing/monarch/aqua-x7-wh/aqua-x7-wh-01-228x228.webp","title":"Monarch Aqua X7 ARGB ATX Gaming Case White","product_list_short_description":["M/B Support: ATX / M-ATX / ITX","Drive Bays: 1*HDD / 2*SSD","PCI Slots: 7","I/O Panel: USB3.0*2, Type-C*1"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Monarch Casing Price in Bangladesh | Star Tech","cat_seo_description":"Buy Monarch Casing at the best price in Bangladesh. Latest Monarch Computer Casing available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Monarch Casing","status":"Up Coming","code":"36451","brand":"Monarch","product_page_short_description":["Model: Aqua X7","M/B Support: ATX / M-ATX / ITX","Drive Bays: 1*HDD / 2*SSD","PCI Slots: 7","I/O Panel: USB3.0*2, Type-C*1"],"emi_price":0,"full_description":"<h2>Monarch Aqua X7 ARGB ATX Gaming Case White</h2><p>The Monarch <strong>Aqua X7</strong> ARGB ATX Gaming <a href=\"https://www.startech.com.bd/component/casing\" target=\"\" style=\"color: rgb(0, 0, 0);\">Case </a> White is a terrific choice for gamers and PC enthusiasts seeking a balance of performance, versatility, and eye-catching style. This Aqua X7 case White can accommodate a wide range of motherboard sizes, including ATX, M-ATX, and ITX, making it ideal for both beginner and experienced builders. The Monarch Aqua X7 features a large storage capacity, with separate drive bays for one HDD and two SSDs. This combination ensures that you have ample storage for your extensive game library, large media files, and quick-access SSDs for your operating system and key applications. This combination of storage technologies increases capacity and performance. The Monarch Aqua X7 has seven PCI slots, making it excellent for expansion. This permits the installation of multiple graphics, sound, network, and other PCI-based devices. With the option to extend and upgrade your system's capabilities, this case is ideal for building a high-performance gaming machine or a powerful workstation. The Monarch Aqua X7's I/O panel is designed to suit contemporary connectivity needs. It contains two USB 3.0 ports for fast data transfer and a versatile USB Type-C port that can support a wide range of devices, including external storage and VR headsets. This ensures that you can effortlessly connect all of your gadgets and accessories. One of the Monarch Aqua X7's standout features is its advanced ARGB lighting system. This system includes adjustable and dynamic lighting effects, allowing you to customize your configuration to suit your own preferences. The ARGB lighting may be synchronized with other compatible components, creating a coherent and visually appealing light show that enhances the overall appearance of your gaming setup. The Monarch Aqua X7 ARGB ATX Gaming Case White offers complete motherboard compatibility, a variety of storage options, extensive expansion possibilities, up-to-date connection features, and an exceptional ARGB lighting system. It is a good choice for gamers and PC builders who want to create a powerful, versatile, and visually stunning gaming computer.</p><h2>Buy Monarch Aqua X7 ARGB ATX Gaming Case White from Star Tech</h2><p>In Bangladesh, you can get original <strong>Monarch Aqua X7 ARGB ATX Gaming Case White</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/monarch-casing\" target=\"\">Monarch Casing</a> to purchase for your <a href=\"https://www.startech.com.bd/desktops\" target=\"\">Desktop PC</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Monarch Aqua X7 ARGB ATX Gaming Case White comes with no warranty.</p>","specifications":[{"heading":"Case Type","values":[{"key":"Type","value":"Mid Tower"},{"key":"Tempered Glass Panel","value":"Yes"},{"key":"Motherboard Support","value":"ATX, ITX, M-ATX"}]},{"heading":"External Features","values":[{"key":"Color(s)","value":"White"},{"key":"Weight","value":"11.72KG"},{"key":"Dimensions","value":"L460*W285*H490mm"},{"key":"Expansion Slots","value":"7"},{"key":"Fan Support","value":"Front Right: 3*120mm Fans(Or 240/280 Cooling),"},{"key":"Drive Bays","value":"1*HDD / 2*SSD"},{"key":"I/O Port","value":"USB3.0*2, Type-C*1"}]},{"heading":"Additional Feature","values":[{"key":"Cooling System","value":"360 Cooling, Bottom: 360 Cooling"},{"key":"Side Panel","value":"Tempered Glass"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Monarch Aqua X7 ARGB ATX Gaming Case White in Bangladesh?","paragraph":"The latest price of Monarch Aqua X7 ARGB ATX Gaming Case White in Bangladesh is 0৳. You can buy the Monarch Aqua X7 ARGB ATX Gaming Case White at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/casing/monarch/aqua-x7-wh/aqua-x7-wh-01-500x500.webp"],"product_seo_title":"Monarch Aqua X7 Gaming Case White Price in Bangladesh | Star Tech","product_seo_description":"Buy Monarch Aqua X7 Gaming Case White at best price in Bangladesh. Latest Monarch Aqua X7 ARGB ATX Gaming Case White available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Monarch Aqua X7 ARGB ATX Gaming Case White\n\n"},{"url":"https://www.startech.com.bd/monarch-gamer-x9-gaming-case","img":"https://www.startech.com.bd/image/cache/catalog/casing/monarch/gamer-x9/gamer-x9-01-228x228.webp","title":"Monarch Gamer X9 ARGB ATX Desktop Gaming Case","product_list_short_description":["M/B Support: ATX / Micro- ATX / ITX","Drive Bays: 2*HDD or 2*SSD","PCI Slots: 7","Right side material: 0.5-0.6mm SPCC"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Monarch Casing Price in Bangladesh | Star Tech","cat_seo_description":"Buy Monarch Casing at the best price in Bangladesh. Latest Monarch Computer Casing available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Monarch Casing","status":"Up Coming","code":"36452","brand":"Monarch","product_page_short_description":["Model: Gamer X9","M/B Support: ATX / Micro- ATX / ITX","Drive Bays: 2*HDD or 2*SSD","PCI Slots: 7","Right side material: 0.5-0.6mm SPCC"],"emi_price":0,"full_description":"<h2>Monarch Gamer X9 ARGB ATX Desktop Gaming Case</h2><p>The Monarch <strong>Gamer X9</strong> ARGB ATX Desktop Gaming Case is intended to provide gamers and PC builders with exceptional performance as well as eye-catching looks. This adaptable box accepts a broad range of motherboard types, including ATX, Micro-ATX, and ITX, providing the versatility required to fit a variety of build configurations, from powerful gaming rigs to efficient workstations. Storage solutions in the Monarch Gamer X9 are both functional and adaptable. The chassis has two dedicated drive bays that may accommodate either two 3.5\" HDDs for high-capacity storage or two 2.5\" SSDs for quicker data access and system performance. This dual-bay architecture allows you to add more games, data, or apps without running out of storage space. Expansion options are extensive, with seven PCI slots available for adding numerous graphics cards, sound cards, or other expansion cards. This comprehensive slot configuration allows you to create a strong multi-GPU configuration or add more peripherals and components to improve your system's capabilities. The right side panel of the Monarch Gamer X9 is made of high-quality 0.5-0.6mm SPCC steel. This material choice not only assures longevity and a solid structure, but also adds to the case's sleek, modern appearance. The use of SPCC steel offers the casing a premium feel while also offering dependable protection for your inside components. One of the Monarch Gamer X9's most notable features is its sophisticated ARGB lighting system. This system comprises many ARGB fans and lighting strips that provide a variety of adjustable and dynamic lighting effects. You can simply customize your gaming setup with brilliant colors, coordinated lighting patterns, and eye-catching visual effects that react to your games or mood. The ARGB lighting may be managed via the case's built-in lighting controller or synchronized with appropriate motherboard software to create a seamless and immersive gaming experience. In addition to its aesthetic and performance qualities, the Monarch Gamer X9 is built with exceptional cooling capabilities. The case has several fan mounting options, including space for up to three 120mm or two 140mm fans in the front, one 120mm fan at the rear, and two 120mm or 140mm fans at the top. This arrangement enables for effective circulation and cooling, ensuring that your system runs smoothly even under high loads. The I/O panel on the top of the casing features accessible connectors for current connectivity demands, such as two USB 3.0 ports for quick data transmission and a headset/audio jack for simple access to gaming devices. The Monarch Gamer X9 ARGB ATX Desktop Gaming Case combines cutting-edge technology, adaptable features, and a striking style to give an outstanding foundation for any high-performance gaming or PC build.</p><h2>Buy Monarch Gamer X9 ARGB ATX Desktop Gaming Case from Star Tech</h2><p>In Bangladesh, you can get original <strong>Monarch Gamer X9 ARGB ATX Desktop Gaming Case</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/monarch-casing\" target=\"\">Monarch Casing</a> to purchase for your <a href=\"https://www.startech.com.bd/desktops\" target=\"\">Desktop PC</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Monarch Gamer X9 ARGB ATX Desktop Gaming Case comes with no warranty.</p>","specifications":[{"heading":"Case Type","values":[{"key":"Type","value":"Mid Tower"},{"key":"Tempered Glass Panel","value":"Yes"},{"key":"Motherboard Support","value":"ATX, ITX, M-ATX"}]},{"heading":"External Features","values":[{"key":"Color(s)","value":"Black"},{"key":"Material","value":"Right Side Material: 0.5-0.6mm SPCC ;"},{"key":"Weight","value":"8kg"},{"key":"Dimensions","value":"L460*W285*H490mm"},{"key":"Expansion Slots","value":"7"},{"key":"Fan Support","value":"Top: 120mm*3/140mm*2 Rear：120*1mm,"},{"key":"Drive Bays","value":"2*HDD Or 2*SSD"},{"key":"I/O Port","value":"USB2.0*2+U3.0*1+HD AUDIO"}]},{"heading":"Additional Feature","values":[{"key":"Side Panel","value":"Tempered Glass"}]},{"heading":"Clearance Space","values":[{"key":"Maximum CPU Cooler Height","value":"165mm"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Monarch Gamer X9 ARGB ATX Desktop Gaming Case in Bangladesh?","paragraph":"The latest price of Monarch Gamer X9 ARGB ATX Desktop Gaming Case in Bangladesh is 0৳. You can buy the Monarch Gamer X9 ARGB ATX Desktop Gaming Case at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/casing/monarch/gamer-x9/gamer-x9-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/gamer-x9/gamer-x9-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/gamer-x9/gamer-x9-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/gamer-x9/gamer-x9-04-500x500.webp"],"product_seo_title":"Monarch Gamer X9 Gaming Case Price in Bangladesh | Star Tech","product_seo_description":"Buy Monarch Gamer X9 Gaming Case at best price in Bangladesh. Latest Monarch Gamer X9 ARGB ATX Gaming Case available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Monarch Gamer X9 ARGB ATX Desktop Gaming Case\n\n"},{"url":"https://www.startech.com.bd/monarch-mystery-box-x5-gaming-case-white","img":"https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5-white/mystery-box-x5-white-01-228x228.webp","title":"Monarch Mystery Box X5 Desktop Gaming Case White","product_list_short_description":["Motherboard Support: ITX, M-ATX","Tempered Glass Panel: Front Glass, Left Glass","Pre-installed Fans: 5 x 120mm ARGB","Interface: USB3.0 x 1, USB2.0 x 2"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Monarch Casing Price in Bangladesh | Star Tech","cat_seo_description":"Buy Monarch Casing at the best price in Bangladesh. Latest Monarch Computer Casing available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Monarch Casing","status":"Out Of Stock","code":"34550","brand":"Monarch","product_page_short_description":["Model: Mystery Box X5","Motherboard Support: ITX, M-ATX","Tempered Glass Panel: Front Glass, Left Glass","Pre-installed Fans: 5 x 120mm ARGB","Interface: USB3.0 x 1, USB2.0 x 2"],"emi_price":0,"full_description":"<h2>Monarch Mystery Box X5 Desktop Gaming Case White</h2><p>The Monarch <strong>Mystery Box X5</strong> Desktop Gaming <a href=\"https://www.startech.com.bd/component/casing\" target=\"\" style=\"color: rgb(0, 0, 0);\">Case </a>White is a sturdy case designed to house your gaming powerhouse in both style and practicality. This case, which is intended to accept both ITX and M-ATX motherboards, allows for a number of system configurations while being compatible with a broad range of components. The Mystery Box X5 boasts tempered glass panels on the front and left sides, which provide not only durability and protection but also a clear view of your components, letting you to show off your build to its full potential. The Mystery Box X5's key feature is its incredible cooling capacity. This case comes with five pre-installed 120mm ARGB fans that are perfectly positioned to enhance airflow and heat dissipation, delivering optimal thermal performance even during the most intense games. Addressable RGB lighting provides a dynamic and customizable appearance to any setup, allowing you to create stunning visual effects. The Mystery Box X5's UI is both practical and adaptable. It contains one USB 3.0 connector and two USB 2.0 connectors, enabling you to effortlessly connect peripherals, storage devices, and other accessories to enhance your gaming experience. The Monarch Mystery Box X5 Desktop Gaming Case is a sleek, powerful, and feature-rich choice for gamers and enthusiasts seeking the ideal combination of design and performance. Whether you're beginning a new build or modifying an existing one, this case is the perfect canvas for showcasing your gaming skills and elevating your gaming experience.</p><h2>Buy Monarch Mystery Box X5 Desktop Gaming Case White from Star Tech</h2><p>In Bangladesh, you can get original <strong>Monarch Mystery Box X5 Desktop Gaming Case White</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/monarch-casing\" target=\"\">Monarch Casing</a> to purchase for your <a href=\"https://www.startech.com.bd/desktops\" target=\"\">Desktop PC</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Monarch Mystery Box X5 Desktop Gaming Case White comes with no warranty.</p>","specifications":[{"heading":"Case Type","values":[{"key":"Type","value":"Mid Tower"},{"key":"Tempered Glass Panel","value":"Front Glass, Left Glass"},{"key":"Motherboard Support","value":"ITX, M-ATX"}]},{"heading":"External Features","values":[{"key":"Color(s)","value":"White"},{"key":"Dimensions","value":"350*270*350mm"},{"key":"Pre- Installed Fans","value":"5x 120mm ARGB Fan"},{"key":"I/O Port","value":"USB3.0 x 1, USB2.0 x 2"}]},{"heading":"Additional Feature","values":[{"key":"PSU","value":"No Built-In Power Supply"},{"key":"Side Panel","value":"Tempered Glass"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Monarch Mystery Box X5 Gaming Case White in Bangladesh?","paragraph":"The latest price of Monarch Mystery Box X5 Gaming Case White in Bangladesh is 3,300৳. You can buy the Monarch Mystery Box X5 Gaming Case White at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5-white/mystery-box-x5-white-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5-white/mystery-box-x5-white-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5-white/mystery-box-x5-white-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/casing/monarch/mystery-box-x5-white/mystery-box-x5-white-03-500x500.webp"],"product_seo_title":"Monarch Mystery Box X5 Gaming Case White Price in Bangladesh | Star Tech","product_seo_description":"Buy Monarch Mystery Box X5 Gaming Case White at best price in Bangladesh. Latest Monarch Mystery Box X5 Gaming Case available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Monarch Mystery Box X5 Desktop Gaming Case White\n"}]