[{"url":"https://www.startech.com.bd/elite-1-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/elite/ehs-12crn/ehs-12crn-01-228x228.webp","title":"ELITE 1 Ton Non-Inverter AC (Split Type EHS-12CRN)","product_list_short_description":["Compressor Type: ROTARY","Cooling Capacity: 12000 BTU","Cooling Area: 80-120 sq feet","3 Stage Energy Efficiency"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Elite AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Elite AC at the best price in Bangladesh. Latest Elite Air Conditioners available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Elite AC, Elite Air Conditioner, Residential Air Conditioner","status":"Up Coming","code":"34136","brand":"Elite","product_page_short_description":["Model: EHS-12CRN","Compressor Type: ROTARY","Cooling Capacity: 12000 BTU","Cooling Area: 80-120 sq feet","3 Stage Energy Efficiency"],"emi_price":0,"full_description":"<h2>ELITE 1 Ton Non-Inverter AC (Split Type EHS-12CRN)</h2><p>The ELITE 1 Ton Non-Inverter AC (Split Type EHS-12CRN) has an excellent set of features designed to provide maximum comfort and convenience. This ELITE 1-ton Split Non-Inverter AC effectively distributes air around the room in two directions, removing hot spots and guaranteeing steady cooling. Its 3-stage energy efficiency rating allows you to save much money on your electricity bill while simultaneously maintaining comfort and minimizing energy use. The ELITE 1-Ton Non-Inverter AC (Split Type EHS-12CRN) readily detachable panel makes maintenance simple and hassle-free by providing easy access for cleaning and maintenance. Adding an anti-fungus bacterial filter improves indoor air quality by guaranteeing that the air you breathe is pure and healthful. This split AC is eco-friendly because it saves an impressive 40% on energy. Even in hot and muggy weather, it works well because of its strong ambient cooling capacity. While features like auto swing, 3D airflow, and flash cool improve the overall cooling experience, the washable filters make maintenance even easier. This unit is ISO, BSTI approved, and BUET tested, guaranteeing quality and performance. It is outfitted with a dependable GMCC compressor. The unit's components are made more durable and fresh by the golden fin with fresh air function. With its silent operation at 40 dB indoor commotion level, it guarantees a calm atmosphere. The dynamic carbon deodorizer also gets rid of offensive smells, leaving your room feeling fresh. With a 12000 BTU capacity, this ELITE 1 Ton Non-Inverter AC (Split Type EHS-12CRN) is appropriate for spaces between 80 and 120 square feet.</p><h2>Buy ELITE 1 Ton Non-Inverter AC (Split Type EHS-12CRN) from Star Tech</h2><p>In Bangladesh, you can get original <strong>ELITE 1 Ton Non-Inverter AC (Split Type EHS-12CRN)</strong>&nbsp;From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/elite-air-conditioner\" target=\"\">Elite Air Conditionar</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The ELITE 1 Ton Non-Inverter AC (Split Type EHS-12CRN) has&nbsp;<span style=\"text-align: justify;\">05 Years Compressor &amp; 01 Year Spare Parts Warranty (The Elite warranty card must be kept for any warranty).</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"1 Ton"},{"key":"Coverage","value":"80-120 sq feet"},{"key":"Energy Saving Rating","value":"40% Energy Saving"},{"key":"Capacity of Cooling (BTU)","value":"12000 BTU"},{"key":"Airflow","value":"Turbo/Hi/Mi/Lo 500/550/600/630 m3/h"},{"key":"Noise Level","value":"54 dB(A)"},{"key":"Compressor Type","value":"Rotary"},{"key":"Refrigerant Type","value":"R410A"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor Unit: 881 x 296 x 205mm"},{"key":"Weight","value":"Indoor Unit: 10.7kg"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"05 Years Compressor & 01 Year Spare Parts Warranty (The Elite warranty card must be kept for any warranty)."}]}],"latest_price":{"heading":"What is the price of ELITE 1 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of ELITE 1 Ton Non-Inverter AC in Bangladesh is 35,000৳. You can buy the ELITE 1 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/elite/ehs-12crn/ehs-12crn-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/elite/ehs-12crn/ehs-12crn-02-500x500.webp"],"product_seo_title":"ELITE 1 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy ELITE 1 Ton Non-Inverter AC at best price in Bangladesh. Latest ELITE 1 Ton Non-Inverter Air Conditioner (EHS-12CRN) at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"ELITE 1 Ton Non-Inverter AC (Split Type EHS-12CRN)"},{"url":"https://www.startech.com.bd/elite-1-5-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/elite/1-5-ton/elite-1-5-ton-228x228.jpg","title":"ELITE 1.5 Ton Non-Inverter AC (Split Type EHS-18CRN)","product_list_short_description":["Super Quick-cool Technology","Smart Connectivity","40% Energy Saving","120/150 sqft coverage"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Elite AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Elite AC at the best price in Bangladesh. Latest Elite Air Conditioners available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Elite AC, Elite Air Conditioner, Residential Air Conditioner","status":"Up Coming","code":"17470","brand":"Elite","product_page_short_description":["Model: EHS-18CRN","Super Quick-cool Technology","Smart Connectivity","40% Energy Saving","120/150 sqft coverage"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">ELITE 1.5 Ton Non-Inverter AC (Split Type EHS-18CRN)</h2><p style=\"text-align: justify; \">The ELITE 1.5 Ton Non-Inverter AC (Split Type EHS-18CRN) comes with Auto Restart Function, Temp Compensation, Turbo Mode, Cold Catalyst Filter, Sleep Mode, Anti-rust Cabinet, Independent Dehumidification, Louver Position Memory Function, Diamond Shape Outdoor. It can cover up to 120/150 sqft. The power systems are made in a universal and modern design, familiar to most users, the development was carried out based on data for the study of consumer needs around the world. Remote controller with a revolutionary ergonomic design, which is a manufacturer called Arctic Fox including settings with indoor units. The ELITE 1.5 Ton Non-Inverter AC (Split Type EHS-18CRN) with the development of forms and functional remote control and to attract the best world experts in the field of ergonomics and industrial design, by the display remote indicator has increased by 27% the area of display graphics, and system icons. This type of air conditioner is the most popular as the compressor and the condenser cooling fan (located in the outer, street block) are separated from the evaporator blower (located in the interior, indoor unit). The ELITE 1.5 Ton Non-Inverter AC (Split Type EHS-18CRN) has a BTU of 18000. Max power consumption is about 2750w. It has 05 Years Compressor &amp; 01 Year Spare Parts Warranty (The Elite warranty card must be kept for any warranty).</p>","specifications":[],"latest_price":{"heading":"What is the price of ELITE 1.5 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of ELITE 1.5 Ton Non-Inverter AC in Bangladesh is 46,000৳. You can buy the ELITE 1.5 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/elite/1-5-ton/elite-1-5-ton-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/air-conditioner/elite/1-5-ton/elite-1-5-ton-outer-500x500.jpg"],"product_seo_title":"ELITE 1.5 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy ELITE 1.5 Ton Non-Inverter AC at best price in Bangladesh. Latest ELITE 1.5 Ton Non-Inverter Air Conditioner (EHS-18CRN) at Star Tech. Order online for delivery in BD.","product_seo_keywords":"ELITE 1.5 Ton Non-Inverter AC (Split Type EHS-18CRN)"},{"url":"https://www.startech.com.bd/elite-2-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/elite/2-ton/elite-2-ton-228x228.jpg","title":"ELITE 2 Ton Non-Inverter AC (Split Type EHS-24CRN)","product_list_short_description":["Super Quick-cool Technology","Smart Connectivity","40% Energy Saving","200/250 sqft coverage"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Elite AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Elite AC at the best price in Bangladesh. Latest Elite Air Conditioners available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Elite AC, Elite Air Conditioner, Residential Air Conditioner","status":"Up Coming","code":"17471","brand":"Elite","product_page_short_description":["Model: EHS-24CRN","Super Quick-cool Technology","Smart Connectivity","40% Energy Saving","200/250 sqft coverage"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">ELITE 2 Ton Non-Inverter AC (Split Type EHS-24CRN)</h2><p style=\"\">The ELITE 2 Ton Non-Inverter AC (Split Type EHS-24CRN) comes with many features such as Auto-Restart Function, Temp Compensation, Turbo Mode, Cold Catalyst Filter, Sleep Mode, Anti-rust Cabinet, Independent Dehumidification, Louver Position Memory Function, Diamond Shape Outdoor. It can cover up to 200/250 sqft. The power systems are made in a universal and modern design, familiar to most users, the development was carried out based on data for the study of consumer needs around the world. It has a BTU of 24000. Max power consumption is about 2750w. The ELITE 2 Ton Non-Inverter AC (Split Type EHS-24CRN) Remote controller with a revolutionary ergonomic design, which is a manufacturer called Arctic Fox includes settings with indoor units. With the development of forms and functional remote control and to attract the best world experts in the field of ergonomics and industrial design, the display remote indicator has increased by 27% the area of display graphics, and system icons. This type of air conditioner is the ELITE 2 Ton Non-Inverter AC (Split Type EHS-24CRN) most popular as the compressor and the condenser cooling fan (located in the outer, street block) are separated from the evaporator blower (located in the interior, indoor unit). The ELITE 2 Ton Non-Inverter AC (Split Type EHS-24CRN) has 05 Years Compressor &amp; 01 Year Spare Parts Warranty (The Elite warranty card must be kept for any warranty).</p>","specifications":[],"latest_price":{"heading":"What is the price of ELITE 2 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of ELITE 2 Ton Non-Inverter AC in Bangladesh is 57,000৳. You can buy the ELITE 2 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/elite/2-ton/elite-2-ton-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/air-conditioner/elite/2-ton/elite-2-ton-outer-500x500.jpg"],"product_seo_title":"ELITE 2 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy ELITE 2 Ton Non-Inverter AC at best price in Bangladesh. Latest ELITE 2 Ton Non-Inverter Air Conditioner (EHS-24CRN) at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"ELITE 2 Ton Non-Inverter AC (Split Type EHS-24CRN)"}]