[{"url":"https://www.startech.com.bd/xiaomi-1-ton-non-inverte-ac-viomi-a2","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/xiaomi/viomi-a2/viomi-a2-01-228x228.webp","title":"Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2)","product_list_short_description":["Type: Split","Technology: Non-Inverter","Cooling Capacity: 12000BTU/hr. Golden Fin","3D Airflow Comfort, Multi Fan Speeds, R32A Refrigerant"],"price_new":43000,"price_old":49990,"price_single":43000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Xiaomi AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Xiaomi AC at best price in Bangladesh. Latest Xiaomi Viomi Inverter & non-inverter AC available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"XIAOMI AC, Smart AC, Smart Air Conditioner, XIAOMI Inverter Air Conditioner, XIAOMI","status":"In Stock","code":"35764","brand":"XIAOMI","product_page_short_description":["Model: Viomi A2","Type: Split","Technology: Non-Inverter","Cooling Capacity: 12000BTU/hr. Golden Fin","3D Airflow Comfort, Multi Fan Speeds, R32A Refrigerant"],"emi_price":3875,"full_description":"<h2>Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2)</h2><p>The <strong>Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2)</strong> is designed to deliver high cooling efficiency and innovative features. With a cooling capacity of 12,000 Btu, this air conditioner is suitable for rooms up to 150 square feet and provides strong and constant cooling performance. Its airflow rate of 660 cubic meters per hour guarantees quick dispersion of cold air, resulting in a more pleasant atmosphere. The Viomi A2 employs an eco-friendly refrigerant, which not only contributes to its remarkable energy-saving rating of 3.23 but also helps to reduce its environmental footprint. This energy efficiency is further boosted by its low power usage of 850 watts, making it an affordable alternative for your cooling needs. The unit is designed to work on a conventional 230V/50Hz power supply and is compatible with the majority of electrical systems used in homes and offices. One of the Viomi A2's&nbsp; <a href=\"https://www.startech.com.bd/air-conditioner\" target=\"\" style=\"color: rgb(0, 0, 0);\">AC </a>distinguishing characteristics is its auto restart function, which restarts functioning with the same settings after a power interruption, assuring continuous comfort. Furthermore, the auto sleep mode intelligently changes the temperature and fan speed to offer the best sleeping conditions, improving both comfort and energy economy. The Viomi A2's Air Conditioner sleek, modern appearance compliments any interior style, and its tiny form factor makes installation simple and takes up little room. The device also has a digital display for simple monitoring and adjustment of temperature settings, as well as a remote control for effortless operation from anywhere in the room. The Viomi A2 AC uses innovative filters to enhance indoor air quality by eliminating dust, pollen, and other allergens, making it a perfect solution for people who have respiratory problems or allergies. The AC's silent operation guarantees that it does not disrupt your activities or sleep, resulting in a peaceful atmosphere in your house. The Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2) offers powerful cooling performance, energy economy, and user-friendly features, making it a flexible and dependable option for keeping a comfortable interior atmosphere all year.</p><h2>Buy Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xiaomi-ac\" target=\"\">Xiaomi Air Conditioner</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2) comes with (05 Years Compressor &amp; 01 Year Spare Parts Warranty-The Viomi warranty card must be kept for any warranty claim.)</p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"1 Ton"},{"key":"Coverage","value":"Up to 120 Sft"},{"key":"Energy Saving Rating","value":"3.23"},{"key":"Capacity of Cooling (BTU)","value":"12,000 BTU"},{"key":"Airflow","value":"660 M3/Hr. Refrigerant Type"},{"key":"Noise Level","value":"Indoor: 45dB"},{"key":"Compressor Type","value":"Rotary"},{"key":"Condenser Type","value":"Golden Fin Condenser"},{"key":"Refrigerant Type","value":"R22"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"230V/ 50Hz"},{"key":"Power Consumption","value":"850 Watts"}]},{"heading":"Physical Specification","values":[{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"05 Years Compressor & 01 Year Spare Parts Warranty-The Viomi warranty card must be kept for any warranty claim."}]}],"latest_price":{"heading":"What is the price of Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2) in Bangladesh?","paragraph":"The latest price of Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2) in Bangladesh is 43,000৳. You can buy the Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2) at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/xiaomi/viomi-a2/viomi-a2-01-500x500.webp"],"product_seo_title":"Xiaomi 1 Ton Non-Inverter AC (Viomi A2) Price in Bangladesh | Star Tech","product_seo_description":"Buy Xiaomi 1 Ton Non-Inverter AC (Viomi A2) at the best price in Bangladesh. Latest Xiaomi 1 Ton Non-Inverter Air Conditioner at Star Tech. Order online for delivery in BD.\n","product_seo_keywords":"Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A2)"},{"url":"https://www.startech.com.bd/xiaomi-1.5-ton-non-inverte-ac-viomi-a2","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/xiaomi/viomi-a2/viomi-a2-01-228x228.webp","title":"Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2)","product_list_short_description":["Type: Split","Technology: Non-Inverter","Cooling Capacity: 12000BTU/hr. Golden Fin","3D Airflow Comfort, Multi Fan Speeds, R32A Refrigerant"],"price_new":54000,"price_old":59990,"price_single":54000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Xiaomi AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Xiaomi AC at best price in Bangladesh. Latest Xiaomi Viomi Inverter & non-inverter AC available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"XIAOMI AC, Smart AC, Smart Air Conditioner, XIAOMI Inverter Air Conditioner, XIAOMI","status":"In Stock","code":"35765","brand":"XIAOMI","product_page_short_description":["Model: Viomi A2","Type: Split","Technology: Non-Inverter","Cooling Capacity: 12000BTU/hr. Golden Fin","3D Airflow Comfort, Multi Fan Speeds, R32A Refrigerant"],"emi_price":4875,"full_description":"<h2>Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2)</h2><p>The <strong>Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2)</strong> is intended to provide great cooling efficiency and novel features. With a cooling capacity of 12,000 Btu, this air conditioner is ideal for rooms up to 150 square feet and delivers powerful and consistent cooling performance. Its airflow rate of 660 cubic meters per hour ensures rapid dispersion of cold air, resulting in a more comfortable environment. The Viomi A2 1.5 ton AC uses an environmentally friendly refrigerant, which not only contributes to its impressive energy-saving rating of 3.23 but also helps to lessen its environmental impact. This energy efficiency is further enhanced by its low power consumption of 850 watts, making it an inexpensive option for your cooling requirements. The item is meant to run on a regular 230V/50Hz power source. It is compatible with the majority of electrical systems used in homes and offices. One of the Viomi A2's&nbsp; <a href=\"https://www.startech.com.bd/air-conditioner\" target=\"\" style=\"color: rgb(0, 0, 0);\">AC </a>Its defining feature is the auto restart function, which resumes operation with the same settings after a power outage, ensuring continued comfort. Furthermore, the auto sleep mode automatically adjusts the temperature and fan speed to provide optimal sleeping circumstances, increasing both comfort and energy efficiency. The Viomi A2 Air Conditioner's sleek, modern design complements any interior style, and its small size makes installation straightforward and takes up minimal space. The gadget also has a digital display for easy monitoring and modification of temperature settings, as well as a remote control for convenient operation from anywhere in the room. The Viomi A2 AC utilizes revolutionary filters to improve indoor air quality by reducing dust, pollen, and other allergens, making it an ideal alternative for individuals. The AC's silent operation ensures that it does not disturb your activities or sleep, resulting in a calm environment in your home. The Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2) provides powerful cooling performance, energy efficiency, and user-friendly features, making it a versatile and trustworthy choice for maintaining a comfortable interior environment throughout the year.</p><h2>Buy Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xiaomi-ac\" target=\"\">Xiaomi Air Conditioner</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2) comes with (05 Years Compressor &amp; 01 Year Spare Parts Warranty-The Viomi warranty card must be kept for any warranty claim.)</p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"1.5 Ton"},{"key":"Coverage","value":"Up to 120 Sft"},{"key":"Energy Saving Rating","value":"3.23"},{"key":"Capacity of Cooling (BTU)","value":"12,000 BTU"},{"key":"Airflow","value":"660 M3/Hr. Refrigerant Type"},{"key":"Noise Level","value":"Indoor: 45dB"},{"key":"Compressor Type","value":"Rotary"},{"key":"Condenser Type","value":"Golden Fin Condenser"},{"key":"Refrigerant Type","value":"R22"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"230V/ 50Hz"},{"key":"Power Consumption","value":"850 Watts"}]},{"heading":"Physical Specification","values":[{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"05 Years Compressor & 01 Year Spare Parts Warranty-The Viomi warranty card must be kept for any warranty claim."}]}],"latest_price":{"heading":"What is the price of Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2) in Bangladesh?","paragraph":"The latest price of Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2) in Bangladesh is 54,000৳. You can buy the Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2) at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/xiaomi/viomi-a2/viomi-a2-01-500x500.webp"],"product_seo_title":"Xiaomi 1.5 Ton Non-Inverter AC (Viomi A2) Price in Bangladesh | Star Tech","product_seo_description":"Buy Xiaomi 1.5 Ton Non-Inverter AC (Viomi A2) at the best price in Bangladesh. Latest Xiaomi 1.5 Ton Non-Inverter Air Conditioner at Star Tech. Order online for delivery in BD.\n","product_seo_keywords":"Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A2)"},{"url":"https://www.startech.com.bd/xiaomi-1-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/xiaomi/viomi-a1/xiaomi-viomi-a1-228x228.jpg","title":"Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A1)","product_list_short_description":["Type: Split Non-Inverter Smart AC","AC Capacity: 1 TON","Powerful & Tropical Compressor","Copper Pipe Efficient & Quiet Design"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Xiaomi AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Xiaomi AC at best price in Bangladesh. Latest Xiaomi Viomi Inverter & non-inverter AC available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"XIAOMI AC, Smart AC, Smart Air Conditioner, XIAOMI Inverter Air Conditioner, XIAOMI","status":"Up Coming","code":"22031","brand":"XIAOMI","product_page_short_description":["Model: Viomi A1","Type: Split Non-Inverter Smart AC","AC Capacity: 1 TON","Powerful & Tropical Compressor","Copper Pipe Efficient & Quiet Design"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify;\">Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A1)</h2><p>The Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A1) is a smart AC from Xiaomi. The Xiaomi Viomi AI air conditioner has been developed in collaboration with Dyson experts to create the most comfortable cool and warm airflow. This air conditioner features 1.8 liters/h moisture removal, 45dB indoor noise level, 55dB outdoor noise level, 198~264 198~264 voltage range, and 5275W capacity. It comes with 1 ton 12000 BTU, Power Type/ Voltage/ Phase: 230V/50Hz, Input Power Consumption: 850. Its multi-fan speeds, wide angel AC louvers, comfortable sleeping mode, anti-cool wind, intelligent defrosting, drying operation, auto clean, LED control and soft start, golden fin condenser, turbo button, clock display, self-diagnosis, washable air purifying filters, memory function, lock, automatic operation, and on/off the system, golden fin condenser, low voltage startup, low-temperature startup, intelligent defrosting and up/down air outlet, auto restart / auto-sleep, airflow directional control. This Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A1) featured with Power Type/ Voltage/ Phase: 230V/50Hz and Input Power Consumption: 850, Refrigerant Type: R22, Energy Efficient Class A+: 60% Electricity saving, Noise Calculations (dB), Indoor Unit: â‰¤ 37, Outdoor unit: â‰¤ 47. This non-Inverter Air Conditioner is a high-wall duct-free system without comparative or others. Convenience stages can be easily handled. This AC works on the perfect of varying air compressor rates. You can easily use this AC for Cooling in the Summer Season &amp; Heating in the Winter Season. This AC is also featured with multi-fan speeds, Up/Down Swing Flaps, Air Flow Direction Control, Anti Cool Wind, Low Voltage Startup, and Comfortable Sleeping Mode. This Air Conditioner can be controlled remotely via Smart Phone. The Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A1) offers a 01-year Service Warranty. <span style=\"background-color: yellow;\">(Xiaomi Warranty Card must be kept for warranty claims.)</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"1 Ton"},{"key":"Energy Saving Rating","value":"3.23"},{"key":"Capacity of Cooling (BTU)","value":"12,000 BTU"},{"key":"Airflow","value":"660 m3/hr."},{"key":"Refrigerant Type","value":"R22"},{"key":"Others","value":"Cooling Mode"}]},{"heading":"Power","values":[{"key":"Power Type","value":"AC"},{"key":"Power Voltage","value":"230V/ 50Hz"},{"key":"Power Consumption","value":"850 Watts"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor unit : 9.2 x 13.6 x 41.3 in"},{"key":"Weight","value":"Indoor Unit : 15 kg"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01-year Service Warranty."}]}],"latest_price":{"heading":"What is the price of Xiaomi 1 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of Xiaomi 1 Ton Non-Inverter AC in Bangladesh is 34,500৳. You can buy the Xiaomi 1 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/xiaomi/viomi-a1/xiaomi-viomi-a1-500x500.jpg"],"product_seo_title":"Xiaomi 1 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Xiaomi 1 Ton Non-Inverter AC at best price in Bangladesh. Latest Xiaomi 1 Ton Non-Inverter Air Conditioner (Viomi A1) at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Xiaomi 1 Ton Non-Inverter AC (Split Type Viomi A1)"},{"url":"https://www.startech.com.bd/xiaomi-1-5-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/xiaomi/viomi-a1/xiaomi-viomi-a1-228x228.jpg","title":"Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A1)","product_list_short_description":["Type: Split Non-Inverter Smart AC","AC Capacity: 1.5 TON","Comfortable Sleeping Mode","Smart Energy-saving operation"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Xiaomi AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Xiaomi AC at best price in Bangladesh. Latest Xiaomi Viomi Inverter & non-inverter AC available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"XIAOMI AC, Smart AC, Smart Air Conditioner, XIAOMI Inverter Air Conditioner, XIAOMI","status":"Up Coming","code":"22032","brand":"XIAOMI","product_page_short_description":["Model: Viomi A1","Type: Split Non-Inverter Smart AC","AC Capacity: 1.5 TON","Comfortable Sleeping Mode","Smart Energy-saving operation"],"emi_price":0,"full_description":"<h2>Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A1)</h2><p style=\"\">The Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A1) is a smart AC from Xiaomi. The Xiaomi Viomi A1 air conditioner has been developed in collaboration with Dyson experts to create the most comfortable cool and warm airflow. It comes with Cold plasma technology, which is a unique technology that deters odors, and for clear air delivery systems. Plasma is a substance that is generated by lightning at room temperature. The Air Conditioner features with Smart Energy-saving operation, 18000 BTU, Cold Air Prevention, Auto Clean Function, Adjustable airflow volume, Up/down swing flaps LED Display, Super quiet and Humanized sleep function. In this AC, the Intelligent Defrost technology helps to reduce energy loss and defrost time by only defrosting when needed instead of by a set timer. The Air Conditioner features with Smart Energy-saving operation, 18000 BTU, Cold Air Prevention, Auto Clean Function, Adjustable airflow volume, Up/down swing flaps LED Display, Super quiet and Humanized sleep function. In this AC, the Intelligent Defrost technology helps to reduce energy loss and defrost time by only defrosting when needed instead of by a set timer. This Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A1) is a high-wall duct-free system without comparative or others. Convenience stages can be easily handled. This AC works on the perfect of varying air compressor rates. You can easily use this AC for Cooling in the Summer Season &amp; Heating in the Winter Season. This AC is also featured with multi-fan speeds, Up/Down Swing Flaps, Air Flow Direction Control, Anti Cool Wind, Low Voltage Startup, and Comfortable Sleeping Mode. This Air Conditioner can be controlled remotely via Smart Phone. the Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A1) offers a 01-year Service Warranty. <span style=\"background-color: yellow;\">(<span style=\"font-weight: bold;\">Xiaomi Warranty Card must be kept for warranty claims.)</span></span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"1.5 Ton"},{"key":"Capacity of Cooling (BTU)","value":"18000 BTU"},{"key":"Airflow","value":"Adjustable"}]},{"heading":"Power","values":[{"key":"Power Type","value":"AC"},{"key":"Power Consumption","value":"60% Electricity saving"}]},{"heading":"Physical Specification","values":[{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01-year Service Warranty"}]}],"latest_price":{"heading":"What is the price of Xiaomi 1.5 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of Xiaomi 1.5 Ton Non-Inverter AC in Bangladesh is 45,000৳. You can buy the Xiaomi 1.5 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/xiaomi/viomi-a1/xiaomi-viomi-a1-500x500.jpg"],"product_seo_title":"Xiaomi 1.5 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Xiaomi 1.5 Ton Non-Inverter AC at best price in Bangladesh. Latest Xiaomi 1.5 Ton Non-Inverter Air Conditioner (Viomi A1) at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Xiaomi 1.5 Ton Non-Inverter AC (Split Type Viomi A1)"}]