[{"url":"https://www.startech.com.bd/redragon-gc-f009-rgb-casing-cooler-fan-with-remote","img":"https://www.startech.com.bd/image/cache/catalog/Casing%20Cooler/Redragon/gc%20f009/redragon-gc-f009-rgb-3in1-case-cooler-with-remote-228x228.jpg","title":"Redragon GC-F009 RGB Casing Cooler Fan Triple Pack with Remote","product_list_short_description":["Hi-Speed powerful fan","Customizable Colors with many choices","Control Connector and remote","Easy installation"],"price_new":0,"price_old":0,"price_single":2450,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Redragon Casing Cooler Price in Bangladesh | Star Tech","cat_seo_description":"Buy Redragon Casing Cooler at a competitive price in Bangladesh. Latest Redragon Casing Cooler available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Redragon Casing Cooler ","status":"In Stock","code":"19135","brand":"Redragon","product_page_short_description":["Model: GC-F009","Hi-Speed powerful fan","Customizable Colors with many choices","Control Connector and remote","Easy installation"],"emi_price":248,"full_description":"<h2 style=\"text-align: justify;\">Redragon GC-F009 RGB Casing Cooler Fan Triple Pack with Remote</h2><p style=\"text-align: justify;\">REDRAGON GC-F009 RGB case cooling fan with remote is an excellent choice for any gaming setup. The casing cooler is designed for powerful water and air cooled systems and gaming setups. The Redragon GC-F009 120mm PWM High-Speed Fan is very quiet. The reason behind this is, it uses funnel-shaped inlets to deliver efficient air circulation and high air pressure. It uses seven airflow- and surface-optimized fan blades. The maximum fan speed of any fan is up to 1200 rpm. It is good enough to bring quiet cooling to your rig. It utilizes a PWM or Pulse-Width Modulation connector. In an PWM connector port all compatible 1 x 6 PIN controllers can intelligently affect the speed of the fan and they can do this very quietly product generates only 23.2d dBA of noise, even when the cooler is operating at maximum speed it has the lowest sound possible. <br></p><h3 style=\"text-align: justify;\">Design</h3><p style=\"text-align: justify;\">REDRAGON GC-F009 RGB Casing cooling fan has a The casing cooler is designed for powerful water and air cooled systems and gaming setups. 120mm PWM High-Speed Fan is very quiet. The reason behind this is, it uses funnel-shaped inlets to deliver efficient air circulation and high air pressure. It uses seven airflow- and surface-optimized fan blades. The cooler has 9 vanes.The maximum fan speed for a single cooler fan is upto 1200 rpm. The speed can vary around 10%. These cooler has a highest of&nbsp; sound to noise Ratio of around 23.2dBA with an Air flow of 36 Cubic Flow per Meter. the distortion rate is around 10%. This cooler fan comes with a pack of three fans and a full functioning remote control. You can use the remote to control both the RGB light and the fan<br></p><h3 style=\"text-align: justify;\">Packaging and warranty</h3><p style=\"text-align: justify;\">The whole package comes with a includes 3 RGB full color Fans&nbsp; and 6 in 1 controller box. Apart from that it also has 1 remote controller in a single color package.The connector cable has a 1 x 6 PIN operating at 12V. The cooler's dimensions are 130 x 80 x 250&nbsp; mm. It has 01 year of warranty.<br></p>","specifications":[{"heading":"Key Features","values":[{"key":"Fan Speed","value":"1200RPM±10%"},{"key":"Air Flow","value":"36 CFM ± 10%"},{"key":"Noise (dBA)","value":"23.2"}]},{"heading":"Physical Specification","values":[{"key":"Color","value":"Multicolor"},{"key":"Materials","value":"Plastic"},{"key":"Size","value":"120mm to 140mm"},{"key":"Weight","value":"App 0.160 kg"},{"key":"Connector","value":"PWM"}]},{"heading":"Warranty Information","values":[{"key":"Manufacturing Warranty","value":"01 years"}]}],"latest_price":{"heading":"What is the price of REDRAGON GC-F009 RGB Casing cooler with remote in Bangladesh?","paragraph":"The latest price of REDRAGON GC-F009 RGB Casing cooler with remote in Bangladesh is 2,450৳. You can buy the REDRAGON GC-F009 RGB Casing cooler with remote at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/Casing%20Cooler/Redragon/gc%20f009/redragon-gc-f009-rgb-3in1-case-cooler-with-remote-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/Casing%20Cooler/Redragon/gc%20f009/redragon-gc-f009-rgb-3in1-case-cooler-with-remote-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/Casing%20Cooler/Redragon/gc%20f009/redragon-gc-f009-rgb-3in1-case-cooler-with-remote-02-500x500.jpg"],"product_seo_title":"Redragon gc f009 rgb casing cooler fan Price in Bangladesh","product_seo_description":"Buy Redragon gc f009 rgb casing cooler 3 pack at best price in Bangladesh. Latest REDRAGON casing cooler available at Star Tech. Order online to get delivery in BD","product_seo_keywords":""}]