[{"url":"https://www.startech.com.bd/kospet-tank-t2-smartwatch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-t2/tank-t2-black-02-228x228.webp","title":"KOSPET TANK T2 MIL-STD Rugged Waterproof Smartwatch","product_list_short_description":["1.43\" AMOLED Display","HIFI Bluetooth Calls with One Switch","U.S. MIL-STD-Certified","5ATM & IP69K Waterproof"],"price_new":6290,"price_old":6499,"price_single":6290,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"KOSPET Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy KOSPET Smart Watch at best price in Bangladesh. Latest KOSPET Waterproof Rugged, Call support Smartwatch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"KOSPET Smart Watch","status":"In Stock","code":"29291","brand":"KOSPET","product_page_short_description":["Model: TANK T2","1.43\" AMOLED Display","HIFI Bluetooth Calls with One Switch","U.S. MIL-STD-Certified","5ATM & IP69K Waterproof"],"emi_price":596,"full_description":"<h2 style=\"\">KOSPET TANK T2 MIL-STD Rugged Waterproof Smartwatch</h2><p style=\"\">The KOSPET TANK T2 is a MIL-STD Rugged Smartwatch ready for adventure. It is an innovative smartwatch that features a 1.43\" AMOLED Full Touch screen display. It is equipped with an RTL8763EW CPU and 128M ROM. The smartwatch features Bluetooth 5.0 connectivity and it is compatible with Android 5.1 &amp; IOS 10.0 and above. A 410mAh Pure Cobalt Battery powers the KOSPET TANK T2 and it can offer a long battery life.</p><h3 style=\"\">Embrace Brilliance on AMOLED &amp; Retina Display</h3><p style=\"\">TANK T2 features an AMOLED screen that shows every detail clearly, even in intense outdoor lighting. The self-luminescent materials ensure optimal visibility. Additionally, the always-on time display, made possible by the energy-efficient AMOLED technology, allows you to stay informed at all times.<br></p><h3>Bluetooth Calling with HIFI Audio Quality</h3><p>TANK T2 utilizes the latest RealTek single-chip processor 8763EW with dual-mode Bluetooth. Connect the app to make phone calls and play music from your wrist. With a built-in audio decoding chip, it delivers impressive sound quality, from deep bass to clear medium pitch.<br></p><h3 style=\"\">24/7 Heart Rate Monitor &amp; Blood Oxygen Measurement</h3><p style=\"\">The KOSPET TANK T2 Smartwatch is equipped with a cutting-edge BioTracker tracking optical sensor and it supports automatic detection for both static and dynamic heart rates day and night. It can also monitor your blood saturation on-demand during workouts to guard you against any injury contributed by excessive exercise.</p><h3 style=\"\">5ATM &amp; IP69K Waterproof</h3><p style=\"\">The KOSPET TANK T2 Smartwatch comes with a 5ATM &amp; IP69K water-resistant design. It can cover both water and underwater sports daily. The watch can be exposed to pressurized or high-velocity water, such as when showering, surfing, swimming, diving, etc.</p><h3 style=\"\">Passed through 12 MIL-STD Military Tests</h3><p style=\"\">The TANK T2 has nailed up to a dozen MIL-STD Military Tests. This rugged smartwatch can withstand any harsh condition and it can work even under extreme-temp ( -40℃ ~ 70℃ ). Plus it also has 70 Sports Modes with Smart Recognition for you. It is a perfect adventure companion.</p><h3 style=\"\">Ultra-long Battery Life</h3><p style=\"\">The KOSPET TANK T2 is powered by a 410mAh pure cobalt battery with high capacity and voltage. It adopts a double-mode, single-chip processor to minimize power consumption. Enabled by our extraordinary software algorithms, the smartwatch ensures long-lasting battery life, 65-day standby time and 25 days for daily usage.</p><h2 style=\"\">Buy KOSPET TANK T2 MIL-STD Rugged Waterproof Smartwatch from Star Tech</h2><p style=\"\">In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/kospet-tank-t2-smartwatch\" target=\"\">KOSPET TANK T2 MIL-STD Rugged Waterproof Smartwatch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/kospet-smart-watch\" target=\"\">KOSPET Smartwatch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The KOSPET TANK T2 MIL-STD Rugged Waterproof Smartwatch comes with 2 year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"RTL8763EW, Single-chip with Dual-mode BT"},{"key":"Display","value":"1.43\", AMOLED, 466*466"},{"key":"Memory","value":"128M"},{"key":"Battery","value":"410mAh Pure Cobalt Battery"},{"key":"Connectivity","value":"Bluetooth 5.0 + BLE"},{"key":"Material","value":"Case Material: Metal+ABS+PC"},{"key":"OS","value":"Android 5.1 & iOS 10.0 and Above"},{"key":"SpecialFeatures","value":"Waterproof: 5 ATM & IP69K"},{"key":"Supported Apps/ Software","value":"KOSPET FIT"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"2 Year"}]}],"latest_price":{"heading":"What is the price of KOSPET TANK T2 Rugged Waterproof Smartwatch in Bangladesh?","paragraph":"The latest price of KOSPET TANK T2 Rugged Waterproof Smartwatch in Bangladesh is 6,290৳. You can buy the KOSPET TANK T2 Rugged Waterproof Smartwatch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-t2/tank-t2-black-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-t2/tank-t2-silver-02-500x500.webp"],"product_seo_title":"KOSPET TANK T2 MIL-STD Rugged Waterproof Smartwatch Price in Bangladesh","product_seo_description":"Buy KOSPET TANK T2 Rugged Waterproof Smartwatch at best price in Bangladesh. Latest KOSPET TANK T2 Smartwatch available at Star Tech Shop. Order online for delivery in BD.","product_seo_keywords":"KOSPET TANK T2 MIL-STD Rugged Waterproof Smartwatch"},{"url":"https://www.startech.com.bd/kospet-tank-m3-ultra-rugged-smartwatch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-m3-ultra-rugged/tank-m3-ultra-rugged-02-228x228.webp","title":"Kospet Tank M3 Ultra Rugged Waterproof Bluetooth Calling Smartwatch","product_list_short_description":["1.96” AMOLED Display","Full-metal Unibody & Corning Gorilla Glass Screen","5 ATM & IP69K (Dive-proof) Water-resistance","15 MIL-STD-810H Certifications & 28 Reliable Internal Tests"],"price_new":0,"price_old":0,"price_single":9499,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"KOSPET Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy KOSPET Smart Watch at best price in Bangladesh. Latest KOSPET Waterproof Rugged, Call support Smartwatch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"KOSPET Smart Watch","status":"In Stock","code":"35660","brand":"KOSPET","product_page_short_description":["Model: Tank M3 Ultra","1.96” AMOLED Display","Full-metal Unibody & Corning Gorilla Glass Screen","5 ATM & IP69K (Dive-proof) Water-resistance","15 MIL-STD-810H Certifications & 28 Reliable Internal Tests"],"emi_price":871,"full_description":"<h2>Kospet Tank M3 Ultra Rugged Waterproof Bluetooth Calling Smartwatch</h2><p>The Kospet <strong>Tank M3 Ultra</strong> is a feature-packed smartwatch that focuses on both strong durability and seamless performance. This majestic smartwatch features with 1.96” AMOLED screen with a sturdy stainless steel unibody and Corning Gorilla Glass 3 protects the screen from scratches. The Smartwatch  Kospet Tank M3&nbsp;Ultra is built with an ATS3085L chip and memory of 256M NOR. Whether you are trekking hills, or navigating city streets, the Kospet Tank M3&nbsp;Ultra is dedicated to offering a smooth, responsive user experience. Kospet Tank M3&nbsp;Ultra The smartwatch has 480 mAh which provides huge battery life In performance. VP60 bio-tracking sensor helps you find the highly accurate heart rate, blood oxygen, and stress levels. Moreover, when you are sleeping, the smartwatch monitors your sleep quality too. The <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">smartwatch</a> gives you GPS accuracy as it picks up both L1 and  L5 signals. </p><h3>1.96” AMOLED Display </h3>The Kospet Tank M3 Ultra&nbsp;is featured with a majestic 1.96” AMOLED display which can produce 331 ppi or 410 × 502 pixels resolution. The resolution gives you an immersive viewing experience that is full of clarity and vividness. The smartwatch ensures excellent visibility in bright sunlight.<h3>The Sturdy Structure of Kospet Tank M3 Ultra</h3><p>The combination of stainless steel unibody, Corning Gorilla Glass 3, and proof Polyamide has given the smartwatch a robust structure. The steel unibody brings strength. The Corning Gorilla Glass 3 has made the smartwatch released from scratch. The strong combination of the Kospet <strong>Tank M3 Ultra</strong> has brought great adaptability to every situation.</p><h3>5 ATM &amp; IP69K (Dive-proof) Water-resistance</h3>  <p>There is no worry for you if you use the Kospet tank M3 Ultra on a rainy day. The smartwatch is 5 ATM and IP69 water-resistant. So, you can dive into the swimming pool without any hesitation. The smartwatch can withstand pressure up to 50 meters under the water.</p><h3>15 MIL-STD-810H Certifications &amp; 28 Reliable Internal Tests</h3><p>Kospet Tank M3 Ultra&nbsp;is 15MIL-STD_810H certified. The certification is developed by the U. S.  Department of Defense, The testing examines the equipment’s resistance to the environmental conditions the equipment may face throughout its lifetime. The certification ensures the durability and reliability that lead to longevity and increase the sustainability of the equipment. Kospet Tank M3 Ultra&nbsp;will provide longevous and sustainable support.</p><h3>Dual-band GPS &amp; 6 Satellite Positioning Systems </h3><p>The Kospet Tank M3 Ultra&nbsp;uses both L1 and L5 positioning, which helps provide broad coverage and penetrating obstacles with higher accuracy and reliability in terms of accurate tracking. So, you will get more precise location information during outdoor activities like hiking, running, or cycling. The smartwatch supports six different satellite positioning systems, including GPS, Galileo, GLONASS, BeiDou, QZSS, and NAVIC (IRNSS), which help to cope with complex environments.</p><h2>Buy Kospet Tank M3 from Star Tech</h2><p>In Bangladesh, you can get the original <strong>Kospet Tank M3 Ultra rugged Bluetooth Smartwatch</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/kospet-smart-watch\" target=\"\">Kospet Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at the lowest price. The Kospet Tank M3 Ultra rugged Bluetooth Smartwatch comes with 02-years warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"ATS3085L"},{"key":"Display","value":"1.96\", AMOLED, 410 × 502"},{"key":"Memory","value":"256M NOR"},{"key":"Battery","value":"Battery Type: Li-ion battery"},{"key":"Connectivity","value":"Bluetooth"},{"key":"Material","value":"Bezel Material: Stainless steel"},{"key":"OS","value":"Android 5.1 and above, iOS 10.0 and above"},{"key":"SpecialFeatures","value":"Waterproof: 5 ATM & IP69K"},{"key":"Sensor","value":"VC9202 + VP60A2 sensors"},{"key":"Supported Apps/ Software","value":"KOSPET FIT"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"56 × 43 ×12.8mm"},{"key":"Weight","value":"75.4g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"02-years Warranty"}]}],"latest_price":{"heading":"What is the price of Kospet Tank M3 Ultra Rugged Smartwatch in Bangladesh?","paragraph":"The latest price of Kospet Tank M3 Ultra Rugged Smartwatch in Bangladesh is 9,499৳. You can buy the Kospet Tank M3 Ultra Rugged Smartwatch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-m3-ultra-rugged/tank-m3-ultra-rugged-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-m3-ultra-rugged/tank-m3-ultra-rugged-01-500x500.webp"],"product_seo_title":"Kospet Tank M3 Ultra Smartwatch Price in Bangladesh | Star Tech","product_seo_description":"Buy Kospet Tank M3 Ultra Smartwatch at best price in Bangladesh. Order latest Kospet Tank M3 Ultra Rugged Bluetooth Calling Smartwatch from Star Tech Online shop in BD.","product_seo_keywords":"Kospet Tank M3 Ultra Rugged Waterproof Bluetooth Calling Smartwatch"},{"url":"https://www.startech.com.bd/kospet-tank-m3-rugged-smartwatch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-m3-rugged/tank-m3-01-228x228.webp","title":"Kospet Tank M3 Rugged Bluetooth Calling Smartwatch","product_list_short_description":["1.96” AMOLED, 410*502 Display","Full-metal Bezel & Corning Gorilla Glass Screen","5 ATM & IP69K (Dive-proof) Water-resistance","15 MIL-STD-810H Certifications & 28 Reliable Internal Tests"],"price_new":6990,"price_old":7999,"price_single":6990,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"KOSPET Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy KOSPET Smart Watch at best price in Bangladesh. Latest KOSPET Waterproof Rugged, Call support Smartwatch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"KOSPET Smart Watch","status":"In Stock","code":"35745","brand":"KOSPET","product_page_short_description":["Model: Tank M3 Rugged","1.96” AMOLED, 410*502 Display","Full-metal Bezel & Corning Gorilla Glass Screen","5 ATM & IP69K (Dive-proof) Water-resistance","15 MIL-STD-810H Certifications & 28 Reliable Internal Tests"],"emi_price":733,"full_description":"<h2>Kospet Tank M3 Rugged Bluetooth Calling Smartwatch</h2><p>The Kospet <strong>Tank M3 Rugged</strong> Bluetooth Calling Smartwatch stands out as a tough and multifunctional wearable built to handle the demands of an active lifestyle. Its 1.96\" AMOLED display, with a high resolution of 410*502, produces rich colors and fine details, allowing for great sight even in broad sunshine. Encased in a full-metal bezel and covered by Corning Gorilla Glass, the screen is scratch-resistant and resilient against regular wear and tear, ensuring long-term dependability. The Tank M3 is designed to withstand severe situations, with an excellent water resistance rating of 5 ATM and IP69K, making it not only dive-proof, but also resistant to high-pressure water jets and dust intrusion. This level of protection provides peace of mind when participating in water-based activities and outdoor experiences. Furthermore, the wristwatch has been carefully tested and certified to fulfill 15 MIL-STD-810H criteria, ensuring its resistance against drops, shocks, high temperatures, and more.</p><h3>1.96” AMOLED Display </h3><p>The Kospet Tank M3 Rugged has a 1.96\" AMOLED display with a resolution of 331 pixels per inch (410 × 502). The resolution provides an immersive viewing experience that is both clear and colorful. The smartwatch provides exceptional visibility in strong sunlight.</p><h3>The Sturdy Structure</h3><p>The Tank M3 Rugged smartwatch's construction is sturdy because to the combination of a stainless steel unibody, Corning Gorilla Glass 3, and proof Polyamide. The steel unibody provides strength. The smartwatch was created from scratch using Corning Gorilla Glass 3. The Kospet <strong>Tank M3 Rugged</strong> offers exceptional flexibility to any environment.</p><h3>5 ATM &amp; IP69K (Dive-proof) Water-resistance</h3><p>If you utilize the Kospet tank M3 Rugged on a wet day, you have nothing to worry about. The smartwatch can withstand 5 ATM of water and has an IP69 rating. So you may confidently dive into the swimming pool. The wristwatch can resist pressures up to 50 meters underwater.</p><h3>15 MIL-STD-810H Certifications &amp; 28 Reliable Internal Tests</h3><p>The Kospet <strong>Tank M3 Rugged</strong> is 15MIL-STD-810H approved. The certification is established by the United States Department of Defense. The testing assesses the equipment's resilience to the environmental conditions that it may encounter over its lifespan. The certification confirms the equipment's durability and dependability, which leads to longer life and greater sustainability. Kospet Tank M3 Rugged will offer long-term and sustainable assistance.</p><h2>Buy Kospet Tank M3 Rugged Bluetooth Calling Smartwatch from Star Tech</h2><p>In Bangladesh, you can get the original <strong>Kospet Tank M3 Rugged Bluetooth Calling Smartwatch</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/kospet-smart-watch\" target=\"\">Kospet Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at the lowest price. The Kospet Tank M3 Rugged Bluetooth Calling Smartwatch comes with 02-years warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"ATS3085L"},{"key":"Display","value":"1.96\", AMOLED, 410 × 502"},{"key":"Memory","value":"256M NOR"},{"key":"Battery","value":"Battery Type: Li-ion battery"},{"key":"Connectivity","value":"Bluetooth 5.3"},{"key":"Material","value":"Full Metal Bezel"},{"key":"OS","value":"Android 5.1 and above, iOS 10.0 and above"},{"key":"SpecialFeatures","value":"Waterproof: 5 ATM & IP69K"},{"key":"Sensor","value":"G-Sensor: STK8325 3-axis acceleration sensor"},{"key":"Supported Apps/ Software","value":"KOSPET FIT"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"56 × 43 ×12.8mm"},{"key":"Weight","value":"75g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"02-years Warranty"}]}],"latest_price":{"heading":"What is the price of Kospet Tank M3 Rugged Bluetooth Calling Smartwatch in Bangladesh?","paragraph":"The latest price of Kospet Tank M3 Rugged Bluetooth Calling Smartwatch in Bangladesh is 6,990৳. You can buy the Kospet Tank M3 Rugged Bluetooth Calling Smartwatch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-m3-rugged/tank-m3-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-m3-rugged/tank-m3-02-500x500.webp"],"product_seo_title":"Kospet Tank M3 Rugged Smartwatch Price in Bangladesh | Star Tech","product_seo_description":"Buy Kospet Tank M3 Rugged Smartwatch at best price in Bangladesh. Latest Kospet Tank M3 Rugged Bluetooth Calling Smartwatch available at Star Tech Online shop in BD.","product_seo_keywords":"Kospet Tank M3 Rugged Bluetooth Calling Smartwatch"},{"url":"https://www.startech.com.bd/kospet-tank-t3-rugged-smartwatch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-t3-rugged/tank-t3-rugged-01-228x228.webp","title":"Kospet Tank T3 Rugged Bluetooth Calling Smartwatch","product_list_short_description":["1.43” AMOLED, 466*466 Display","Full-metal Bezel & Corning Gorilla Glass Screen","5 ATM & IP69K (Dive-proof) Water-resistance","15 MIL-STD-810H Certifications & 28 Reliable Internal Tests"],"price_new":0,"price_old":0,"price_single":7999,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"KOSPET Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy KOSPET Smart Watch at best price in Bangladesh. Latest KOSPET Waterproof Rugged, Call support Smartwatch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"KOSPET Smart Watch","status":"In Stock","code":"35747","brand":"KOSPET","product_page_short_description":["MPN: 110610","Model: Tank T3 Rugged","1.43” AMOLED, 466*466 Display","Full-metal Bezel & Corning Gorilla Glass Screen","5 ATM & IP69K (Dive-proof) Water-resistance","15 MIL-STD-810H Certifications & 28 Reliable Internal Tests"],"emi_price":733,"full_description":"<h2>Kospet Tank T3 Rugged Bluetooth Calling Smartwatch</h2><p>The Kospet <strong>Tank T3 Rugged</strong> Bluetooth Calling Smartwatch is a durable and feature-rich wearable that can handle the demands of an active lifestyle. This wristwatch features a brilliant 1.43\" AMOLED display with a resolution of 466*466, providing sharp images and simple navigation. The screen, encased in a full-metal bezel and covered by Corning Gorilla Glass, is scratch-resistant and long-lasting, assuring reliability in challenging conditions. With a water resistance rating of 5 ATM and an IP69K classification, the Tank T3 is dive-proof and can endure high-pressure water jets, making it ideal for swimming, snorkeling, and other water-related sports. It boasts 15 MIL-STD-810H certifications and has completed 28 trustworthy internal tests to ensure endurance against shocks, drops, severe temperatures, and more. The Kospet Tank T3 has easy Bluetooth calling features, letting users to make and receive calls directly from their wrist without the need for a smartphone. This function improves connectivity and accessibility, particularly for outdoor activities or when hands-free communication is required. Whether you're enjoying the outdoors or navigating urban surroundings, the Tank T3 Smartwatch is a reliable companion, combining durability, practicality, and style in a single robust compact. </p><h3>1.43” AMOLED Display </h3><p>The Kospet Tank T3 Rugged features a 1.43\" AMOLED display with a resolution of 466 x 466 pixels. The resolution delivers an immersive viewing experience that is both crisp and vibrant. The <strong>Tank T3 Rugged</strong> smartwatch has excellent visibility in bright sunshine.</p><h3>The Sturdy Structure</h3><p>The Tank T3 Rugged smartwatch's structure is strong due to the use of a stainless steel unibody, Corning Gorilla Glass 3, and proof Polyamide. The steel unibody offers strength. The smartwatch was built entirely from Corning Gorilla Glass 3. The Kospet Tank T3 Rugged provides remarkable adaptability in any setting.</p><h3>5 ATM &amp; IP69K (Dive-proof) Water-resistance</h3><p>If you use the Kospet <strong>tank T3 Rugged</strong> on a wet day, you won't have to worry. The smartwatch is water-resistant up to 5 ATM and has an IP69 rating. So you may comfortably dive into the swimming pool. The wristwatch can withstand pressures of up to 50 meters underwater.</p><h3>15 MIL-STD-810H Certifications &amp; 28 Reliable Internal Tests</h3><p>The Kospet <strong>Tank T3 Rugged</strong> is 15MIL-STD-810H approved. The certification is established by the United States Department of Defense. The testing assesses the equipment's resilience to the environmental conditions that it may encounter over its lifespan. The certification confirms the equipment's durability and dependability, which leads to longer life and greater sustainability. Kospet Tank T3 Rugged will offer long-term and sustainable assistance.</p><h2>Buy Kospet Tank T3 Rugged Bluetooth Calling Smartwatch from Star Tech</h2><p>In Bangladesh, you can get the original <strong>Kospet Tank T3 Rugged Bluetooth Calling Smartwatch</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/kospet-smart-watch\" target=\"\">Kospet Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at the lowest price. The Kospet Tank T3 Rugged Bluetooth Calling Smartwatch comes with 02-years warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"ATS3085L"},{"key":"Display","value":"1.43\" AMOLED, 466x466 pixel"},{"key":"Memory","value":"256M NOR"},{"key":"Battery","value":"Battery Life: 50 days (standby), 10-15 days (daily use), 2-3 days (always-on display)"},{"key":"Connectivity","value":"Bluetooth 5.3"},{"key":"Material","value":"Full Metal Bezel"},{"key":"OS","value":"Android 5.1 & iOS 11.0 and above"},{"key":"SpecialFeatures","value":"Waterproof: 5 ATM & IP69K"},{"key":"Sensor","value":"G-Sensor: STK8325 3-axis acceleration sensor"},{"key":"Supported Apps/ Software","value":"KOSPET FIT"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"49.5 × 54.5×14.4mm"},{"key":"Weight","value":"75g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"02-years Warranty"}]}],"latest_price":{"heading":"What is the price of Kospet Tank T3 Rugged Bluetooth Calling Smartwatch in Bangladesh?","paragraph":"The latest price of Kospet Tank T3 Rugged Bluetooth Calling Smartwatch in Bangladesh is 7,999৳. You can buy the Kospet Tank T3 Rugged Bluetooth Calling Smartwatch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-t3-rugged/tank-t3-rugged-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-t3-rugged/tank-t3-rugged-02-500x500.webp"],"product_seo_title":"Kospet Tank T3 Rugged Smartwatch Price in Bangladesh | Star Tech","product_seo_description":"Buy Kospet Tank T3 Rugged Smartwatch at best price in Bangladesh. Latest Kospet Tank T3 Rugged Bluetooth Calling Smartwatch available at Star Tech Online shop in BD.","product_seo_keywords":"Kospet Tank T3 Rugged Bluetooth Calling Smartwatch"},{"url":"https://www.startech.com.bd/kospet-tank-t2-special-edition-smartwatch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-t2-special-edition/tank-t2-special-edition-01-228x228.webp","title":"KOSPET TANK T2 Special Edition Bluetooth Calling Smartwatch","product_list_short_description":["1.43\" AMOLED Display","HIFI Bluetooth Calls with One Switch","U.S. MIL-STD-Certified","5ATM & IP69K Waterproof"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"KOSPET Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy KOSPET Smart Watch at best price in Bangladesh. Latest KOSPET Waterproof Rugged, Call support Smartwatch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"KOSPET Smart Watch","status":"Out Of Stock","code":"32207","brand":"KOSPET","product_page_short_description":["Model: TANK T2 Special Edition","1.43\" AMOLED Display","HIFI Bluetooth Calls with One Switch","U.S. MIL-STD-Certified","5ATM & IP69K Waterproof"],"emi_price":0,"full_description":"<h2 style=\"\">KOSPET TANK T2 Special Edition Bluetooth Calling Smartwatch</h2><p>The MIL-STD Rugged Smartwatch KOSPET <strong>TANK T2 Special Edition</strong> <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">smart watch</a> is ready for adventure. It is a cutting-edge smartwatch with a 1.43\" AMOLED Full Touch screen display. It features an RTL8763EW CPU and 128M ROM. The smartwatch has Bluetooth 5.0 connection and is compatible with Android 5.1 and above. The KOSPET TANK T2 is powered by a 410mAh Pure Cobalt Battery, which has a long battery life.</p><img src=\"https://www.startech.com.bd/image/catalog/smart-watch/kospet/tank-t2-special-edition/tank-t2-special-edition.jpg\" alt=\"KOSPET TANK T2 Special Edition Bluetooth Calling Smartwatch\" width=\"920\" height=\"450\"><h3 style=\"\">Embrace Brilliance on AMOLED &amp; Retina Display</h3><p>The <strong>TANK T2 Special Edition</strong> has an AMOLED screen that vividly displays every detail, especially in bright outdoor illumination. The self-luminescent materials provide excellent visibility. Furthermore, the always-on time display enabled by the energy-efficient AMOLED technology keeps you informed at all times.</p><h3>Bluetooth Calling with HIFI Audio Quality</h3><p>TANK T2 Special Edition utilizes the latest RealTek single-chip processor 8763EW with dual-mode Bluetooth. Connect the app to make phone calls and play music from your wrist. With a built-in audio decoding chip, it delivers impressive sound quality, from deep bass to clear medium pitch.<br></p><img src=\"https://www.startech.com.bd/image/catalog/smart-watch/kospet/tank-t2-special-edition/tank-t2-special-edition-001.jpg\" alt=\"KOSPET TANK T2 Special Edition Bluetooth Calling Smartwatch\" width=\"920\" height=\"450\"><h3 style=\"\">24/7 Heart Rate Monitor &amp; Blood Oxygen Measurement</h3><p style=\"\">The KOSPET <strong>TANK T2 Special Edition</strong> Smartwatch is equipped with a cutting-edge BioTracker tracking optical sensor and it supports automatic detection for both static and dynamic heart rates day and night. It can also monitor your blood saturation on-demand during workouts to guard you against any injury contributed by excessive exercise.</p><h3 style=\"\">5ATM &amp; IP69K Waterproof</h3><p>The KOSPET TANK T2 Special Edition Smartwatch is water-resistant to 5ATM and IP69K standards. It may cover aquatic and underwater activities on a daily basis. The watch can be exposed to high-velocity or pressured water, such as while bathing, surfing, swimming, or diving.</p><h3 style=\"\">Passed through 12 MIL-STD Military Tests</h3><p style=\"\">The TANK T2 Special Edition has nailed up to a dozen MIL-STD Military Tests. This rugged smartwatch can withstand any harsh condition and it can work even under extreme-temp ( -40℃ ~ 70℃ ). Plus it also has 70 Sports Modes with Smart Recognition for you. It is a perfect adventure companion.</p><h3 style=\"\">Ultra-long Battery Life</h3><p style=\"\">The KOSPET <strong>TANK T2 Special Edition</strong> is powered by a 410mAh pure cobalt battery with high capacity and voltage. It adopts a double-mode, single-chip processor to minimize power consumption. Enabled by our extraordinary software algorithms, the smartwatch ensures long-lasting battery life, 65-day standby time and 25 days for daily usage.</p><img src=\"https://www.startech.com.bd/image/catalog/smart-watch/kospet/tank-t2-special-edition/tank-t2-special-edition-002.jpg\" alt=\"KOSPET TANK T2 Special Edition Bluetooth Calling Smartwatch\" width=\"920\" height=\"450\"><h2 style=\"\">Buy KOSPET TANK T2 Special Edition Bluetooth Calling Smartwatch from Star Tech</h2><p style=\"\">In Bangladesh, you can get original <span style=\"font-weight: bold;\">KOSPET TANK T2 Special Edition Bluetooth Calling Smartwatch</span>&nbsp;From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/kospet-smart-watch\" target=\"\">KOSPET Smartwatch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The KOSPET TANK T2 Special Edition Bluetooth Calling Smartwatch comes with 2 year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"RTL8763EW, Single-chip with Dual-mode BT"},{"key":"Display","value":"1.43\", AMOLED, 466*466"},{"key":"Memory","value":"128M"},{"key":"Battery","value":"410mAh Pure Cobalt Battery"},{"key":"Connectivity","value":"Bluetooth 5.0 + BLE"},{"key":"Material","value":"Case Material: Metal+ABS+PC"},{"key":"OS","value":"Android 5.1 & iOS 10.0 and Above"},{"key":"SpecialFeatures","value":"Waterproof: 5 ATM & IP69K"},{"key":"Supported Apps/ Software","value":"KOSPET FIT"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"2 year"}]}],"latest_price":{"heading":"What is the price of KOSPET TANK T2 Special Edition Smartwatch in Bangladesh?","paragraph":"The latest price of KOSPET TANK T2 Special Edition Smartwatch in Bangladesh is 7,090৳. You can buy the KOSPET TANK T2 Special Edition Smartwatch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-t2-special-edition/tank-t2-special-edition-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/kospet/tank-t2-special-edition/tank-t2-special-edition-silver-500x500.webp"],"product_seo_title":"KOSPET TANK T2 Special Edition Smartwatch Price in Bangladesh","product_seo_description":"Buy KOSPET TANK T2 Special Edition Smartwatch at best price in Bangladesh. KOSPET TANK T2 Special Edition Calling Smartwatch available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"KOSPET TANK T2 Special Edition Bluetooth Calling Smartwatch"}]