[{"url":"https://www.startech.com.bd/yison-celebrat-pb-11-10000mah-power-bank","img":"https://www.startech.com.bd/image/cache/catalog/power-bank/yison/celebrat-pb-11-01-228x228.webp","title":"Yison Celebrat PB-11 10000mAh Portable Power Bank","product_list_short_description":["Battery Capacity: 10000mAh","Battery Type: Polymer Lithium Battery","Type-C/ Micro input power: 5V-2A","Dual USB output power: 5V-2A"],"price_new":0,"price_old":0,"price_single":1320,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Yison Power Bank Price in Bangladesh | Star Tech","cat_seo_description":"Buy Yison Power Bank at the best price in Bangladesh. Latest Yison Power Bank available at Star Tech Online Shop. Order Online and get delivery anywhere in BD.","cat_seo_keywords":"Yison Power Bank","status":"In Stock","code":"35705","brand":"Yison","product_page_short_description":["Model: Celebrat PB-11","Battery Capacity: 10000mAh","Battery Type: Polymer Lithium Battery","Type-C/ Micro input power: 5V-2A","Dual USB output power: 5V-2A"],"emi_price":121,"full_description":"<h2>Yison Celebrat PB-11 10000mAh Portable Power Bank</h2><p>The Yison <strong>Celebrat PB-11</strong> 10000mAh <a href=\"https://www.startech.com.bd/power-bank\" target=\"\" style=\"color: rgb(0, 0, 0);\">Power Bank</a> is a robust and adaptable charging option for your portable power needs. With a high-capacity 10000mAh lithium battery, the Celebrat PB-11 provides enough power to recharge your devices numerous times, making it an indispensable companion for travelers, commuters, and busy professionals. The Celebrat PB-11, made of high-quality ABS plastic, is not only strong but also lightweight and portable. Its sleek form makes it simple to slide into a purse or pocket, allowing you to take it with you wherever you go. The power bank's efficient design allows it to resist regular wear and tear, making it a dependable power source for your gadgets. The Celebrat PB-11 has a rated capacity of 5300mAh, which ensures constant and reliable power production. It has Type-C and Micro USB inputs that enable 5V-2A power, providing versatile charging choices. This adaptability allows you to recharge the power bank using a variety of cords, making it compatible with a wide range of devices. One of the Yison Celebrat PB-11's notable characteristics is its two USB output ports, which each provide 5V-2A power. This allows you to charge two devices at the same time, including your smartphone, tablet, and other USB-powered electronics. The dual output design is ideal for individuals who need to have several gadgets charged and ready to use all day. The Celebrat PB-11 was developed with safety and efficiency in mind. It uses complex circuitry to prevent overcharging, overheating, and short circuits, assuring the safety of both the power bank and your gadgets. The straightforward LED indication allows you to simply monitor the remaining battery level, letting you know when it's time to recharge. The Yison Celebrat PB-11 10000mAh Power Bank offers great capacity, durability, and adaptability in a small and elegant packaging. With its powerful battery, twin charging ports, and dependable performance, the PB-11 is the ideal accessory for keeping your devices charged and ready to go, no matter where your day takes you.</p><h2>Buy Yison Celebrat PB-11 10000mAh Portable Power Bank From Star Tech</h2><p>In Bangladesh, you can get original <span style=\"font-weight: bold;\">Yison Celebrat PB-11 10000mAh Portable Power Bank</span> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/yison-power-bank\" target=\"\">Yison Power Bank</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Yison Celebrat PB-11 10000mAh Portable Power Bank comes with no warranty.</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Capacity","value":"10000mAh"},{"key":"Input","value":"Type-C/ Micro input power: 5V-2A"},{"key":"Output","value":"Dual USB output power: 5V-2A"},{"key":"Interface","value":"2x USB-A"},{"key":"Button","value":"Yes"}]},{"heading":"Physical Specification","values":[{"key":"Color","value":"Black"},{"key":"Material","value":"ABS"}]},{"heading":"Manufacture Warranty","values":[{"key":"Warranty","value":"No"}]}],"latest_price":{"heading":"What is the price of Yison Celebrat PB-11 10000mAh Power Bank in Bangladesh?","paragraph":"The latest price of Yison Celebrat PB-11 10000mAh Power Bank in Bangladesh is 1,320৳. You can buy the Yison Celebrat PB-11 10000mAh Power Bank at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/power-bank/yison/celebrat-pb-11-01-500x500.webp"],"product_seo_title":"Yison Celebrat PB-11 10000mAh Portable Power Bank Price in Bangladesh","product_seo_description":"Buy Yison Celebrat PB-11 10000mAh Portable Power Bank at best price in Bangladesh. Latest Yison Celebrat PB-11 Power Bank available at Star Tech Online Shop in BD.","product_seo_keywords":"Yison Celebrat PB-11 10000mAh Portable Power Bank"},{"url":"https://www.startech.com.bd/yison-celebrat-pb-09-20000mah-power-bank","img":"https://www.startech.com.bd/image/cache/catalog/power-bank/yison/celebrat-pb-09/celebrat-pb-09-01-228x228.webp","title":"Yison Celebrat PB-09 20000mAh Power Bank","product_list_short_description":["Battery Capacity: 3.7V-20000mAh (74Wh)","Battery Type: Polymer Lithium Battery","Input: Type-C, 5V/2A, 5V/2A;","Output: USBA1/2 ,5V/2.1A, 5V/2A (Max)"],"price_new":0,"price_old":0,"price_single":3260,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Yison Power Bank Price in Bangladesh | Star Tech","cat_seo_description":"Buy Yison Power Bank at the best price in Bangladesh. Latest Yison Power Bank available at Star Tech Online Shop. Order Online and get delivery anywhere in BD.","cat_seo_keywords":"Yison Power Bank","status":"In Stock","code":"35707","brand":"Yison","product_page_short_description":["Model: Celebrat PB-09","Battery Capacity: 3.7V-20000mAh (74Wh)","Battery Type: Polymer Lithium Battery","Input: Type-C, 5V/2A, 5V/2A;","Output: USBA1/2 ,5V/2.1A, 5V/2A (Max)"],"emi_price":299,"full_description":"<h2>Yison Celebrat PB-09 20000mAh Power Bank</h2><p>The Yison <strong>Celebrat PB-09</strong> 20000mAh <a href=\"https://www.startech.com.bd/power-bank\" target=\"\" style=\"color: rgb(0, 0, 0);\">Power Bank</a> is a portable charging powerhouse built to satisfy the demands of today's lifestyles. This power bank is equipped with a powerful lithium battery with a capacity of 3.7V-20000mAh (74Wh) and a nominal capacity of 12000mAh (5V/2A), ensuring a plenty of power to keep your gadgets operating for extended periods of time without the need for regular recharges. The Celebrat PB-09, made of robust PC+ABS materials, finds the right mix between strength and portability, making it an excellent companion for travel, outdoor excursions, and everyday usage. The Celebrat PB-09 provides a variety of input choices to meet a wide range of charging requirements. With Type-C and Micro inputs that enable 5V/2A, recharging the power bank is quick and easy, ensuring you're always ready for your next journey. Its twin USB-A output ports provide a consistent 5V/2.1A each, allowing you to charge two devices at once with maximum speed and efficiency. The total output capacity is limited to 5V/2A (max), guaranteeing consistent and secure power delivery to your devices without sacrificing performance. In addition to its excellent charging capabilities, the Yison Celebrat PB-09 has a straightforward LED digital display that allows for real-time monitoring of remaining power. This function keeps you informed about the battery's state at a glance, allowing you to manage your charging needs properly and prevent running out of power when you need it most. The LED display also improves the entire user experience by adding ease and elegance. With its large capacity, sturdy design, and user-friendly features, the Yison Celebrat PB-09 20000mAh Power Bank is more than just a portable charger; it's a dependable companion that keeps you connected and charged up wherever life takes you. Whether you're traveling, working remotely, or simply enjoying outdoor activities, the Celebrat PB-09 is the ideal way to keep your gadgets charged and ready to go. </p><h2>Buy Yison Celebrat PB-09 20000mAh Power Bank From Star Tech</h2><p>In Bangladesh, you can get original <span style=\"font-weight: bold;\">Yison Celebrat PB-09 20000mAh Power Bank</span> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/yison-power-bank\" target=\"\">Yison Power Bank</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Yison Celebrat PB-09 20000mAh Power Bank comes with no warranty.</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Capacity","value":"3.7V-20000mAh (74Wh)"},{"key":"Input","value":"Input: Type-C Input: 5V/2A; Micro Input: 5V/2A"},{"key":"Output","value":"Output: USBA1/2 Output: 5V/2.1A；Total Output:5V/2A (Max)"},{"key":"Interface","value":"2x USB-A"},{"key":"Button","value":"Yes"}]},{"heading":"Physical Specification","values":[{"key":"Color","value":"Black"},{"key":"Material","value":"PC+ABS"}]},{"heading":"Manufacture Warranty","values":[{"key":"Warranty","value":"No"}]}],"latest_price":{"heading":"What is the price of Yison Celebrat PB-09 20000mAh Power Bank in Bangladesh?","paragraph":"The latest price of Yison Celebrat PB-09 20000mAh Power Bank in Bangladesh is 3,260৳. You can buy the Yison Celebrat PB-09 20000mAh Power Bank at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/power-bank/yison/celebrat-pb-09/celebrat-pb-09-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/power-bank/yison/celebrat-pb-09/celebrat-pb-09-02-500x500.webp"],"product_seo_title":"Yison Celebrat PB-09 20000mAh Power Bank Price in Bangladesh","product_seo_description":"Buy Yison Celebrat PB-09 20000mAh Power Bank at best price in Bangladesh. Latest Yison Celebrat PB-09 20000mAh Power Bank available at Star Tech Online Shop in BD.","product_seo_keywords":"Yison Celebrat PB-09 20000mAh Power Bank\n\n"}]