[{"url":"https://www.startech.com.bd/wavefun-wave-50-rugged-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/wavefun/wave-50/wave-50-01-228x228.webp","title":"Wavefun Wave 50 Rugged Smart Watch","product_list_short_description":["1.83\" 240*286 HD Touch Screen Display","Supports Bluetooth Call","Built-in 123 sports modes","380mAh Battery Capacity"],"price_new":0,"price_old":0,"price_single":3900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Wavefun Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Wavefun Smart Watch at the best price in Bangladesh. Latest Wavefun Rugged Smart Watch available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Wavefun Smart Watch","status":"In Stock","code":"29194","brand":"Wavefun","product_page_short_description":["Model: Wave 50","1.83\" 240*286 HD Touch Screen Display","Supports Bluetooth Call","Built-in 123 sports modes","380mAh Battery Capacity"],"emi_price":358,"full_description":"<h2>Wavefun Wave 50 Rugged Smart Watch</h2><p>The Wavefun Wave 50 is a rugged smartwatch designed for outdoor use. It features a 1.83-inch HD full touch screen made of high-quality aluminum alloy and tempered glass, meeting military-grade standards for durability. The watch is resistant to heat, cold, dust, moisture, and salt spray. With its bright and clear display, the Wave 50 offers a textured viewing experience. Wavefun Wave 50 Rugged Smart Watch supports making and answering calls, playing music, and receiving notifications from various social media platforms. It has 123 built-in sports modes and can automatically detect and record training data. The Wavefun Wave 50 smartwatch is IP68 waterproof, making it suitable for activities such as handwashing and running in the rain. It also offers health monitoring features like heart rate, blood pressure, blood oxygen, and sleep tracking. The Wavefun Wave 50 Rugged Smart Watch has a long battery life and supports convenient functions such as a calculator, voice assistant, game mode, weather updates, alarm clock, remote camera control, sedentary reminder, stopwatch, and customizable watch faces.<br></p><h2>Buy Wavefun Wave 50 Rugged Smart Watch from the best Smartwatch Shop in BD</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/wavefun-wave-50-rugged-smart-watch\" target=\"\">Wavefun Wave 50 Rugged Smart Watch</a> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/wavefun-smart-watch\" target=\"\">Wavefun Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at the lowest price. The Wavefun Wave 50 Smart Watch comes with 1 Year Brand Warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"Realtek 8763E"},{"key":"Display","value":"1.83\" 240*286 HD"},{"key":"Battery","value":"380mAh"},{"key":"Connectivity","value":"Bluetooth 5.3"},{"key":"SpecialFeatures","value":"Bluetooth call"},{"key":"Supported Apps/ Software","value":"DA Fit"},{"key":"Others","value":"Heart Rate Senor: HR3605"}]},{"heading":"Exterior","values":[{"key":"Weight","value":"52g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"No warranty"}]}],"latest_price":{"heading":"What is the price of Wavefun Wave 50 Rugged Smart Watch in Bangladesh?","paragraph":"The latest price of Wavefun Wave 50 Rugged Smart Watch in Bangladesh is 3,900৳. You can buy the Wavefun Wave 50 Rugged Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/wavefun/wave-50/wave-50-01-500x500.webp"],"product_seo_title":"Wavefun Wave 50 Rugged Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Wavefun Wave 50 Rugged Smart Watch at best price in Bangladesh. Latest Wavefun Wave 50 Smart Watch available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"Wavefun Wave 50 Rugged Smart Watch"}]