[{"url":"https://www.startech.com.bd/xiaomi-redmi-sonicbass-wireless-nechband-earphone","img":"https://www.startech.com.bd/image/cache/catalog/neckband/xiaomi/redmi-sonicbass/redmi-sonicbass-01-228x228.webp","title":"Xiaomi Redmi SonicBass Wireless Neckband Earphone","product_list_short_description":["9.2mm Dynamic Driver Delivers Superior Sound Quality","Dual-Mic Environmental Noise Cancellation","Dual Pairing Multi-Point Connection","IPX4 Rated Splash & Sweat Proof"],"price_new":0,"price_old":0,"price_single":1850,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XIAOMI Neckband Price in Bangladesh | Star Tech","cat_seo_description":"Buy XIAOMI Neckband at the best price in Bangladesh. Latest XIAOMI Bluetooth Wireless Neckband Earphone available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"XIAOMI MI Neckband","status":"In Stock","code":"25268","brand":"XIAOMI","product_page_short_description":["MPN: BHR4063GL","Model: Redmi SonicBass INLYEJ02LS","9.2mm Dynamic Driver Delivers Superior Sound Quality","Dual-Mic Environmental Noise Cancellation","Dual Pairing Multi-Point Connection","IPX4 Rated Splash & Sweat Proof"],"emi_price":170,"full_description":"<h2 style=\"text-align: justify; \">Xiaomi Redmi SonicBass Wireless Neckband Earphone</h2><p style=\"text-align: justify;\">Xiaomi Redmi SonicBass Wireless Neckband Earphone comes with a 9.2mm dynamic driver that delivers superior sound quality and bass response for music listening. It features dual mic environmental noise cancellation and a waterproof rating. Keep yourself entertained with long hours of music, movies, and video feeds. The Redmi SonicBass delivers 12 hours of uninterrupted music playback. You can listen to your favorite music for longer. And it has a 20% battery reminder function. It is equipped with fast and stable Bluetooth 5.0 Connectivity. It has a multi-function button and gets things done without taking your phone out of the pocket.<br></p><h3 style=\"text-align: justify;\">Dual-Mic Environmental Noise Cancellation</h3><p style=\"text-align: justify;\">The Xiaomi Redmi SonicBass Wireless Neckband<a href=\"https://www.startech.com.bd/earphone\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\"> Earphone </a>offers clear voice quality during calls and only gets better with dual-mic ENC. The dual-mic ENC suppresses environmental noise during calls and makes your voice crisp and clear on the receiving end.</p><h3 style=\"text-align: justify;\">IPX4 Rated Splash &amp; Sweat Proof</h3><p style=\"text-align: justify;\">Redmi SonicBass<a href=\"https://www.startech.com.bd/neckband\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\"> neckband </a>comes with an&nbsp;IPX4 rating which makes it perfect to play your music as you sweat it out in the gym. Designed for extra durability with protection against splashes and spills.</p><p style=\"text-align: justify;\">The&nbsp;Xiaomi Redmi SonicBass Wireless Neckband Earphone comes with a 03-month warranty.</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Connection Type","value":"Bluetooth 5.0"},{"key":"Battery","value":"120 mAh Lithium Polymer Battery"},{"key":"Duration","value":"Music Playback Time: Up to 12 hours"},{"key":"Others","value":"IPX5 water-resistant level"}]},{"heading":"Physical Specification","values":[{"key":"Weight","value":"21.2 g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"03-Month warranty"}]}],"latest_price":{"heading":"What is the price of Xiaomi Redmi SonicBass Wireless Neckband Earphone in Bangladesh?","paragraph":"The latest price of Xiaomi Redmi SonicBass Wireless Neckband Earphone in Bangladesh is 1,850৳. You can buy the Xiaomi Redmi SonicBass Wireless Neckband Earphone at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/neckband/xiaomi/redmi-sonicbass/redmi-sonicbass-01-500x500.webp"],"product_seo_title":"Xiaomi Redmi SonicBass Wireless Neckband Earphone Price in Bangladesh","product_seo_description":"Buy Xiaomi Redmi SonicBass Wireless Neckband Earphone at best price in BD. Latest Xiaomi Redmi SonicBass Neckband available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Xiaomi Redmi SonicBass Wireless Neckband Earphone"},{"url":"https://www.startech.com.bd/xiaomi-mi-line-free-wireless-neckband-earphone","img":"https://www.startech.com.bd/image/cache/catalog/neckband/xiaomi/mi-line-free/mi-line-free-01-228x228.webp","title":"Xiaomi Mi Line Free Wireless Neckband Earphone","product_list_short_description":["80m Slow-latency","Qualcomm QCC5125 audio chipset.","DSP+cVC Technology for Crystal Clear Audio","9-hour Battery Life"],"price_new":1890,"price_old":2990,"price_single":1890,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XIAOMI Neckband Price in Bangladesh | Star Tech","cat_seo_description":"Buy XIAOMI Neckband at the best price in Bangladesh. Latest XIAOMI Bluetooth Wireless Neckband Earphone available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"XIAOMI MI Neckband","status":"In Stock","code":"35372","brand":"XIAOMI","product_page_short_description":["Model: Mi Line Free","80m Slow-latency","Qualcomm QCC5125 audio chipset.","DSP+cVC Technology for Crystal Clear Audio","9-hour Battery Life"],"emi_price":274,"full_description":"<h2>Xiaomi Mi Line Free Wireless Neckband Earphone </h2><p>The Xiaomi <strong>Mi Line Free</strong> Wireless Neckband <a href=\"https://www.startech.com.bd/neckband\" target=\"\" style=\"color: rgb(0, 0, 0);\">Earphone </a>is a accessory that blends modern technology with ergonomic design to provide an excellent listening experience. This wireless earphone, with its stylish neckband design and magnetic earbuds, provides not only style but also functionality, providing secure and pleasant usage even after lengthy use. When not in use, the magnetic earbuds may be conveniently stored around your neck, eliminating tangling and keeping your headphones within easy reach. The Xiaomi Mi Line Free Earphone, powered by Qualcomm's QCC5125 audio chipset and equipped with Qualcomm's aptX Adaptive technology, sets a new bar for wireless audio quality. With 80ms of latency, you can enjoy smooth audio and video synchronization, whether you're watching movies or playing games, for an immersive and lag-free experience. This earphone uses DSP (Digital Signal Processing) and cVc (Clear Voice Capture) technology to improve sound quality, resulting in crystal clear music playback and clear and natural voice reproduction during conversations. Whether you're listening to music or making phone conversations, you'll get rich, immersive sound with incredible clarity. The Xiaomi Mi Line Free Wireless Neckband Earphone is intended to keep up with your active lifestyle. With a battery life of up to 9 hours on a single charge, you may enjoy uninterrupted listening sessions. When it's time to recharge, the earphone uses a USB Type-C connector for quick and easy charging. Whether you're commuting, working out, or simply relaxing at home, the Xiaomi Mi Line Free Wireless Neckband Earphone provides superior audio quality and unparalleled comfort, letting you to listen to your favorite music while being connected wherever you go. The Xiaomi Mi Line Free Earphone provides the greatest wireless audio experience. </p><img src=\"https://www.startech.com.bd/image/catalog/neckband/xiaomi/mi-line-free/mi-line-free-001.webp\" alt=\"Xiaomi Mi Line Free Wireless Neckband Earphone\" width=\"920\" height=\"450\"><h2>Buy Xiaomi Mi Line Free Wireless Neckband Earphone  from Star Tech</h2><p>In Bangladesh, you can get original <strong>Xiaomi Mi Line Free Wireless Neckband Earphone </strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/xiaomi-neckband\" target=\"\">Xiaomi Neckband</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Xiaomi Mi Line Free Wireless Neckband Earphone comes with 1 year of warranty.</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Connection Type","value":"Bluetooth 5.0"},{"key":"Battery","value":"100 mAh Lithium Polymer Battery"},{"key":"Duration","value":"Music time: about 9 hours"}]},{"heading":"Physical Specification","values":[{"key":"Weight","value":"25g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"1 year"}]}],"latest_price":{"heading":"What is the price of Xiaomi Mi Line Free Wireless Neckband Earphone in Bangladesh?","paragraph":"The latest price of Xiaomi Mi Line Free Wireless Neckband Earphone in Bangladesh is 1,890৳. You can buy the Xiaomi Mi Line Free Wireless Neckband Earphone at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/neckband/xiaomi/mi-line-free/mi-line-free-01-500x500.webp"],"product_seo_title":"Xiaomi Mi Line Free Wireless Neckband Earphone Price in Bangladesh","product_seo_description":"Buy Xiaomi Mi Line Free Wireless Neckband Earphone at best price in Bangladesh. Latest Xiaomi Mi Line Free Neckband available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Xiaomi Mi Line Free Wireless Neckband Earphone"},{"url":"https://www.startech.com.bd/xiaomi-ydlyej01lm-bluetooth-sports-earphone","img":"https://www.startech.com.bd/image/cache/catalog/accessories/earphone/xiaomi/ydlyej01lm/ydlyej01lm-228x228.jpg","title":"Xiaomi YDLYEJ01LM Bluetooth Sports Earphone","product_list_short_description":["Waterproof & Sweat-proof","Frequency : 20Hz - 40KHz","Impedance: 32Ω","Bluetooth Version: V4.1"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XIAOMI Neckband Price in Bangladesh | Star Tech","cat_seo_description":"Buy XIAOMI Neckband at the best price in Bangladesh. Latest XIAOMI Bluetooth Wireless Neckband Earphone available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"XIAOMI MI Neckband","status":"Out Of Stock","code":"12589","brand":"XIAOMI","product_page_short_description":["MPN: ZBW4378GL","Model: Xiaomi YDLYEJ01LM","Waterproof & Sweat-proof","Frequency : 20Hz - 40KHz","Impedance: 32Ω","Bluetooth Version: V4.1"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify;\"><span style=\"font-weight: bold;\">Xiaomi YDLYEJ01LM Bluetooth Sports Earphone </span></h2><p style=\"text-align: justify;\">Mi Sports Bluetooth Earphones are engineered to be water resistant for those who want a great music experience during a workout without compromising comfort. Whether sweating it out at the gym or running through heavy rain, they are always ready for any challenge that lies ahead. Their adjustable ear hooks offer grip around your ears which assures the earbuds stay in place during workouts. With up to 7 hours of playback on a single charge and a water-resistant design, Mi Sports Bluetooth Earphones are ready to push you further even when you are running through the rain. You want your earphones to stay snug and secure even during the toughest workout. Because the ear hooks are made from a premium soft and flexible material, you can slide the adjustable hook to hold your earbuds in place. Mi Sport Bluetooth Earphones boast a large 100mAh battery which provides up to 7 hours of playback and up to 11 days of standby time. The workout doesn't stop when your earphone is low on battery a quick 10-minute charge gets you a full hour of playback time so no more excuses for missing a workout. With Mi Sports Bluetooth Earphones you can connect and pair to two different Bluetooth devices simultaneously up to 10 meters away. It is equipped with a Bluetooth 4.1 chipset which delivers crisp tones and amazing voice quality, giving you an exceptional sound experience whether you're listening to music from your laptop or picking up calls from your smartphone. The last thing you want in the middle of a workout is to reach into your pocket to pick up a call. Mi Sports Bluetooth Earphones allow you to control calls and music directly from the earbuds. The ergonomic control buttons let you access your tracks and calls in an instant, without ever needing to reach for your phone in your pocket. The earbuds feature a wear and sweat-resistant exterior to increase durability. The special silicone coating over the audio cable makes it smooth and comfortable to touch.</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Impedance","value":"32Ω"},{"key":"Power Output","value":"100mAh"},{"key":"Duration","value":"Standby time：280 hours"},{"key":"Others","value":"Wireless range: 10 meters"}]},{"heading":"Physical Specification","values":[{"key":"Connector","value":"Micro USB"},{"key":"Weight","value":"17.8g"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Xiaomi YDLYEJ01LM Sports Earphone in Bangladesh?","paragraph":"The latest price of Xiaomi YDLYEJ01LM Sports Earphone in Bangladesh is 2,250৳. You can buy the Xiaomi YDLYEJ01LM Sports Earphone at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/accessories/earphone/xiaomi/ydlyej01lm/ydlyej01lm-500x500.jpg"],"product_seo_title":"Xiaomi YDLYEJ01LM  Earphone Price in Bangladesh | Star Tech","product_seo_description":"Buy Xiaomi YDLYEJ01LM Bluetooth Sports Earphone   at best price in Bangladesh. Order online or visit your nearest Star tech branch","product_seo_keywords":"Xiaomi YDLYEJ01LM Bluetooth Sports Earphone "},{"url":"https://www.startech.com.bd/xiaomi-haylou-purfree-bc01-bone-conduction-headphone","img":"https://www.startech.com.bd/image/cache/catalog/earphone/xiaomi/purfree-bc01/purfree-bc01-01-228x228.jpg","title":"Haylou PurFree BC01 Wireless Bone Conduction Headphone","product_list_short_description":["Open-ear Design","Professionally waterproof","8-hour battery life","Dual-device connection"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XIAOMI Neckband Price in Bangladesh | Star Tech","cat_seo_description":"Buy XIAOMI Neckband at the best price in Bangladesh. Latest XIAOMI Bluetooth Wireless Neckband Earphone available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"XIAOMI MI Neckband","status":"Out Of Stock","code":"23495","brand":"Haylou","product_page_short_description":["Model: PurFree BC01","Open-ear Design","Professionally waterproof","8-hour battery life","Dual-device connection"],"emi_price":0,"full_description":"<h2>Haylou PurFree BC01 Wireless Bone Conduction Headphone</h2><p>The Haylou PurFree BC01 Bone Conduction Headphone offers high-quality sound via the cheekbone. Unlike over-ear headphones, the Haylou Purfree BC01 enables complete awareness of the environment as well as bud-free, comfortable listening. Our lightweight titanium frame Haylou Purfree BC01 headphones, weighing only 28g, provide unrivaled comfort. Skin-friendly silicone adds wear comfort during exercises. A fully-sealed cavity and IP67 waterproof certification can endure perspiration from high-intensity exercises, making it ideal for running, cycling, hiking, and other outdoor activities. Haylou's exclusive Directional audio technology successfully avoids sound leaking for full sound details while protecting your privacy. For crystal clear conversations, dual microphones and the CVC noise cancellation system automatically identify and eliminate background noise. It combines modern technologies and a balanced construction design to create a comfortable fit. Haylou Purfree BC01 was awarded the German Red Dot Design Award in 2022. The Haylou Purfree BC01 headphones boast a more reliable and quicker connection, as well as aptX Hi-Fi sound, thanks to the Qualcomm 3044 and Bluetooth 5.2 chip. With 8 hours of gameplay, you can listen to your music all day. The magnetic rapid charge speedily recharges the headphones. Haylou Purfree BC01 headphones may connect to two Bluetooth devices at the same time. Switch between two devices and do numerous chores with ease. The Haylou PurFree BC01 Bone Conduction Headphone comes with a 6 months warranty.</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Connection Type","value":"Bluetooth 5.2"},{"key":"Battery","value":"Earbuds charging time: About 1.5 hours"},{"key":"Duration","value":"Battery life: Above 8 hours"},{"key":"Others","value":"Support protocol: SBC / AAC / A2DP / AVRCP / HFP / HSP"}]},{"heading":"Physical Specification","values":[{"key":"Connector","value":"Wireless"},{"key":"Color","value":"Black"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"6 months"}]}],"latest_price":{"heading":"What is the price of Haylou PurFree BC01 Bone Conduction Headphone in Bangladesh?","paragraph":"The latest price of Haylou PurFree BC01 Bone Conduction Headphone in Bangladesh is 6,100৳. You can buy the Haylou PurFree BC01 Bone Conduction Headphone at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/earphone/xiaomi/purfree-bc01/purfree-bc01-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/earphone/xiaomi/purfree-bc01/purfree-bc01-02-500x500.jpg"],"product_seo_title":"Haylou PurFree BC01 Bone Conduction Headphone Price in BD","product_seo_description":"Buy Haylou PurFree BC01 Wireless Bone Conduction Headphone at best price in Bangladesh. Latest Earphone available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Haylou PurFree BC01 Wireless Bone Conduction Headphone"}]