[{"url":"https://www.startech.com.bd/acefast-t6-enc-true-wireless-earbuds","img":"https://www.startech.com.bd/image/cache/catalog/earbuds/acefast/acefast-t6/t6-modern-grey-01-228x228.webp","title":"ACEFAST T6 ENC True Wireless Stereo Earbuds","product_list_short_description":["ENC noise reduction","LED digital display","Chip Bestechnic BES2300IU","IPX4 waterproof"],"price_new":4040,"price_old":5150,"price_single":4040,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"ACEFAST Earbuds Price in Bangladesh | Star Tech","cat_seo_description":"Buy ACEFAST Earbuds at the best price in Bangladesh. Latest ACEFAST TWS True Wireless Earbuds available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"ACEFAST TWS Earbuds Price in BD","status":"In Stock","code":"26415","brand":"ACEFAST","product_page_short_description":["Model: T6","ENC noise reduction","LED digital display","Chip Bestechnic BES2300IU","IPX4 waterproof"],"emi_price":472,"full_description":"<h2>ACEFAST T6 ENC True Wireless Stereo Earbuds</h2><p>The ACEFAST T6 is a high-quality and feature-rich Bluetooth headset that is designed for music listening and hands-free calling. It has the latest Bluetooth version v5.0 and Bestechnic BES2300IU chip, which provide a reliable and stable wireless connection. It supports SBC/AAC audio decoding protocol and has a frequency response range of 20Hz~20kHz. The transmission distance is ≥10m, allowing for a stable and clear connection.</p><h3>Long Lasting Battery Life</h3><p>The&nbsp;ACEFAST T6 has a battery capacity of 40mAh and can work for 4 hours in music mode and 3 hours in call mode. The charging case has a capacity of 500mAh and can provide an additional 20 hours of working time. The headset can be charged in about 1 hour and the charging case in about 2 hours. The charging case input is DC5V / 0.4A. It supports fast charging, which allows you to charge the device for 10 minutes and use it for 1.5 hours.&nbsp;</p><h3>IPX4 Waterproof</h3><p>It also has an IPX4 waterproof rating, making it suitable for use in different environments. It has several certifications including CE, RoHS, FCC, EAC, TELEC, BQB, and UL62368 test reports, ensuring that it meets safety and quality standards.</p><h3>LED Digital Display</h3><p>The ACEFAST T6 TWS headset has several features such as LED digital display and ENC noise reduction for clear calls. The headset is made of translucent material and it offers a sleek and stylish design.</p><h2>Buy ACEFAST T6 ENC True Wireless Stereo Earbuds from Star Tech</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/acefast-t6-enc-true-wireless-earbuds\" target=\"\">ACEFAST T6 ENC True Wireless Stereo Earbuds</a> From Star Tech. We have a large collection of latest ACEFAST Earbuds to purchase for your <a href=\"https://www.startech.com.bd/mobile-phone\" target=\"\">Mobile phone</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The&nbsp;ACEFAST T6 ENC True Wireless Earbuds comes with 18 Months warranty.</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Frequency","value":"20Hz~20kHz"},{"key":"Connection Type","value":"Wireless (v5.0 / Bestechnic BES2300IU)"},{"key":"Microphone","value":"Yes"},{"key":"Battery","value":"Earpiece: 40mAh"},{"key":"Duration","value":"Headset working time: 4 hours (music mode). 3 hours (calls mode)"},{"key":"Others","value":"Waterproof rating: IPX4"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"49.5x42.4x29.6mm"},{"key":"Weight","value":"About 39.5g"},{"key":"Color","value":"Modern Grey"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"18 Months"}]}],"latest_price":{"heading":"What is the price of ACEFAST T6 ENC TWS Earbuds in Bangladesh?","paragraph":"The latest price of ACEFAST T6 ENC TWS Earbuds in Bangladesh is 4,040৳. You can buy the ACEFAST T6 ENC TWS Earbuds at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/earbuds/acefast/acefast-t6/t6-modern-grey-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/acefast/acefast-t6/t6-modern-grey-02-500x500.webp"],"product_seo_title":"ACEFAST T6 ENC True Wireless Stereo Earbuds Price in Bangladesh","product_seo_description":"Buy ACEFAST T6 ENC True Wireless Stereo Earbuds at the best price in Bangladesh. Latest ACEFAST T6 ENC Earbuds available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"ACEFAST T6 ENC True Wireless Stereo Earbuds"}]