[{"url":"https://www.startech.com.bd/akash-dth-full-setup-basic","img":"https://www.startech.com.bd/image/cache/catalog/television/akash/akash-set-top-box-basic-228x228.jpg","title":"AKASH DTH Full Setup (Basic) with 130+ Live TV Channel and 60+ Full HD Channel","product_list_short_description":["130+ Live TV Channels & 60+ Full HD Channels","5x Sharper Picture Quality","Digital Quality Sound","Free Installation Anywhere in BD"],"price_new":0,"price_old":0,"price_single":4499,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"AKASH DTH Price in Bangladesh | Star Tech","cat_seo_description":"Buy AKASH DTH at the best price in Bangladesh. Latest AKASH DTH Digital TV Set-Top Box available at Star Tech Online Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"AKASH DTH, AKASH DTH Digital TV Set-Top Box, ","status":"In Stock","code":"23514","brand":"AKASH","product_page_short_description":["Model: AKASH Basic","130+ Live TV Channels & 60+ Full HD Channels","5x Sharper Picture Quality","Digital Quality Sound","Free Installation Anywhere in BD"],"emi_price":412,"full_description":"<h2 style=\"text-align: justify; \">AKASH DTH Full Setup (Basic) with 130+ Live TV Channel and 60+ Full HD Channel</h2><p style=\"text-align: justify; \">The AKASH DTH Full Setup (Basic) offers great picture quality, incredibly vivid colors, sharper images, and stunning surround sound. It takes your TV watching experience to another level with its wide array of features. It offers 5x Sharper Picture Quality and Digital Quality Sound. The AKASH DTH Full Setup includes AKASH Basic Set-top-box with a power supply unit (PSU), Remote Control Unit (RCU), <a href=\"https://www.startech.com.bd/hdmi-cable\" target=\"\">HDMI Cable</a>, Dish with accessories, Single port LNB, and 2 connectors (indoor &amp; outdoor). Akash DTH cable Broadcasting Service helps the distribution of multi-channel TV programs in Ku Band by using a satellite system by providing TV signals direct to our subscribers' premises. For DTH connection AKASH provides a set that comprises the dish and a receiving set. The company beams an encrypted signal that only the set installed in your household can receive and enable viewing. AKASH DTH Full Setup comes with 130 plus Live TV Channel and 60 plus Full HD Channel. They offer you a chance to customize your channel plan as per your need. Akash DTH has many advantages like one can do away with the cable operator who will give you channels of his choice and there is no assurance of quality. The quality of signals, in this case, is expected to be superior since the signal is not split through a cable. So you don't have to compromise on the quality. And Because you are choosing just the signals that are needed, you are not spending extra monthly cable bills on unnecessary channels. The AKASH DTH Set-Top Box comes with a 1-Year Warranty.<br><span style=\"background-color: yellow; font-weight: bold;\">*Includes 10M Cable (Extra Cable Charges Per Meter 20Tk)</span></p><p style=\"text-align: justify; \"><span style=\"font-weight: 700; background-color: yellow;\">The Installation service will be officially provided by AKASH. Please call 16442 for the free installation service and to get any kind of support. (It may take up to 72 hours to provide installation service after product delivery)</span><br></p>","specifications":[],"latest_price":{"heading":"What is the price of AKASH DTH Full Setup (Basic) in Bangladesh?","paragraph":"The latest price of AKASH DTH Full Setup (Basic) in Bangladesh is 4,499৳. You can buy the AKASH DTH Full Setup (Basic) at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/television/akash/akash-set-top-box-basic-500x500.jpg"],"product_seo_title":"AKASH DTH Full Setup (Basic) Price in Bangladesh | Star Tech","product_seo_description":"Buy AKASH DTH Full Setup (Basic) at the best price in Bangladesh. Latest AKASH DTH Digital TV Set-Top Box available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"AKASH DTH Full Setup (Basic) with 130+ Live TV Channel and 60+ Full HD Channel"}]