[{"url":"https://www.startech.com.bd/honor-watch-gs3-bluetooth-calling-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smartwatch/honor/watch-gs3/watch-gs3-01-228x228.webp","title":"HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch","product_list_short_description":["Screen: 1.43 inches, AMOLED, 466x466 pixels, 326 PPI","ROM: 4GB","Water Resistance: 5-ATM Rating","Features: Bluetooth Calling"],"price_new":12500,"price_old":12999,"price_single":12500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"HONOR Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy latest HONOR Smart Watches at best price in Bangladesh. Find your favorite HONOR smart watch at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"HONOR Smart Watch","status":"In Stock","code":"31412","brand":"HONOR","product_page_short_description":["Model: Watch GS3","Screen: 1.43 inches, AMOLED, 466x466 pixels, 326 PPI","ROM: 4GB","Water Resistance: 5-ATM Rating","Features: Bluetooth Calling"],"emi_price":1192,"full_description":"<h2>HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch</h2><p>The HONOR <span style=\"font-weight: bold;\">Watch GS3</span> 1.43\" AMOLED Bluetooth Calling <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">Smart Watch</a> is a smart and rugged device that offers convenience in making and receiving calls, tracking health and fitness, and exploring the outdoors. It features a 1.43-inch AMOLED screen with a resolution of 466x466 pixels and 326 PPI, which is touch-sensitive and supports swipe and tap gestures. The watch has a sturdy metal and plastic body with two types of straps: a fluoroelastomer strap for comfort and a leather strap for comfort. The HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch has a built-in ROM of 4GB, a GPS module for accurate location tracking, and Bluetooth 5.0 connectivity for fast pairing with smartphones or other devices. It also has a speaker and microphone for direct call-making and receiving from your wrist. The watch has a water resistance level of 5ATM, making it suitable for shallow-water activities like swimming pools and seaside swimming. The HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch has various sensors to monitor health and fitness, including heart rate, blood oxygen level, stress level, sleep quality, and more. It provides personalized guidance and suggestions based on the data. Multiple sports modes track calories burned, steps taken, distance traveled, speed, pace, and more. The watch also has an outdoor mode that displays weather, sunrise and sunset times, moon phases, tides, and fishing times. Compatible with Android 8.0 or later devices, the HONOR app allows users to sync data, customize settings, receive notifications, and access more features. The smart LCD display shows time, date, battery level, and other information, and an audible alarm alerts users of incoming calls, messages, events, and more. The HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch is easy to use and charge, with a charging port with magnetic contacts and a large battery capacity of 451 mAh.</p><h2>Buy HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch from Star Tech</h2><p>In Bangladesh, you can get original <span style=\"font-weight: bold;\">HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch</span> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/honor-smart-watch\" target=\"\">HONOR Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tec</a>h Shop to get yours at lowest price. The HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch comes with 6 months warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"Size: 1.43-inch, AMOLED color screen"},{"key":"Memory","value":"4GB"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"Body: Metal and plastic"},{"key":"OS","value":"Android 8.0 or later"},{"key":"Sensor","value":"Accelerometer, gyro, heart rate, barometer, compass, SpO2"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"45.9 mm × 45.9 mm × 10.5 mm"},{"key":"Weight","value":"Approx. 44 g (without the strap)"},{"key":"Color","value":"Ocean Blue"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"6 Months Warranty"}]}],"latest_price":{"heading":"What is the price of HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch in Bangladesh?","paragraph":"The latest price of HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch in Bangladesh is 12,500৳. You can buy the HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smartwatch/honor/watch-gs3/watch-gs3-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/honor/watch-gs3/watch-gs3-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/honor/watch-gs3/watch-gs3-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/honor/watch-gs3/watch-gs3-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/honor/watch-gs3/watch-gs3-081-500x500.webp"],"product_seo_title":"HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch Price in BD","product_seo_description":"Buy HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch at the best price in Bangladesh. Order Latest HONOR Watch GS3 Smart Watch from Star Tech for delivery in BD.\n","product_seo_keywords":"HONOR Watch GS3 1.43\" AMOLED Bluetooth Calling Smart Watch\n"},{"url":"https://www.startech.com.bd/honor-watch-4-bluetooth-calling-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smartwatch/honor/watch-4/watch-4-01-228x228.webp","title":"HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch","product_list_short_description":["Screen: 1.75-inch, AMOLED, 450 x 390 pixels, 340 PPI","Battery: 451 mAh Battery, Up to 10 days of Usage (typical)","Water Resistance: 5-ATM Rating","Features: Bluetooth Calling, 97 Sports Modes"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"HONOR Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy latest HONOR Smart Watches at best price in Bangladesh. Find your favorite HONOR smart watch at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"HONOR Smart Watch","status":"Out Of Stock","code":"31410","brand":"HONOR","product_page_short_description":["Model: Watch 4","Screen: 1.75-inch, AMOLED, 450 x 390 pixels, 340 PPI","Battery: 451 mAh Battery, Up to 10 days of Usage (typical)","Water Resistance: 5-ATM Rating","Features: Bluetooth Calling, 97 Sports Modes"],"emi_price":0,"full_description":"<h2>HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch</h2><p>The HONOR <span style=\"font-weight: bold;\">Watch 4</span> AMOLED Bluetooth Calling <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">Smart Watch</a> is a versatile smart watch that offers hands-free calling, fitness tracking, and health monitoring. It features a 1.75-inch AMOLED color screen with a resolution of 450 x 390 pixels, which is touch-sensitive and supports swipe and tap gestures. The watch's sleek body is made of 6 Series aluminum alloy and comes with a silicone rubber strap that can be adjusted to fit different wrist sizes. The HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch has a water resistance level of 5ATM, making it suitable for shallow-water activities like swimming pools and seaside swimming. However, it is not suitable for underwater diving, hot showers, saunas, hot springs, or other wading or deep water activities. With a built-in ROM of 4GB, the watch supports Bluetooth 5.2 connectivity, allowing fast and stable pairing with your smartphone or other devices. It also has a speaker and microphone that allow you to make and receive calls directly from your wrist without taking out your phone. The HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch has various features that help monitor your health and fitness, including measuring heart rate, blood oxygen level, stress level, sleep quality, and providing personalized guidance. It also has multiple sports modes that track calories burned, steps taken, distance traveled, speed, pace, and more. Compatible with Android 9.0 or higher version and iOS 11.0 or higher version, the HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch has a smart LCD display that shows time, date, battery level, and other information. It also has an audible alarm that alerts you to incoming calls, messages, events, and more. The HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch is a stylish and versatile smartwatch that offers hands-free calling, fitness tracking, and health monitoring.</p><h3>Water Resistance and Durability</h3><p>The HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch has a water resistance certification of 5ATM, which means it is capable of handling water pressure up to 50 meters. It is appropriate for swimming pools, seashore swimming, and other shallow-water sports. However, it is not suited for underwater diving, hot showers, saunas, hot springs, or other wading or deep water activities with high-speed water flows.</p><h3>Health and Fitness Features</h3><p>The HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch includes a number of capabilities that can assist you in tracking your health and fitness. It can monitor your heart rate, blood oxygen level, stress level, and sleep quality, among other things. It can also provide you with&nbsp;specific advice and recommendations based on your data. The watch also includes many sports settings that can measure your calories burned, steps done, distance traveled, speed, and pace, among other things. You may also encourage yourself by setting objectives and reminders.</p><h2>Buy HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch from Star Tech</h2><p>In Bangladesh, you can get original <span style=\"font-weight: bold;\">HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch</span> From Star Tech. We have a large collection of latest<a href=\"https://www.startech.com.bd/honor-smart-watch\" target=\"\"> HONOR Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tec</a>h Shop to get yours at lowest price. The HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch comes with 6 months warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"Size: 1.75-inch, AMOLED color screen"},{"key":"Memory","value":"4GB"},{"key":"Battery","value":"451mAh battery, up to 10 days of usage (typical)"},{"key":"Connectivity","value":"Bluetooth 5.2"},{"key":"Material","value":"Body: 6 series alluminum alloy middle-frame"},{"key":"OS","value":"Android 9.0 or higher version"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"45.3 mm × 39.1mm ×11.2 mm"},{"key":"Weight","value":"Approximately 32g (without the strap)"},{"key":"Color","value":"Gold"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"6 Months Warranty"}]}],"latest_price":{"heading":"What is the price of HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch in Bangladesh?","paragraph":"The latest price of HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch in Bangladesh is 14,999৳. You can buy the HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smartwatch/honor/watch-4/watch-4-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smartwatch/honor/watch-4/watch-4-500x500.webp"],"product_seo_title":"HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch Price in Bangladesh","product_seo_description":"Buy HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch at best price in Bangladesh. Order the Latest HONOR Watch 4 Smart Watch from Star Tech for delivery in Bangladesh.","product_seo_keywords":"HONOR Watch 4 AMOLED Bluetooth Calling Smart Watch"}]