[{"url":"https://www.startech.com.bd/dji-osmo-action-3-standard-combo-action-camera","img":"https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-01-228x228.webp","title":"DJI Osmo Action 3 Standard Combo Action Camera","product_list_short_description":["Image Sensor: 1/1.7-inch CMOS","Number of Microphones: 3","Max Photo Resolution, 4000×3000","Supported SD Cards: microSD (up to 256 GB)"],"price_new":34500,"price_old":35000,"price_single":34500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Action Camera Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Action Camera at the best price in Bangladesh. Latest DJI Osmo Action Camera available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"DJI Action Camera","status":"In Stock","code":"35652","brand":"Dji","product_page_short_description":["Model: Osmo Action 3 Standard Combo","Image Sensor: 1/1.7-inch CMOS","Number of Microphones: 3","Max Photo Resolution, 4000×3000","Supported SD Cards: microSD (up to 256 GB)"],"emi_price":3208,"full_description":"<h2>DJI Osmo Action 3 Standard Combo Action Camera</h2><p>The DJI <strong>Osmo Action 3</strong> <a href=\"https://www.startech.com.bd/camera/action-camera\" target=\"\" style=\"color: rgb(0, 0, 0);\">Action Camera</a>'s waterproof design allows it to endure depths of up to 16 meters without a waterproof case and an amazing 60 meters with one. With three microphones, it guarantees rich audio quality to enhance your video. With a 2.25-inch rear panel and a 1.4-inch front screen, its dual touchscreens provide simple navigation and intuitive control. It offers enough space for storing your recordings and supports microSD cards up to 256GB; the Kingston Canvas and SanDisk Extreme series are two suggested versions. With its large 155° field of view and 1/1.7-inch CMOS sensor, the <strong>DJI Osmo Action 3</strong> Action <a href=\"https://www.startech.com.bd/camera\" target=\"\" style=\"color: rgb(0, 0, 0);\">Camera </a>produces amazing images even in difficult lighting situations. With an f/2.8 aperture and an ISO range of 100–12800, it performs exceptionally well in low light. With its variety of recording modes (normal, slow motion, hyperlapse, and timelapse), the Osmo Action 3 ensures that every moment can be captured with ease. Smooth and steady footage is ensured by its sophisticated stabilization technologies, which include RockSteady 3.0 and HorizonBalancing. The DJI Osmo Action 3 Action Camera produces amazing video quality thanks to its maximum video bitrate of 130 Mbps and support for HDR recording. Wi-Fi and Bluetooth connectivity options allow for simple sharing and remote control. The DJI Osmo Action 3 Action Camera is the ideal traveling companion for documenting life's adventures in stunning clarity, whether you're venturing down to the lowest depths or reaching new heights.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-01.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>1/1.7-inch Sensor, Optimum Image Quality</h3><p>Capture moments in dynamic, flawless detail with this DJI <strong>Osmo Action 3</strong> action camera that can record in up to 4K/120 frames per second. There are plenty of opportunities. A very broad field of view enhances the allure, immersion, and memorability of each scene. Realistic hues are experienced. The color temperature sensor of the DJI Osmo Action 3 cleverly modifies AE and white balance for incredibly accurate color reproduction, even in challenging lighting conditions like those encountered during deep-water scuba or free diving. Enjoy greater color grading versatility and embrace deeper color details. With its 10-bit color depth, the action camera can capture over one billion colors, resulting in more realistic color gradients and detailed images that can be edited with greater flexibility.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-02.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>4K HDR</h3><p>The <strong>DJI Osmo Action 3</strong> Action Camera comes equipped with a 10-bit color depth option by default and supports 4K HDR video, which can restore highlights and shadow details. The camera is still capable of capturing 4K footage with rich color details and natural lighting changes in high-contrast situations like sunrises and sunsets. Additionally, you can activate a stabilization mode to successfully remove camera wobble and preserve motion-captured image details.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-03.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>160-min Extended Battery Life</h3><p>With the <strong>DJI Osmo Action 3</strong> Action Camera, the battery capacity restrictions have been stretched even beyond to enable 2.5+ hours of use. Record whole expeditions with just one charge. The first action camera that enables fast-charge technology out of the box is the Action 3. It can reach 80% power in just 18 minutes, which is sufficient for about two hours of photography.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-04.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>RockSteady 3.0 Stabilization System</h3><p>With the latest version of RockSteady EIS, camera shake may be successfully eliminated in all directions thanks to a new generation of sophisticated stabilizing algorithms. A steady and engrossing first-person viewpoint may be obtained with the DJI <strong>Osmo Action 3</strong> Action Camera, which can record in up to 4K/120 frames per second. This clever stabilization technology even corrects tilt horizontally at any angle, reducing camera shake in all directions. This implies that even with severe bumps and 360° rotations, video can stay level horizontally. Furthermore, you have the option to turn on HorizonBalancing, which allows you to record steady 4K/60 frames per second films and correct tilts horizontally within ±45°.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-05.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Dual Touchscreens</h3><p>The dual touch screen of the DJI <strong>Osmo Action 3</strong> Action Camera is useful for vlogging and taking selfies, and it enables touch control features that are frequently utilized. No more rotating the camera to change modes, alter parameters, or playback videos. The user interface changes to reflect the orientation change of the camera from horizontal to vertical. Additionally, even with damp palms, using the touchscreens is simple thanks to their sensitivity.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-06.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Voice Interaction With Built-in 3 Microphone</h3><p>When you briefly push the Quick Switch button, the action camera will vocally broadcast the current shooting mode. You can precisely choose the necessary mode and be sure you'll never miss the moment you want to film, even if the camera is mounted on a helmet or in another difficult-to-see place. To the list of shooting modes, you can even add up to five sets of custom parameters. The DJI <strong>Osmo Action 3</strong> is great in situations where your hands are full since it can identify voice instructions accurately and keeps you focused on the task at hand.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-07.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Quick Switch to Vertical Shooting</h3><p>The unique quick-release design of the <strong>DJI Osmo Action 3</strong> combines a strong magnetic force with an extra positioning clip to improve impact resistance. It is therefore more than prepared for demanding situations. Additionally, it's flexible enough to easily change positions and accessories and is simple to disconnect. The protective frame that can be mounted horizontally or vertically allows you to quickly switch between shooting vertical and horizontal orientations for your action camera. Simply take it off, rotate it, and put it back on.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-08.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Reliable in -20° C (-4° F) Low Temperatures</h3><p>At as low as -20° C (-4° F), record continuously for up to 150 minutes. The <strong>Osmo Action 3</strong> isn't limited to dealing with cold weather. Full-color touchscreens on the front and back of the DJI Osmo Action 3 Action Camera provide simple control over playback and parameter adjustments. The action camera also has a quick-release design for convenient mounting in both horizontal and vertical orientation. There has never been a better moment to act thanks to further advancements in waterproofing, cold resistance, and battery life.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-09.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>16m Waterproof &amp; Drop Resistant</h3><p>Without the need for extra accessories, the <strong>DJI Osmo Action 3</strong> action camera's body is fully tuned to be utilized at depths of up to 16 meters (52 feet), boosting your underwater activities. High-strength Gorilla Glass is used to make the front screen, rear screen, and lens protective cover. It is resistant to wear and scratches and can withstand a 1.5-meter drop. These three locations also have a hydrophobic coating, which rapidly repels water without degrading image quality.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-10.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Align Multi-Camera Footage Quickly</h3><p>The timecode feature of DJI <strong>Osmo Action 3</strong> allows you to effectively sync video from numerous cameras with your video editing software, which will save you time and effort during post-production. More immersive outcomes are the result of exceptional audio performance. It is possible to change the reception orientation to record sound more precisely and with greater focus. You can capture audio with greater confidence in windy or fast-paced situations thanks to a hidden microphone at the bottom of the Osmo Action 3. It even mutes wind noise. For a more engaging communication experience, the Osmo Action 3 can be utilized as a webcam. Easily move between several perspectives and use the stereo sound for clearer interactions, whether you're having meetings, classes, or just hanging out with pals.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-11.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Connect, Sync, and Edit Videos Easily</h3><p>The DJI <strong>Osmo Action 3</strong> and the LightCut video editor app are perfectly matched. To create video edits that are suitable for sharing, it can automatically choose footage and smartly pair them with premium templates. For rapid, practical footage previews, LightCut allows a direct connection with Osmo Action 3. Once you've taken your shots, just let the AI choose your best moments to create 4K HD videos. Pick one of the many entertaining templates made for frantic videos. You may easily access incredible small edits whether you're motorcycling, skiing, or diving.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-12.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Wi-Fi Livestream</h3><p>The DJI <strong>Osmo Action 3</strong> offers a variety of resolutions and supports livestreaming services. At any moment, establish a face-to-face connection with the globe and capture your livestream video. To get the most out of Osmo Action 3, use the DJI Mimo app to unleash the potential of your smartphone. It eliminates the need for a selfie stick in skiing and snowboarding situations by using cloud computing and AI algorithms, giving you amazing footage that appears to have been taken by an expert.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-13.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h2>Buy DJI Osmo Action 3 Standard Combo Action Camera from Star Tech</h2><p>In Bangladesh, you can get original <strong>DJI Osmo Action 3 Standard Combo Action Camera</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/dji-action-camera\" target=\"\">DJI Action Camera</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The DJI Osmo Action 3 Standard Combo Action Camera comes with no warranty.</p>","specifications":[{"heading":"Key Features","values":[{"key":"Image Sensor","value":"1/1.7-inch CMOS"},{"key":"Sensor Resolution","value":"4000×3000"},{"key":"Image","value":"JPEG / RAW"},{"key":"Video","value":"MP4 (H.264 / HEVC)"},{"key":"Display","value":"Dual Display"},{"key":"USB Port","value":"1 x USB-C 2.0 Input/Output"},{"key":"Memory","value":"microSD (up to 256 GB)"}]},{"heading":"Battery Information","values":[{"key":"Removable","value":"Yes"},{"key":"Charging Interface","value":"USB Type-C"},{"key":"type","value":"LiPo 1S"},{"key":"Capacity","value":"1770 mAh"},{"key":"Charging Time","value":"1.5 Hours"}]},{"heading":"Special Features","values":[{"key":"Wi-Fi","value":"Wi-Fi Operating Frequency:"},{"key":"Water Resistant","value":"16 m without Waterproof Case, 60 m with Waterproof Case"},{"key":"HDR Mode","value":"4K (16:9): 3840×2160@24/25/30fps"},{"key":"Slow Motion Recording","value":"4K: 4x (120fps)"},{"key":"Others","value":"Zoom:"}]},{"heading":"Warranty Information","values":[{"key":"Manufacturing Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI Osmo Action 3 Standard Combo Action Camera in Bangladesh?","paragraph":"The latest price of DJI Osmo Action 3 Standard Combo Action Camera in Bangladesh is 34,500৳. You can buy the DJI Osmo Action 3 Standard Combo Action Camera at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-05-500x500.webp"],"product_seo_title":"DJI Osmo Action 3 Standard Combo Action Camera Price in Bangladesh","product_seo_description":"Buy DJI Osmo Action 3 Standard Combo Action Camera at best price in Bangladesh. Latest DJI Osmo Action 3 Action Camera available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"DJI Osmo Action 3 Standard Combo Action Camera"},{"url":"https://www.startech.com.bd/dji-osmo-action-3-adventure-combo-action-camera","img":"https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-01-228x228.webp","title":"DJI Osmo Action 3 Adventure Combo Action Camera","product_list_short_description":["Image Sensor: 1/1.7-inch CMOS","Number of Microphones: 3","Max Photo Resolution, 4000×3000","Supported SD Cards: microSD (up to 256 GB)"],"price_new":39000,"price_old":43000,"price_single":39000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Action Camera Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Action Camera at the best price in Bangladesh. Latest DJI Osmo Action Camera available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"DJI Action Camera","status":"In Stock","code":"35654","brand":"Dji","product_page_short_description":["Model: Osmo Action 3 Adventure Combo","Image Sensor: 1/1.7-inch CMOS","Number of Microphones: 3","Max Photo Resolution, 4000×3000","Supported SD Cards: microSD (up to 256 GB)"],"emi_price":3942,"full_description":"<h2>DJI Osmo Action 3 Adventure Combo Action Camera</h2><p>The DJI <strong>Osmo Action 3</strong> <a href=\"https://www.startech.com.bd/camera/action-camera\" target=\"\" style=\"color: rgb(0, 0, 0);\">Action Camera</a> features three microphones, ensuring excellent audio quality to enhance your movie. Its two touchscreens, a 2.25-inch back panel, and a 1.4-inch front screen offer straightforward navigation and user-friendly control. It supports microSD cards up to 256GB in capacity and provides ample room for keeping your recordings; two recommended models are the Kingston Canvas and SanDisk Extreme series. Even in challenging lighting conditions, the <strong>DJI Osmo Action 3</strong> Action Camera creates stunning photographs because of its broad 155° field of view and 1/1.7-inch CMOS sensor. With an f/2.8 aperture and an ISO range of 100–12800, it has outstanding low-light performance. With the DJI&nbsp;Osmo Action 3's range of recording modes (regular, slow motion, hyperlapse, and timelapse), every moment may be easily documented. Its advanced stabilization features, such as RockSteady 3.0 and HorizonBalancing, guarantee steady and smooth footage. The DJI Osmo Action 3 Action Camera's high video bitrate of 130 Mbps and capabilities for HDR recording enable it to capture incredible video quality. Simple sharing and remote control are made possible via Wi-Fi and Bluetooth networking choices. Whether you're scaling new heights or diving to the lowest points, the DJI Osmo Action 3 Action Camera is the perfect travel companion for capturing life's adventures in breathtaking clarity.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-01.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>1/1.7-inch Sensor, Optimum Image Quality</h3><p>With the DJI <strong>Osmo Action 3</strong> action camera, which records in up to 4K/120 frames per second, you can capture moments in dynamic, perfect detail. Opportunities abound. Every sight is more captivating, immersive, and memorable when it has a very wide field of view. Colors are seen as realistic. The DJI Osmo Action 3's color temperature sensor intelligently adjusts white balance and autoexposure (AE) to produce exceptionally accurate color reproduction, even in difficult lighting situations like those found during deep-water scuba diving or free diving. Take advantage of deeper color details and increased color grading possibilities. The action camera's 10-bit color depth allows it to record over one billion colors, producing detailed photos with more editing freedom and more realistic color gradients.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-02.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>4K HDR</h3><p>Highlights and shadow details can be restored in 4K HDR video, and the <strong>DJI Osmo Action 3</strong> Action Camera has a 10-bit color depth option by default. In high-contrast scenarios like sunrises and sunsets, the camera can still record 4K footage with natural lighting shifts and rich color details. Moreover, you may turn on a stabilization mode to effectively eliminate camera shake and maintain the details of motion-captured images.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-03.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>160-min Extended Battery Life</h3><p>The battery capacity limitations have been pushed further with the DJI <strong>Osmo Action 3</strong> Action Camera, allowing for 2.5+ hours of usage. Capture entire expeditions with a single charge. The Action 3 is the first action camera to come pre-configured with fast-charge capability. It takes only eighteen minutes to achieve 80% power, which is enough for almost two hours of photography.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-04.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>RockSteady 3.0 Stabilization System</h3><p>Thanks to a new generation of advanced stabilizing algorithms, camera shake may be effectively removed in all directions with the most recent version of RockSteady EIS. With the DJI <strong>Osmo Action 3</strong> Action Camera, you can capture a stable and captivating first-person perspective at up to 4K/120 frames per second. In addition to decreasing camera motion in all directions, this ingenious stabilization technology even corrects tilt horizontally at any angle. This suggests that video can remain horizontally level even when subjected to extreme bumps and 360° rotations. Additionally, you may use HorizonBalancing, which corrects tilts horizontally within ±45° and lets you capture steady 4K/60 frames per second films.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-05.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Dual Touchscreens</h3><p>The <strong>DJI Osmo Action 3</strong> Action Camera's dual touch screen allows for touch control functions that are often used, and it helps vlog and take&nbsp;selfies. You can no longer rotate the camera to play back videos, adjust parameters, or switch between modes. When the camera's orientation shifts from horizontal to vertical, the user interface adapts accordingly. Additionally, the sensitivity of the touchscreens makes them easy to use even with wet hands.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-06.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Voice Interaction With Built-in 3 Microphone</h3><p>When your hands are full, the DJI <strong>Osmo Action 3</strong> is a tremendous help since it can precisely interpret voice directions and help you stay focused on the task at hand. The action camera will announce the current shooting mode audibly when you briefly press the Quick Switch button. Regardless of whether the camera is mounted on a helmet or in another hard-to-see location, you can exactly select the required setting and be certain you'll never miss the moment you want to shoot. You can even add up to five sets of custom parameters to the list of shooting modes.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-07.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Quick Switch to Vertical Shooting</h3><p>The DJI <strong>Osmo Action 3</strong>'s innovative quick-release design enhances impact resistance by combining a powerful magnetic force with an additional positioning clip. As such, it is well-equipped to handle challenging circumstances. It's also easy to disconnect and sufficiently flexible to allow for easy switching of attachments and locations. You can easily switch between shooting your action camera in vertical and horizontal configurations thanks to the protective frame that can be placed either way. Simply take it off, rotate it, and put it back on.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-08.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Reliable in -20° C (-4° F) Low Temperatures</h3><p>You can record continuously for up to 150 minutes at as low as -20° C (-4° F). It's not just frigid weather that the <strong>Osmo Action 3</strong> can handle. Simple playback and parameter tweaks are made possible with the DJI Osmo Action 3 Action Camera's front and rear full-color touchscreens. Additionally, the action camera features a quick-release design that makes attaching it in both a horizontal and vertical posture easy. Thanks to additional developments in waterproofing, cold resistance, and battery life, there has never been a better time to take action.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-09.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>16m Waterproof &amp; Drop Resistant</h3><p>The DJI <strong>Osmo Action 3</strong> action camera's body is fully adjusted to be used at depths of up to 16 meters (52 feet) without the need for additional equipment, enhancing your underwater activities. The lens cover, rear screen, and front screen are all made of high-strength Gorilla Glass. It can endure a 1.5-meter drop and is resistant to wear and scrapes. Hydrophobic coating, which quickly repels water without compromising image quality, is also present in these three areas.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-10.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Align Multi-Camera Footage Quickly</h3><p>During post-production, you may save time and effort by efficiently syncing video from several cameras with your video editing software thanks to <strong>DJI Osmo Action 3</strong>'s timecode technology. Superb audio performance leads to more immersive experiences. To capture sound more accurately and intently, the reception orientation can be adjusted. The DJI&nbsp;Osmo Action 3's hidden microphone at the bottom allows you to record audio in windy or hectic conditions with more assurance. Even wind noise is muted by it. You may use the Osmo Action 3 as a camera for more interactive conversation. For clearer interactions, you can effortlessly switch between many perspectives and utilize the stereo sound, whether you're at a meeting, a class, or just hanging out with friends.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-11.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Connect, Sync, and Edit Videos Easily</h3><p>The LightCut video editor app is a fantastic complement to the DJI <strong>Osmo Action 3</strong>. It can intelligently link premium templates with automatically selected content to produce shareable video edits. LightCut enables a direct connection with DJI Osmo Action 3 for quick and useful footage previews. Let the AI select the best photos you've taken to produce 4K HD videos once you've finished shooting. Select from a variety of amusing designs designed for hectic videos. Fantastic little edits are easily accessible whether you're diving, skiing, or riding a motorcycle.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-12.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h3>Wi-Fi Livestream</h3><p>A range of resolutions and livestreaming providers are supported by the DJI <strong>Osmo Action 3</strong>. Connect in real-time to people all over the world and record your livestream video whenever you like. Utilize the DJI Mimo app to fully utilize your smartphone and maximize the capabilities of Osmo Action 3. It uses AI algorithms and cloud computing to eliminate the need for a selfie stick whether skiing or snowboarding, giving you incredible footage that seems like it was taken by a pro.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-13.webp\" alt=\"DJI Osmo Action 3 Action Camera\" width=\"920\" height=\"450\"><h2>Buy DJI Osmo Action 3 Adventure Combo Action Camera from Star Tech</h2><p>In Bangladesh, you can get original <strong>DJI Osmo Action 3 Adventure Combo Action Camera</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/dji-action-camera\" target=\"\">DJI Action Camera</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The DJI Osmo Action 3 Adventure Combo Action Camera comes with no warranty.</p>","specifications":[{"heading":"Key Features","values":[{"key":"Image Sensor","value":"1/1.7-inch CMOS"},{"key":"Sensor Resolution","value":"4000×3000"},{"key":"Image","value":"JPEG / RAW"},{"key":"Video","value":"MP4 (H.264 / HEVC)"},{"key":"Display","value":"Dual Display"},{"key":"USB Port","value":"1 x USB-C 2.0 Input/Output"},{"key":"Memory","value":"microSD (up to 256 GB)"}]},{"heading":"Battery Information","values":[{"key":"Removable","value":"Yes"},{"key":"Charging Interface","value":"USB Type-C"},{"key":"type","value":"LiPo 1S"},{"key":"Capacity","value":"1770 mAh"},{"key":"Charging Time","value":"1.5 Hours"}]},{"heading":"Special Features","values":[{"key":"Wi-Fi","value":"Wi-Fi Operating Frequency:"},{"key":"Water Resistant","value":"16 m without Waterproof Case, 60 m with Waterproof Case"},{"key":"HDR Mode","value":"4K (16:9): 3840×2160@24/25/30fps"},{"key":"Slow Motion Recording","value":"4K: 4x (120fps)"},{"key":"Others","value":"Zoom:"}]},{"heading":"Warranty Information","values":[{"key":"Manufacturing Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI Osmo Action 3 Adventure Combo Action Camera in Bangladesh?","paragraph":"The latest price of DJI Osmo Action 3 Adventure Combo Action Camera in Bangladesh is 39,000৳. You can buy the DJI Osmo Action 3 Adventure Combo Action Camera at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-standard-combo/osmo-action-3-standard-combo-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-3-adventure-combo/osmo-action-3-standard-combo-500x500.webp"],"product_seo_title":"DJI Osmo Action 3 Adventure Combo Action Camera Price in Bangladesh","product_seo_description":"Buy DJI Osmo Action 3 Adventure Combo Action Camera at best price in Bangladesh. Latest DJI Osmo Action 3 Action Camera available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"DJI Osmo Action 3 Adventure Combo Action Camera"},{"url":"https://www.startech.com.bd/dji-action-2-power-combo-action-camera","img":"https://www.startech.com.bd/image/cache/catalog/camera/action/dji/action-2-power-combo/action-2-power-combo-02-228x228.jpg","title":"DJI Action 2 Power Combo 4K Action Camera","product_list_short_description":["1.76\" touchscreen , Up to DCI 4K60, UHD 4K120, 1080p240","Extends Runtime to 180 Minutes","32GB Internal Camera Storage","1/1.7\" CMOS Sensor, Wide 155Â° FOV"],"price_new":25000,"price_old":38500,"price_single":25000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Action Camera Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Action Camera at the best price in Bangladesh. Latest DJI Osmo Action Camera available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"DJI Action Camera","status":"In Stock","code":"21886","brand":"Dji","product_page_short_description":["Model: Action 2 Power Combo","1.76\" touchscreen , Up to DCI 4K60, UHD 4K120, 1080p240","Extends Runtime to 180 Minutes","32GB Internal Camera Storage","1/1.7\" CMOS Sensor, Wide 155Â° FOV"],"emi_price":3529,"full_description":"<h2 style=\"text-align: justify; \">DJI Action 2 Power Combo 4K Action&nbsp;Camera</h2><p style=\"text-align: justify; \">The DJI Action 2 Power Combo 4K Action&nbsp;Camera is paired with a power module, a magnetic lanyard for hands-free operation, and a magnetic 3-prong mount. The magnetic, snap-on power module boosts your runtime to 180 minutes and includes a microSD card slot for extra media storage. When paired with the separately available DJI Mic, which uses a 3.5mm to USB Type-C input adaptor, the Action 2 can capture wireless audio and record sound via an embedded mic. Grab the DJI Action 2 Power Combo to record up to 180 minutes of your daily life, sports endeavors, or vacation excursions. The Action 2's varied recording choices include 32GB of internal storage, up to DCI 4K60, UHD 4K120, and 1080p240 video, as well as up to 12MP raw and JPEG still photographs, and a unique snap-together, modular magnetic design. While the Action 2 is waterproof to 33', the Power Module requires a separately available case to be watertight. The DJI Action 2 Power Combo 4K Camera has no warranty.</p>","specifications":[{"heading":"Key Features","values":[{"key":"Sensor Resolution","value":"1/1.7” CMOS"},{"key":"Image","value":"JPEG / RAW"},{"key":"Video","value":"MP4 (H.264 / HEVC)"},{"key":"USB Port","value":"1 x USB 2.0 Type-C Input/Output"},{"key":"Memory","value":"Single Slot: microSD/microSDHC/microSDXC (UHS-I) [256 GB Maximum]"}]},{"heading":"Battery Information","values":[{"key":"type","value":"LiPo 1S"},{"key":"Capacity","value":"1300 mAh"},{"key":"Charging Time","value":"Camera Unit + Front Touchscreen Module: 90 minutes"}]},{"heading":"Special Features","values":[{"key":"Water Resistant","value":"10 m without Waterproof Case, 60 m with Waterproof Case"}]},{"heading":"Warranty Information","values":[{"key":"Manufacturing Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI Action 2 Power Combo 4K Action Camera in Bangladesh?","paragraph":"The latest price of DJI Action 2 Power Combo 4K Action Camera in Bangladesh is 25,000৳. You can buy the DJI Action 2 Power Combo 4K Action Camera at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/camera/action/dji/action-2-power-combo/action-2-power-combo-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/action-2-power-combo/action-2-power-combo-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/action-2-power-combo/action-2-power-combo-04-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/action-2-power-combo/action-2-power-combo-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/action-2-power-combo/action-2-power-combo-05-500x500.jpg"],"product_seo_title":"DJI Action 2 Power Combo 4K Action Camera Price in Bangladesh","product_seo_description":"Buy DJI Action 2 Power Combo 4K Action Camera at the best price in Bangladesh. Latest DJI Action Camera available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"DJI Action 2 Power Combo 4K Action Camera"},{"url":"https://www.startech.com.bd/dji-osmo-action-4-adventure-combo-action-camera","img":"https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-4-standard-combo/osmo-action-4-standard-combo-02-228x228.webp","title":"DJI Osmo Action 4 Adventure Combo Action Camera","product_list_short_description":["Sensor: 1/1.3-inch CMOS","Number of Microphones: 3","Max Photo Resolution: 3648×2736","Supported SD Cards: microSD (up to 512 GB)"],"price_new":45000,"price_old":51000,"price_single":45000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Action Camera Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Action Camera at the best price in Bangladesh. Latest DJI Osmo Action Camera available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"DJI Action Camera","status":"In Stock","code":"30338","brand":"Dji","product_page_short_description":["Model: Osmo Action 4","Sensor: 1/1.3-inch CMOS","Number of Microphones: 3","Max Photo Resolution: 3648×2736","Supported SD Cards: microSD (up to 512 GB)"],"emi_price":4583,"full_description":"<h2>DJI Osmo Action 4 Adventure&nbsp;Combo Action Camera</h2><p>The DJI Osmo Action 4 Adventure Combo Action Camera is a strong and versatile action camera that can capture stunning footage and images in any environment. It has a tiny and sturdy design, two touchscreens, three microphones, and an IP68 rating for water and dust resistance. It has a 1/1.3-inch CMOS sensor and a 155° FOV lens with an aperture of f/2.8 that can capture photos up to 36482736 pixels and videos up to 4K (38402160 pixels) at 120 frames per second. There is support for digital zoom, slow motion, hyperlapse, timelapse, and RAW format. DJI Osmo Action 4 Adventure Combo Action Camera technology has progressed. RockSteady 3.0, RockSteady 3.0+, HorizonBalancing, and HorizonSteady are among the stabilization methods used to deliver smooth and stable imagery. It has a 1770 mAh LiPo 1S battery that can last up to 160 minutes at room temperature (25° C/77° F) and 1080p/24fps (16:9) with RockSteady activated, Wi-Fi turned off, and the screen turned off. The acction camera uses Wi-Fi or Bluetooth to connect to your smartphone or tablet and takes microSD cards up to 512 GB in capacity. The DJI Osmo Action 4 Adventure Combo Action Camera also supports eWeb and Ruijie Cloud management, allowing you to build, monitor, and optimize your wireless network from anywhere.</p><h3>Design and Durability</h3><p>The DJI Osmo Action 4 is compact and long-lasting, measuring 70.5444.232.8 mm (LWH) and weighs 145 g. It has two touchscreens, a 1.4-inch front screen and a 2.25-inch rear screen, allowing you to easily frame your photos and adjust the settings. It also has three microphones for clear, crisp audio recording. Without the Waterproof Case, the DJI Osmo Action 4 is waterproof up to 18 meters and up to 60 meters with it. It can also withstand temperatures ranging from -20° to 45° C (-4° to 113° F), making it suitable for a variety of outdoor applications. It has an IP68 rating, indicating that it is dust, water, and corrosion resistant.</p><h3>Camera and Performance</h3><p>The DJI Osmo Action 4 has a 1/1.3-inch CMOS sensor with a lens with a 155° field of view and an aperture of f/2.8. It can capture photos with a resolution of up to 36482736 pixels and videos with a resolution of up to 4K (38402160 pixels) at 120 frames per second. There is support for digital zoom, slow motion, hyperlapse, timelapse, and RAW format. The DJI Osmo Action 4's advanced stabilization technologies provide smooth and stable filming. It includes RockSteady 3.0+, HorizonBalancing, and HorizonSteady modes to reduce camera shake and keep the horizon level in a variety of scenarios. It also has an ISO sensitivity range of 100-12800 and an electronic shutter speed of up to 1/8000 s, which allows you to adjust exposure and capture fast-moving photographs.</p><h3>Battery and Storage</h3><p>The DJI Osmo Action 4 is powered by a LiPo 1S battery with a capacity of 1770 mAh, an energy of 6.8 Wh, and a voltage of 3.85 V. With RockSteady set on, Wi-Fi turned off, and the screen turned off, it can operate for up to 160 minutes at room temperature (25° C/77° F) and 1080p/24fps (16:9). It may be charged with a USB-C cable or a power converter. The DJI Osmo Action 4 has no internal storage but accepts microSD cards with capacities of up to 512 GB. SanDisk Extreme Pro, Kingston Canvas Go!Plus, Kingston Canvas React Plus, or Lexar Pro high-speed microSD cards are recommended.</p><h3>Connection and Management</h3><p>The DJI Osmo Action 4 may connect through Wi-Fi or Bluetooth. It supports 2.4 GHz, 5.1 GHz, and 5.8 GHz Wi-Fi frequencies, as well as the BLE 5.0 Bluetooth protocol. The DJI Mimo app allows you to change camera settings, review footage, edit films, share content, and gain access to new features. The DJI Osmo Action 4 also supports eWeb and Ruijie Cloud management, allowing you to build, monitor, and optimize your wireless network from anywhere.</p><h2>Buy DJI Osmo Action 4 Adventure&nbsp;Combo Action Camera from Star Tech</h2><p>In Bangladesh, you can get original <span style=\"font-weight: bold;\">DJI Osmo Action 4 </span><span style=\"font-weight: 700;\">Adventure </span><span style=\"font-weight: bold;\">Combo Action Camera</span> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/dji-action-camera\" target=\"\">DJI Action Camera</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The DJI Osmo Action 4 Adventure&nbsp;Combo Action Camera comes with no warranty.</p>","specifications":[{"heading":"Key Features","values":[{"key":"Image Sensor","value":"1/1.3-inch CMOS"},{"key":"Sensor Resolution","value":"3648×2736"},{"key":"USB Port","value":"USB-C"},{"key":"Memory","value":"microSD (up to 512 GB)"}]},{"heading":"Battery Information","values":[{"key":"Charging Interface","value":"USB-C"},{"key":"type","value":"LiPo 1S"},{"key":"Capacity","value":"1770 mAh"}]},{"heading":"Special Features","values":[{"key":"Wi-Fi","value":"802.11 a/b/g/n/ac"},{"key":"Water Resistant","value":"IP68 waterproof"},{"key":"Slow Motion Recording","value":"4K: 4× (120fps)"}]},{"heading":"Warranty Information","values":[{"key":"Manufacturing Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI Osmo Action 4 Adventure Combo Action Camera in Bangladesh?","paragraph":"The latest price of DJI Osmo Action 4 Adventure Combo Action Camera in Bangladesh is 45,000৳. You can buy the DJI Osmo Action 4 Adventure Combo Action Camera at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-4-standard-combo/osmo-action-4-standard-combo-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-4-standard-combo/osmo-action-4-standard-combo-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-4-standard-combo/osmo-action-4-standard-combo-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-4-standard-combo/osmo-action-4-standard-combo-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-4-standard-combo/osmo-action-4-standard-combo-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-action-4-adventure-combo/osmo-action-4-adventure-combo-500x500.webp"],"product_seo_title":"DJI Osmo Action 4 Adventure Combo Action Camera Price in Bangladesh","product_seo_description":"Buy DJI Osmo Action 4 Adventure Combo Action Camera at best price in Bangladesh. Order Latest DJI Osmo Action 4 Adventure Combo Action Camera from Star Tech for delivery in BD.","product_seo_keywords":"DJI Osmo Action 4 Adventure Combo Action Camera"},{"url":"https://www.startech.com.bd/dji-pocket-2-creator-combo-3-action-camera","img":"https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-01-228x228.jpg","title":"DJI Osmo Pocket 2 Creator Combo 3 Axis Gimbal Stabilizer Action Camera","product_list_short_description":["Camera with 1/1.7\" 64MP CMOS Sensor","Up to 8x Zoom, 93° Angle of View","Optional Wi-Fi & Bluetooth Monitoring","Time-Lapse, Motion-Lapse, Panorama Modes"],"price_new":40000,"price_old":52000,"price_single":40000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Action Camera Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Action Camera at the best price in Bangladesh. Latest DJI Osmo Action Camera available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"DJI Action Camera","status":"In Stock","code":"21888","brand":"Dji","product_page_short_description":["Model: Pocket 2 Creator Combo","Camera with 1/1.7\" 64MP CMOS Sensor","Up to 8x Zoom, 93° Angle of View","Optional Wi-Fi & Bluetooth Monitoring","Time-Lapse, Motion-Lapse, Panorama Modes"],"emi_price":4442,"full_description":"<h2>DJI Pocket 2 Creator Combo 3 Axis Gimbal Stabilizer Action Camera</h2>\n\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera adds a 1/1.7\" 64MP CMOS sensor, up to 8x zoom, a 93Â° angle of view, and four directional stereo microphones with DJI Matrix Stereo audio zoom to its predecessor, employing its lightweight, ultra-compact 3-axis gimbal stabilizer and 4K camera combo. New software additions include an upgraded ActiveTrack 3.0, built-in glamour effects, an AI editor, Hybrid AF 2.0, and motion-lapse, all without the need for a smartphone app. It includes everything you'll need for a high-resolution mobile production to make family films, add footage to photo sessions or vlog your latest streaming masterpieces with smooth motion video.</p>\n\n<h3>Pocket-Sized and Creator Combo</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera is a pocket-sized and incredibly portable camera that allows you to film unforgettable events on your own. It can steady movement, capture excellent photographs, and record smooth movies. A wide-angle lens, a \"Do-it-All\" handle, a USB Type-A to Type-C splitter, a wireless microphone transmitter, and a mini tripod are all included in the Creator Combo.</p>\n\n<h3>High-Definition Panorama and ActiveTrack 3.0</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera Get a 180Â° panorama of the entire mountain range or a 3x3 panoramic of everyone in a group selfie. With ActiveTrack 3.0, Pocket 2 keeps you and your buddies in the shot no matter how you move.</p>\n\n<h3>Story Mode and Time-Lapse</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera Story mode employs video and audio templates to create thrilling mini-movies in a matter of seconds. Time-lapse photography allows you to compress hours into seconds. Motion-lapse incorporates smooth camera movement. Hyper-lapse photography allows you to journey through time.</p>\n\n<h3>AI Editor and Motorized Stabilization</h3>\nNot interested in editing? AI Editor blends your video with transitions and music to produce shareable content. Glamour effects, an AI editor, and narrative mode software are all included.<p></p>\n\n<h3>Hollywood-Quality Smoothness and Image Quality</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera 3-axis motorized gimbal is what permits this little camera to provide large-screen effects. The Pocket 2 has a 1/1.7\" sensor, can take up to 64MP images, can shoot video at up to 4K60, and has Hybrid AF 2.0.</p>\n\n<h3>HDR Video and 8x Zoom</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera is a 3-in-1 action camera. A good life is full of color, so let it all shine. DJI Pocket 2 uses HDR video to split exposure settings by location and overlay the image so that the film bursts with life-like realism. Looking for attention to detail? The stabilized camera captures excellent 8x zoom stills while capturing 64MP images, up to 4x zoom on 1080p video, and up to 2x zoom on 4K video. It has no warranty.</p>\n","specifications":[{"heading":"Key Features","values":[{"key":"Image Sensor","value":"1/1.7\"-Type CMOS Sensor"},{"key":"Sensor Resolution","value":"Effective: 64 Megapixel"},{"key":"Display","value":"Fixed LCD"},{"key":"USB Port","value":"1 x USB 2.0 Type-C Charging"},{"key":"Memory","value":"Single Slot: microSD/microSDHC/microSDXC"}]},{"heading":"Battery Information","values":[{"key":"Charging Interface","value":"Type-C"},{"key":"type","value":"USB"},{"key":"Charging Time","value":"1.25 Hours"}]},{"heading":"Special Features","values":[{"key":"Wi-Fi","value":"Yes"},{"key":"Tripod/Monopod Mountable","value":"1/4\"-20 Female"},{"key":"HDR Mode","value":"Yes"},{"key":"Slow Motion Recording","value":"240 fps Recorded at 1920 x 1080p"}]},{"heading":"Warranty Information","values":[{"key":"Manufacturing Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI Pocket 2 Creator Combo 3 Action Camera in Bangladesh?","paragraph":"The latest price of DJI Pocket 2 Creator Combo 3 Action Camera in Bangladesh is 40,000৳. You can buy the DJI Pocket 2 Creator Combo 3 Action Camera at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-04-500x500.jpg"],"product_seo_title":"DJI Pocket 2 Creator Combo Action Camera Price in Bangladesh","product_seo_description":"Buy DJI Pocket 2 Creator Combo Action Camera at the best price in Bangladesh. Latest DJI Action Camera is available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"DJI Osmo Pocket 2 Creator Combo 3 Axis Gimbal Stabilizer Action Camera"},{"url":"https://www.startech.com.bd/dji-osmo-pocket-3-creator-combo-action-camera","img":"https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-creator-combo-01-228x228.webp","title":"DJI Osmo Pocket 3 Creator Combo 3 Axis Gimbal Stabilizer Action Camera","product_list_short_description":["Camera Sensor: 1-inch CMOS Sensor","Gimbal: Three-Axis Gimbal Stabilization","Display: 2-inch Rotatable OLED Touchscreen","Microphone: Built-in Three-Microphone Array"],"price_new":76000,"price_old":77000,"price_single":76000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Action Camera Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Action Camera at the best price in Bangladesh. Latest DJI Osmo Action Camera available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"DJI Action Camera","status":"In Stock","code":"36368","brand":"Dji","product_page_short_description":["Model: Osmo Pocket 3 Creator Combo","Camera Sensor: 1-inch CMOS Sensor","Gimbal: Three-Axis Gimbal Stabilization","Display: 2-inch Rotatable OLED Touchscreen","Microphone: Built-in Three-Microphone Array"],"emi_price":6625,"full_description":"<h2>DJI Osmo Pocket 3 Creator Combo 3 Axis Gimbal Stabilizer Action Camera</h2><p>The DJI <strong>Osmo Pocket 3 Creator Combo</strong> is a compact yet powerful <a href=\"https://www.startech.com.bd/camera/action-camera\" target=\"\" style=\"color: rgb(0, 0, 0);\">action camera</a> with a 3-axis gimbal stabilizer for smooth and reliable footage. With a maximum controlled speed of 180.0°/s, an angular vibration range of ±0.005°, and a controllable range of -235° to 58° for pan, -120° to 70° for tilt, and -45° to 45° for roll, the gimbal offers precise and smooth movement. With an f/2.0 aperture and a 20mm format equivalent lens, the <strong>DJI Osmo Pocket 3 Creator Combo</strong> Action Camera's 1-inch CMOS sensor produces amazing image quality. Its wide ISO range (50 to 6400 for photos and up to 16000 for low-light video) is supported. For images, the electronic shutter speed spans from 1/8000 to 1 second, while for films, it corresponds to the maximum frame rate. High-quality photographs may be taken with the DJI Osmo Pocket 3 Creator Combo, up to a maximum size of 3840 x 2160 for 16:9 and 3072 x 3072 for 1:1. It can digitally zoom up to 4 times for 1080p videos, 3 times for 2.7K videos, and 2 times for 4K videos. Several still photography modes, such as single shot, countdown, and panorama, are supported by the action camera. It has settings for slow motion, hyperlapse, timelapse, and motionlapse and can record videos in 4K, 2.7K, 1080p, and 3K resolutions and frame rates. With a 1300 mAh LiPo battery that can be quickly charged and offers up to 166 minutes of operation, the DJI Osmo Pocket 3 Action Camera Combo functions effectively. The DJI Osmo Pocket 3 Creator Combo Action Camera is small, measuring 139.7×42.2×33.5 mm, and weighs only 179 grams. It has a 2.0-inch touchscreen with 700 nits of brightness and 314 x 556 resolution. Wi-Fi, Bluetooth BLE 5.2, and several frequencies and protocols are supported are among the connectivity options. MicroSD cards provide for up to 512 GB of additional storage. Three in-built microphones record audio at 48 kHz in 16-bit AAC format.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-01.webp\" alt=\"DJI Osmo Pocket 3 Creator Combo Action Camera\" width=\"920\" height=\"450\"><h3>1-inch CMOS Pocket Gimbal Camera</h3><p>With its powerful 1-inch CMOS sensor, the brand-new DJI <strong>Osmo Pocket 3 Creator Combo</strong> Action Camera puts detailed, portable imaging at your fingertips. The robust 1-inch CMOS sensor of the Pocket 3 records fine highlight-shadow details. Reliable low-light performance is made possible by its better optical performance, which also allows for a notable improvement in image quality. To capture moments in dynamic, amazingly smooth detail and to amplify each amazing moment in slow motion, shoot in 4K/120 frames per second. The night photos taken with Pocket 3's advanced image quality optimization bring dimly illuminated scenes to live with clarity and true color.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-02.webp\" alt=\"DJI Osmo Pocket 3 Creator Combo Action Camera\" width=\"920\" height=\"450\"><h3>10-Bit D-Log M Color</h3><p>The <strong>DJI Osmo Pocket 3 Creator Combo</strong> Action Camera records landscapes with excellent dynamic range, providing accurate and delicate colors with crisp and vivid details. Its 10-bit D-Log M and 10-bit HLG color modes are required for professional production. Up to one billion colors can be recorded in the 10-bit D-Log M color mode, and every picture is loaded with rich information thanks to the extremely high dynamic range. It provides realistic and delicate color gradations for a full-spectrum visual experience, whether in high-contrast situations like sunrises and sunsets or bright sights like lush gardens. Increased post-production flexibility is provided by this, opening up countless creative options.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-03.webp\" alt=\"DJI Osmo Pocket 3 Creator Combo Action Camera\" width=\"920\" height=\"450\"><h3>Three-Axis Gimbal Stabilization</h3><p>The DJI <strong>Osmo Pocket 3</strong> Creator Combo Action Camera's three-axis mechanical stabilization keeps the view steady even with erratic camera motions. From the incredibly responsive Default level to the Fast level, which can withstand more severe shaking, you can select from various&nbsp;rotating rates. With ActiveTrack 6.0, you can create a fluid, cinematic film with only one hand and enjoy various&nbsp;follow modes, including Face Auto-Detect and Dynamic Framing.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-04.webp\" alt=\"DJI Osmo Pocket 3 Creator Combo Action Camera\" width=\"920\" height=\"450\"><h3>2-Inch Rotatable OLED Touchscreen</h3><p>The DJI <strong>Osmo Pocket 3 Creator Combo</strong> Action Camera offers vivid images and simple control at your fingertips with its 2-inch full-color OLED touchscreen. To begin shooting, rotate; to access parameter adjustments and other operations, merely tap. With Pocket 3's full-pixel fast focusing, you can effortlessly maintain precise focus on even the fastest-moving subjects. Additionally, a new mode called Product Showcase is available, which is ideal for livestreaming and product showing since it puts the attention in the foreground and may focus on a subject swiftly and fluidly.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-05.webp\" alt=\"DJI Osmo Pocket 3 Creator Combo Action Camera\" width=\"920\" height=\"450\"><h3>Capture Surrounds Sound</h3><p>A three-mic array that is integrated into the DJI <strong>Osmo Pocket 3 Creator Combo</strong> Action Camera efficiently reduces wind noise and records omnidirectional stereo sound. It is capable of accurately locating sound sources to provide you with more immersive audio, even in loud settings like concerts. Moreover, it supports USB Audio protocol, which makes it possible to connect external microphones and monitor headphones quickly. The Pocket 3's integrated Wi-Fi and Bluetooth module allows it to connect to two DJI Mic 2 transmitters directly, enabling you to record in incredibly clear quality for vlogs, live streams, interviews, and other purposes.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-06.webp\" alt=\"DJI Osmo Pocket 3 Creator Combo Action Camera\" width=\"920\" height=\"450\"><h3>3x Faster Charging Speed</h3><p>With just 16 minutes to charge to 80%, the <strong>DJI Osmo Pocket 3 Creator Combo</strong> Action Camera can shoot for up to two hours. It can record for up to 116 minutes at 4K/60 frames per second or 166 minutes at 1080p/24 frames per second when completely charged, giving you more time to capture the moments you love. Glamour Effects 2.0 provides further customized beauty choices. Turn it on using the rotatable touchscreen, then download videos using the DJI Mimo app to have it automatically beautified.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-07.webp\" alt=\"DJI Osmo Pocket 3 Creator Combo Action Camera\" width=\"920\" height=\"450\"><h3>Flexible Features, Webcam, Livestream, Timecode</h3><p>The DJI <strong>Osmo Pocket 3 Creator Combo</strong> Action Camera has adaptable capabilities that make it a useful and versatile tool, whether you're livestreaming or using it as a webcam. For more advanced editing scenarios, an integrated timecode function even makes efficient post-production possible. The One-Tap Edit function of the LightCut app makes creating simple and is compatible with wireless connections. It makes it simple to capture any moment with its ability to automatically match your images with premium themes to create outstanding films. Additionally, you don't have to download any footage to use for editing, which frees up space on your smartphone. LightCut immediately creates 4K films that are ready to share by using AI intelligent recognition to pick the best moments from your footage.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-08.webp\" alt=\"DJI Osmo Pocket 3 Creator Combo Action Camera\" width=\"920\" height=\"450\"><h3>Compact and Flexible, Pocket-Sized Design</h3><p>Assuring that you'll always be prepared for the moments worth capturing on camera, the DJI <strong>Osmo Pocket 3 Creator Combo</strong> Action Camera is small and flexible, fitting comfortably in your hand or pocket. To keep your creativity flowing freely, Pocket 3 is brimming with creative modes and features. With just a few presses, it provides a plethora of features such as digital zoom, panorama, motion lapse, and spin shot. Pocket 3's gimbal automatically locks into a storage position when it is turned off, keeping it secure and prepared for your next journey.</p><img src=\"https://www.startech.com.bd/image/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-09.webp\" alt=\"DJI Osmo Pocket 3 Creator Combo Action Camera\" width=\"920\" height=\"450\"><h2>Buy DJI Osmo Pocket 3 Creator Combo 3 Axis Gimbal Stabilizer Action Camera from Star Tech</h2><p>In Bangladesh, you can get original <strong>DJI Osmo Pocket 3 Creator Combo 3 Axis Gimbal Stabilizer Action Camera</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/dji-action-camera\" target=\"\">DJI Action Camera</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The DJI Osmo Pocket 3 Creator Combo 3 Axis Gimbal Stabilizer Action Camera comes with no warranty.</p>","specifications":[{"heading":"Key Features","values":[{"key":"Image Sensor","value":"1\" CMOS Sensor"},{"key":"Image","value":"Single Shot: Approx. 9.4 MP"},{"key":"Video","value":"4K (16:9): 3840×2160@24/25/30/48/50/60fps"},{"key":"Display","value":"Size: 2.0 inches"},{"key":"USB Port","value":"1 x USB 2.0 Type-C Charging"},{"key":"Memory","value":"microSD (up to 512 GB)"}]},{"heading":"Battery Information","values":[{"key":"Charging Interface","value":"Type-C"},{"key":"type","value":"LiPo"},{"key":"Capacity","value":"1300 mAh"},{"key":"Charging Time","value":"16 mins to 80%; 32 mins to 100%"}]},{"heading":"Special Features","values":[{"key":"Wi-Fi","value":"Wi-Fi Operating Frequency"},{"key":"Slow Motion Recording","value":"4K (16:9): 3840×2160@120fps"},{"key":"Others","value":"Lens:"}]},{"heading":"Warranty Information","values":[{"key":"Manufacturing Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI Osmo Pocket 3 Creator Combo Action Camera in Bangladesh?","paragraph":"The latest price of DJI Osmo Pocket 3 Creator Combo Action Camera in Bangladesh is 76,000৳. You can buy the DJI Osmo Pocket 3 Creator Combo Action Camera at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-creator-combo-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-creator-combo-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-creator-combo-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-creator-combo-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-creator-combo-05-500x500.webp","https://www.startech.com.bd/image/cache/catalog/camera/action-camera/dji/osmo-pocket-3-creator-combo/osmo-pocket-3-creator-combo-06-500x500.webp"],"product_seo_title":"DJI Osmo Pocket 3 Creator Combo Action Camera Price in Bangladesh","product_seo_description":"Buy DJI Osmo Pocket 3 Creator Combo Action Camera at best price in Bangladesh. Latest DJI Osmo Pocket 3 Action Camera available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"DJI Osmo Pocket 3 Creator Combo 3 Axis Gimbal Stabilizer Action Camera"}]