[{"url":"https://www.startech.com.bd/panasonic-1-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-01-228x228.webp","title":"Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY)","product_list_short_description":["Technology: Non-Inverter","Cooling Capacity: 12000 BTU","PM 2.5 Filter, Auto Air Swing","100% Copper Condenser"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Panasonic AC Price in Bangladesh | Star Tech","cat_seo_description":"Buy Panasonic AC at best price in Bangladesh. Latest Panasonic Air Conditioner (AC) available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Panasonic AC, Air Conditioners, Air Cooler","status":"Up Coming","code":"34196","brand":"Panasonic","product_page_short_description":["Model: CS-VC12VKY","Technology: Non-Inverter","Cooling Capacity: 12000 BTU","PM 2.5 Filter, Auto Air Swing","100% Copper Condenser"],"emi_price":0,"full_description":"<h2>Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY)</h2><p>The Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY) offers efficient cooling with a 12000 BTU capacity and a durable rotary compressor, all within a non-inverter technology framework. The one-ton cooling capacity of this unit ensures effective temperature control over larger regions. The two-stage filtration technology enhances indoor air quality and fosters a healthier environment by effectively removing pollutants. Longevity and efficient heat transfer are ensured by the unit's all-copper condenser, which prolongs its lifespan. Additionally, this Panasonic AC operates quietly to create the least amount of disturbance, with a 35 dB low interior noise level. Overall, the Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY) is ideal for spaces where comfort and air quality are crucial factors because it provides a powerful and dependable cooling choice with state-of-the-art purifying capabilities. To adjust the level of comfort, use the included remote. You can adjust the settings, set timers, and switch between modes without getting up from your seat. Because of its practical design, the Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY) makes it simple to regulate the internal environment. Larger spaces will benefit greatly from the 12000 BTU cooling capacity and robust rotary compressor of this Panasonic non-inverter AC. Comfort is provided by the compressor warranty, which is backed by Panasonic's commitment to quality. The Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY) increases energy efficiency without compromising functionality when powered by 220V–240V electricity. This air conditioner strikes a balance between cooling power and efficiency. Its solid build is a testament to Panasonic's commitment to quality. This Panasonic AC is assembled in Malaysia and built to withstand frequent use to provide you with dependable, long-lasting cooling comfort. For people who are concerned about the environment, the Panasonic Non-Inverter AC uses R410A refrigerant gas, making it a sustainable choice.</p><h2>Buy Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-ac\" target=\"\" style=\"\">Panasonic AC</a>&nbsp;to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY) comes with 1 Year Service Warranty.</p><p><span style=\"background-color: yellow; color: rgb(0, 0, 0); font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building&nbsp;height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"1 Ton"},{"key":"Capacity of Cooling (BTU)","value":"12000 BTU"},{"key":"Compressor Type","value":"Rotary"},{"key":"Refrigerant Type","value":"R410a"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"220-240v"},{"key":"Power Consumption","value":"1635 W"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor: 87 x 20 x 29 CM"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year Service Warranty"},{"key":"Installation Policy","value":"Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height."}]}],"latest_price":{"heading":"What is the price of Panasonic 1 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of Panasonic 1 Ton Non-Inverter AC in Bangladesh is 58,000৳. You can buy the Panasonic 1 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-03-500x500.webp"],"product_seo_title":"Panasonic 1 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic 1 Ton Non-Inverter AC at best price in Bangladesh. Latest Panasonic 1 Ton Non-Inverter Air Conditioner (CS-VC12VKY) at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic 1 Ton Non-Inverter AC (Split Type CS-VC12VKY)"},{"url":"https://www.startech.com.bd/panasonic-1-5-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-01-228x228.webp","title":"Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-VC18VKY)","product_list_short_description":["Technology: Non-Inverter","Cooling Capacity: 18000 BTU","PM 2.5 Filter, Auto Air Swing","100% Copper Condenser"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Panasonic AC Price in Bangladesh | Star Tech","cat_seo_description":"Buy Panasonic AC at best price in Bangladesh. Latest Panasonic Air Conditioner (AC) available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Panasonic AC, Air Conditioners, Air Cooler","status":"Up Coming","code":"34199","brand":"Panasonic","product_page_short_description":["Model: CS-VC18VKY","Technology: Non-Inverter","Cooling Capacity: 18000 BTU","PM 2.5 Filter, Auto Air Swing","100% Copper Condenser"],"emi_price":0,"full_description":"<h2>Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-VC18VKY)</h2><p>The Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-VC18VKY) provides powerful and efficient cooling for medium to large environments, with a 1.5-ton capacity and 18000 BTU. It has a sophisticated 2-stage purification system with Nanoe-G technology, which efficiently removes hazardous particles to guarantee cleaner and healthier indoor air. With a 100% copper condenser, the unit offers improved longevity and effective heat transfer. Longevity is promised by its Tough AC construction, which guarantees resilience against abrasion. The Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-VC18VKY) has a rotary compressor and non-inverter technology to provide dependable performance and energy economy. It makes for a peaceful and cozy atmosphere with a low indoor noise level of 35 dB. ECONAVI technology adjusts cooling power based on activity levels and room occupancy to maximize energy efficiency. Furthermore, a variety of modes offer personalized comfort and convenience, such as Temperature Wave, Autocomfort, and Quiet Mode. In addition, the Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-VC18VKY) has features like Personal Airflow Creation for individualized comfort, Soft Dry Operation Mode for humidity control, and Powerful Mode for quick cooling. Its user-friendly features, such as the 24-hour dual on/off real setting timer, LCD wireless remote control, and automated operating mode, make it an effective cooling solution for a range of applications.</p><h2>Buy Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-VC18VKY) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-VC18VKY)</strong>&nbsp;From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-ac\" target=\"\" style=\"\">Panasonic AC</a>&nbsp;to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-VC18VKY) comes with 1 Year Service Warranty.</p><p><span style=\"background-color: yellow; color: rgb(0, 0, 0); font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building&nbsp;height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"1.5 Ton"},{"key":"Coverage","value":"180 Square Feet"},{"key":"Capacity of Cooling (BTU)","value":"18000 BTU"},{"key":"Noise Level","value":"Indoor: 48/43 dB"},{"key":"Compressor Type","value":"Rotary"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"220-240v"},{"key":"Power Consumption","value":"1635 W"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor: 107 x 22 x 29 CM"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year Service Warranty"},{"key":"Installation Policy","value":"Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height."}]}],"latest_price":{"heading":"What is the price of Panasonic 1.5 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of Panasonic 1.5 Ton Non-Inverter AC in Bangladesh is 70,000৳. You can buy the Panasonic 1.5 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-03-500x500.webp"],"product_seo_title":"Panasonic 1.5 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic 1.5 Ton Non-Inverter AC at best price in Bangladesh. Latest Panasonic 1.5 Ton Non-Inverter Air Conditioner (CS-VC18VKY) at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-VC18VKY)"},{"url":"https://www.startech.com.bd/panasonic-1-ton-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-s10pkh/cs-s10pkh-01-228x228.webp","title":"Panasonic 1 Ton Inverter AC (Split Type ECONAVI CS-S10PKH)","product_list_short_description":["Technology: Inverter (Up to 65% Energy Saving)","Cooling Capacity: Max. 11200 BTU","Econavi with Intelligent Eco Sensor","Energy Saving Rating: 5 Star"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Panasonic AC Price in Bangladesh | Star Tech","cat_seo_description":"Buy Panasonic AC at best price in Bangladesh. Latest Panasonic Air Conditioner (AC) available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Panasonic AC, Air Conditioners, Air Cooler","status":"Up Coming","code":"34185","brand":"Panasonic","product_page_short_description":["Model: CS-S10PKH","Technology: Inverter (Up to 65% Energy Saving)","Cooling Capacity: Max. 11200 BTU","Econavi with Intelligent Eco Sensor","Energy Saving Rating: 5 Star"],"emi_price":0,"full_description":"<h2>Panasonic 1 Ton Inverter AC (Split Type ECONAVI CS-S10PKH)</h2><p>The Panasonic 1 Ton Inverter AC (Split Type ECONAVI CS-S10PKH) is a smart and efficient cooling solution that prioritizes comfort, energy savings, and air quality. It efficiently eliminates PM2.5 particles from the air thanks to Nanoe-G technology, guaranteeing cleaner indoor air for better living conditions. Up to 65% of energy is saved by the Intelligent Eco Sensors of Econavi technology, which optimize energy use by modifying cooling power based on activity levels and room occupancy. With a Blue Fin condenser that improves performance and longevity, the Panasonic 1 Ton Inverter AC (Split Type ECONAVI CS-S10PKH) guarantees effective cooling even under challenging circumstances. This 1-ton capacity unit is ideal for wall-mounted split installation and can be installed in rooms up to 100 square feet in size, with a maximum height of 10 feet, excluding upper floors. It uses 225–920 watts when running on a single-phase power source and has a cooling capacity of 2,860–11,200 Btu/h. Its efficiency is highlighted by its 5-star energy rating, and its silent mode operation guarantees little disruption. The one-ton Panasonic AC With an EER of 12.6 Btu/hW and a cooling capacity of 9,550 Btu/h, provides strong yet economical cooling performance. In addition, the unit has a 1.6 L/h moisture removal rate and a 10.1 m³/min air circulation rate, which guarantees even and comfortable cooling throughout the space. All things considered, the Panasonic 1-Ton Inverter AC (Split Type ECONAVI CS-S10PKH) offers cutting-edge technologies together with intelligent, environmentally responsible, and dependable cooling performance to satisfy contemporary comfort demands.</p><h2>Buy Panasonic 1 Ton Inverter AC (Split Type ECONAVI CS-S10PKH) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic 1 Ton Inverter AC (Split Type ECONAVI CS-S10PKH)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-ac\" target=\"\" style=\"\">Panasonic AC</a>&nbsp;to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic 1 Ton Inverter AC (Split Type ECONAVI CS-S10PKH) comes with 1 Year Service Warranty.</p><p><span style=\"background-color: yellow; color: rgb(0, 0, 0); font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building&nbsp;height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Inverter"},{"key":"Capacity","value":"1 Ton"},{"key":"Coverage","value":"Appropriate for 100 SqFt Room, Height: 10 feet (Except Top Floor)"},{"key":"Capacity of Cooling (BTU)","value":"11200 BTU"},{"key":"Refrigerant Type","value":"R410a"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"1P/220-920V/50Hz"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Height 11-7/16 (20-1/8) inch"},{"key":"Weight","value":"9kg"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01 Year Service Warranty"},{"key":"Installation Policy","value":"Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height."}]}],"latest_price":{"heading":"What is the price of Panasonic 1 Ton Inverter AC in Bangladesh?","paragraph":"The latest price of Panasonic 1 Ton Inverter AC in Bangladesh is 78,000৳. You can buy the Panasonic 1 Ton Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-s10pkh/cs-s10pkh-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-s10pkh/cs-s10pkh-02-500x500.webp"],"product_seo_title":"Panasonic 1 Ton Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic 1 Ton Inverter AC at best price in Bangladesh. Latest Panasonic 1 Ton Inverter Air Conditioner (CS-S10PKH) at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Panasonic 1 Ton Inverter AC (Split Type ECONAVI CS-S10PKH)"},{"url":"https://www.startech.com.bd/panasonic-2-ton-non-inverter-ac-cs-rv24wky","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-s10pkh/cs-s10pkh-01-228x228.webp","title":"Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY)","product_list_short_description":["Technology: Non-Inverter","Cooling Capacity: 24000 BTU","Econavi with Nanoe-G system","Anti-bacteria Filter, Dust Filter"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Panasonic AC Price in Bangladesh | Star Tech","cat_seo_description":"Buy Panasonic AC at best price in Bangladesh. Latest Panasonic Air Conditioner (AC) available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Panasonic AC, Air Conditioners, Air Cooler","status":"Up Coming","code":"34189","brand":"Panasonic","product_page_short_description":["Model: CS-RV24WKY","Technology: Non-Inverter","Cooling Capacity: 24000 BTU","Econavi with Nanoe-G system","Anti-bacteria Filter, Dust Filter"],"emi_price":0,"full_description":"<h2>Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY)</h2><p>The Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY) has a powerful cooling capability of 2.0 tons or 24000 BTU, which is driven by a dependable rotary compressor. Its non-inverter technology guarantees reliability, and its Eco-Tough Rust Resistant Casing adds to sturdy construction. With its Econavi incorporating Nanoe-G system, the Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY) maximizes energy economy by automatically adjusting cooling based on room occupancy and sunshine intensity. A PM 2.5 filter and in-filter deactivation guarantee the removal of bacteria, smoke, dust, and smells, resulting in better and more hygienic indoor air quality. It guarantees long-term dependability and effective heat transfer with its 100% copper condenser and blue fin technology. While the I Auto mode and Auto Comfort feature easily provide the ideal level of comfort, the Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY) with Turbo Mode offers quick cooling when needed. Furthermore, cooling is adjusted by the sunshine sensor based on ambient light levels. This Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY) provides a complete cooling solution that prioritizes energy efficiency and air quality purification. It has two-way airflow and promises to save up to 38% of energy.</p><h2>Buy Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY)</strong>&nbsp;From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-ac\" target=\"\" style=\"\">Panasonic AC</a>&nbsp;to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY) comes with 01 Year Service Warranty.</p><p><span style=\"background-color: yellow; color: rgb(0, 0, 0); font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building&nbsp;height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"2 Ton"},{"key":"Capacity of Cooling (BTU)","value":"24000 BTU"},{"key":"Noise Level","value":"49/44 dB"},{"key":"Compressor Type","value":"Rotary"},{"key":"Refrigerant Type","value":"R410a"},{"key":"Others","value":"Econavi with Nanoe-G system"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"220-240v"},{"key":"Power Consumption","value":"1000 – 2000 W"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor: 100*23*29.5 CM"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year Service Warranty"},{"key":"Installation Policy","value":"Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height."}]}],"latest_price":{"heading":"What is the price of Panasonic 2 Ton Non-Inverter AC (CS-RV24WKY) in Bangladesh?","paragraph":"The latest price of Panasonic 2 Ton Non-Inverter AC (CS-RV24WKY) in Bangladesh is 82,000৳. You can buy the Panasonic 2 Ton Non-Inverter AC (CS-RV24WKY) at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-s10pkh/cs-s10pkh-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-s10pkh/cs-s10pkh-02-500x500.webp"],"product_seo_title":"Panasonic 2 Ton Non-Inverter AC (CS-RV24WKY) Price in Bangladesh","product_seo_description":"Buy Panasonic 2 Ton Non-Inverter AC (CS-RV24WKY) at best price in Bangladesh. Latest Panasonic 2 Ton Non-Inverter Air Conditioner at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic 2 Ton Non-Inverter AC (Split Type ECONAVI CS-RV24WKY)"},{"url":"https://www.startech.com.bd/panasonic-2-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-01-228x228.webp","title":"Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY)","product_list_short_description":["Technology: Non-Inverter","Cooling Capacity: 24000 BTU","2 Stage Purification","100% Copper Condenser"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Panasonic AC Price in Bangladesh | Star Tech","cat_seo_description":"Buy Panasonic AC at best price in Bangladesh. Latest Panasonic Air Conditioner (AC) available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Panasonic AC, Air Conditioners, Air Cooler","status":"Up Coming","code":"34191","brand":"Panasonic","product_page_short_description":["Model: CS-VC24VKY","Technology: Non-Inverter","Cooling Capacity: 24000 BTU","2 Stage Purification","100% Copper Condenser"],"emi_price":0,"full_description":"<h2>Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY)</h2><p>The Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY) provides efficient cooling with a 24000 BTU cooling capacity and a dependable rotary compressor, all within a non-inverter technology framework. This unit's 2.0-ton cooling capacity guarantees efficient temperature control for bigger areas. By efficiently eliminating contaminants, the two-stage filtration system improves indoor air quality and creates a healthier atmosphere. The condenser made entirely of copper guarantees longevity and effective heat transfer, adding to the unit's overall lifespan. Furthermore, with a 35 dB low indoor noise level, this Panasonic AC runs silently to cause the least amount of disruption. All things considered, the Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY) offers a strong and dependable cooling option with cutting-edge purification capabilities, making it perfect for areas where comfort and air quality are important considerations. Use the provided remote to customize your level of comfort. Without getting up from your seat, change the settings, set timers, and transition between modes. With the Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY), you can easily control the indoor climate thanks to its convenient design. With a dependable rotary compressor and a 24000 BTU cooling capacity, this non-inverter AC from Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY) is ideal for bigger areas. The compressor warranty, which is supported by Panasonic's dedication to quality, offers comfort. Using 220V–240V electricity, the AC maximizes energy efficiency without sacrificing functionality. This Panasonic 2 Ton AC balances efficiency and cooling power with a 1635W power consumption. Panasonic's dedication to excellence is evident in its sturdy construction. This AC is made to endure regular use and is assembled in Malaysia to give you dependable, long-lasting cooling comfort. With R410A refrigerant gas, the Panasonic Non-Inverter AC is an environmentally responsible option for those who care about the environment. Panasonic makes sure that you benefit from effective cooling while also doing your part to protect the environment.</p><h2>Buy Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-ac\" target=\"\" style=\"\">Panasonic AC</a>&nbsp;to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY) comes with 1 Year Service Warranty.</p><p><span style=\"background-color: yellow; color: rgb(0, 0, 0); font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building&nbsp;height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"2 Ton"},{"key":"Capacity of Cooling (BTU)","value":"24000 BTU"},{"key":"Noise Level","value":"35 dB"},{"key":"Compressor Type","value":"Rotary"},{"key":"Refrigerant Type","value":"R410a"},{"key":"Others","value":"2 Stage Purification"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"220-240v"},{"key":"Power Consumption","value":"1635 W"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor: 107 x 22 x 29 CM"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year Service Warranty"},{"key":"Installation Policy","value":"Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height."}]}],"latest_price":{"heading":"What is the price of Panasonic 2 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of Panasonic 2 Ton Non-Inverter AC in Bangladesh is 82,000৳. You can buy the Panasonic 2 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-vc24vky/cs-vc24vky-03-500x500.webp"],"product_seo_title":"Panasonic 2 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic 2 Ton Non-Inverter AC at best price in Bangladesh. Latest Panasonic 2 Ton Non-Inverter Air Conditioner (CS-VC24VKY) at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic 2 Ton Non-Inverter AC (Split Type CS-VC24VKY)"},{"url":"https://www.startech.com.bd/panasonic-1-5-ton-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-ks24vky-81/cs-ks24vky-228x228.webp","title":"Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY)","product_list_short_description":["Technology: Twin Cool Inverter","Cooling Capacity: 18000 BTU","Compressor Type: Rotary","Display: Hidden LED Display"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Panasonic AC Price in Bangladesh | Star Tech","cat_seo_description":"Buy Panasonic AC at best price in Bangladesh. Latest Panasonic Air Conditioner (AC) available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Panasonic AC, Air Conditioners, Air Cooler","status":"Up Coming","code":"34184","brand":"Panasonic","product_page_short_description":["Model: CS-KS18VKY","Technology: Twin Cool Inverter","Cooling Capacity: 18000 BTU","Compressor Type: Rotary","Display: Hidden LED Display"],"emi_price":0,"full_description":"<h2>Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY)</h2><p>The Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY) is designed to provide efficient cooling while focusing on energy savings. It guarantees optimal performance while reducing energy usage by up to 50% thanks to Twin Cool Inverter technology. It efficiently eliminates tiny particles from the air and promotes better indoor air quality because it is outfitted with a PM 2.5 filter. Convenience and dependability are increased by the stabilizer-free operation, and uniform cooling is facilitated by the Air Arc Design's even airflow distribution. This Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY) uses eco-friendly R410a gas and has an 18000 BTU cooling capacity. It is powered by a rotary compressor that is dependable. Comfort is enhanced by the quiet operation of the Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY), which has an indoor noise level as low as 48dB in standard mode and 43dB in silent mode. When necessary, the Turbo Mode quickly cools an area, and additional energy-saving technologies like Econavi and Nanoeg help. It can supply electricity between 220-240V at 50Hz and 1800W, with the power usage varying based on cooling requirements. For thorough air purification and comfort, it also includes many features like a dust filter, dehumidification function, and an anti-bacterial filter. All things considered, the Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY) provides effective, environmentally friendly cooling together with cutting-edge features and technology that improve home comfort and air quality.</p><h2>Buy Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY)</strong>&nbsp;From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-ac\" target=\"\" style=\"\">Panasonic AC</a>&nbsp;to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY) comes with 1 Year Service Warranty. </p><p><span style=\"background-color: yellow; color: rgb(0, 0, 0); font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building&nbsp;height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Twin Cool Inverter"},{"key":"Capacity","value":"1.5 Ton"},{"key":"Capacity of Cooling (BTU)","value":"18000 BTU"},{"key":"Noise Level","value":"Indoor: 48dB -53dB (A)"},{"key":"Compressor Type","value":"Rotary"},{"key":"Refrigerant Type","value":"R410a"},{"key":"Others","value":"50% Savings on Inverter"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"1P/220-240V/50Hz"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor: 290x1070x235 mm"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01 Year Service Warranty"},{"key":"Installation Policy","value":"Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height."}]}],"latest_price":{"heading":"What is the price of Panasonic 1.5 Ton Inverter AC in Bangladesh?","paragraph":"The latest price of Panasonic 1.5 Ton Inverter AC in Bangladesh is 98,000৳. You can buy the Panasonic 1.5 Ton Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-ks24vky-81/cs-ks24vky-500x500.webp"],"product_seo_title":"Panasonic 1.5 Ton Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic 1.5 Ton Inverter AC at best price in Bangladesh. Latest Panasonic 1.5 Ton Inverter Air Conditioner (CS-KS18VKY) at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic 1.5 Ton Inverter AC (Split Type CS-KS18VKY)"},{"url":"https://www.startech.com.bd/panasonic-2-ton-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-ks24vky-81/cs-ks24vky-228x228.webp","title":"Panasonic 2 Ton Inverter AC (Split Type CS-KS24VKY-81)","product_list_short_description":["Type: Split, Technology: Inverter","Cooling Capacity: 24000 BTU","Compressor Type: Rotary","Display: Hidden LED Display"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Panasonic AC Price in Bangladesh | Star Tech","cat_seo_description":"Buy Panasonic AC at best price in Bangladesh. Latest Panasonic Air Conditioner (AC) available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Panasonic AC, Air Conditioners, Air Cooler","status":"Up Coming","code":"34183","brand":"Panasonic","product_page_short_description":["Model: CS-KS24VKY-81","Type: Split, Technology: Inverter","Cooling Capacity: 24000 BTU","Compressor Type: Rotary","Display: Hidden LED Display"],"emi_price":0,"full_description":"<h2>Panasonic 2 Ton Inverter AC (Split Type CS-KS24VKY-81)</h2><p>The Panasonic 2 Ton Inverter AC (Split Type CS-KS24VKY-81) uses inverter technology to provide effective cooling while guaranteeing up to 50% energy savings. Its PM 2.5 filter helps to remove tiny particles from the air, making the quality of the air indoors healthier and cleaner. Airflow is maximized for uniform cooling across the space by the air arc design, which also improves convenience and dependability in stabilizer-free operation. This Panasonic 2 Ton Inverter AC (Split Type CS-KS24VKY-81) uses eco-friendly R410a gas and has a 24000 BTU cooling capacity. Its rotary compressor runs the unit efficiently. Its concealed LED display gives the style a contemporary twist while keeping it elegant. Operating on a power supply of 1P/220-240V/50Hz, with a power input of 1950W and a current of 8.9A, it balances powerful cooling with energy efficiency. The indoor noise levels range between 50dB and 55dB(A), ensuring a quiet operation, while the outdoor unit operates at 60 dB-65 dB (A). With an auto air swing feature, it distributes cool air evenly across the room for maximum comfort. Overall, the Panasonic 2 Ton Inverter AC (Split Type CS-KS24VKY-81) delivers reliable, energy-efficient cooling with advanced features designed to enhance indoor comfort and air quality.</p><h2>Buy Panasonic 2 Ton Inverter AC (Split Type CS-KS24VKY-81) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic 2 Ton Inverter AC (Split Type CS-KS24VKY-81)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-ac\" target=\"\" style=\"\">Panasonic AC</a>&nbsp;to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic 2 Ton Inverter AC (Split Type CS-KS24VKY-81) comes with 1 Year Service Warranty.</p><p><span style=\"color: rgb(0, 0, 0); background-color: yellow; font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building&nbsp;height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Twin Cool Inverter"},{"key":"Capacity","value":"2 Ton"},{"key":"Capacity of Cooling (BTU)","value":"24000 BTU"},{"key":"Noise Level","value":"Indoor:50dB -55dB(A)"},{"key":"Compressor Type","value":"Rotary"},{"key":"Refrigerant Type","value":"R410a"},{"key":"Others","value":"50% Savings on Inverter"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"1P/220-240V/50Hz"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor:290x1070x235 mm"},{"key":"Weight","value":"Indoor: 12 kg"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1-Year Service Warranty"},{"key":"Installation Policy","value":"Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height."}]}],"latest_price":{"heading":"What is the price of Panasonic 2 Ton Inverter AC in Bangladesh?","paragraph":"The latest price of Panasonic 2 Ton Inverter AC in Bangladesh is 105,000৳. You can buy the Panasonic 2 Ton Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-ks24vky-81/cs-ks24vky-500x500.webp"],"product_seo_title":"Panasonic 2 Ton Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic 2 Ton Inverter AC at best price in Bangladesh. Latest Panasonic 2 Ton Inverter Air Conditioner (CS-KS24VKY-81) at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic 2 Ton Inverter AC (Split Type CS-KS24VKY-81)"},{"url":"https://www.startech.com.bd/panasonic-1-5-ton-non-inverter-ac-cs-rv18wky","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-rv18wky/cs-rv18wky-01-228x228.webp","title":"Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-RV18WKY)","product_list_short_description":["Technology: Non-Inverter","Cooling Capacity: 18000 BTU","Econavi with Nanoe-G system","Purifies: Dust, Bacteria, Smoke, and Smell"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Panasonic AC Price in Bangladesh | Star Tech","cat_seo_description":"Buy Panasonic AC at best price in Bangladesh. Latest Panasonic Air Conditioner (AC) available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Panasonic AC, Air Conditioners, Air Cooler","status":"Out Of Stock","code":"34193","brand":"Panasonic","product_page_short_description":["Model: CS-RV18WKY","Technology: Non-Inverter","Cooling Capacity: 18000 BTU","Econavi with Nanoe-G system","Purifies: Dust, Bacteria, Smoke, and Smell"],"emi_price":0,"full_description":"<h2>Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-RV18WKY)</h2><p>The Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-RV18WKY) provides complete cooling and purification for areas up to 195 square feet. Econavi's Nanoe-G system optimizes energy efficiency by adjusting cooling based on occupancy and sunshine intensity. The 100% Copper Condenser and Blue Fin technology of the Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-RV18WKY) contribute to effective heat transfer and long-term dependability, while the Eco-Tough Rust rust-resistant casing guarantees durability. Targeting dust, germs, smoke, and smells, the addition of a PM 2.5 filter and in-filter deactivation guarantees complete purification, supporting better indoor air quality. This 1.5-ton split AC from Panasonic puts comfort and energy economy first with 2-way airflow and a guarantee of up to 38% energy savings. The Auto Comfort feature and I Auto mode automatically modify settings for maximum comfort, significantly improving user convenience. Furthermore, the sunlight sensor customizes the cooling based on the amount of light present in the surrounding area. For smaller places looking for effective cooling and clean air, the Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-RV18WKY) is a good option because of its many energy-saving features and purifying capabilities.</p><h2>Buy Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-RV18WKY) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-RV18WKY)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-ac\" target=\"\" style=\"\">Panasonic AC</a>&nbsp;to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-RV18WKY) comes with 1 Year Service Warranty.</p><p><span style=\"background-color: yellow; color: rgb(0, 0, 0); font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building&nbsp;height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"1.5 Ton"},{"key":"Coverage","value":"Appropriate 195 SqFt Room"},{"key":"Capacity of Cooling (BTU)","value":"18000 BTU"},{"key":"Noise Level","value":"48/43 dB"},{"key":"Compressor Type","value":"Rotary"},{"key":"Refrigerant Type","value":"R410a"},{"key":"Others","value":"Econavi with Nanoe-G system"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"220-240v"},{"key":"Power Consumption","value":"1000 - 2000 W"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor: 100*23*29.5 CM"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year Service Warranty"},{"key":"Installation Policy","value":"Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height."}]}],"latest_price":{"heading":"What is the price of Panasonic 1.5 Ton Non-Inverter AC (CS-RV18WKY) in Bangladesh?","paragraph":"The latest price of Panasonic 1.5 Ton Non-Inverter AC (CS-RV18WKY) in Bangladesh is 72,000৳. You can buy the Panasonic 1.5 Ton Non-Inverter AC (CS-RV18WKY) at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-rv18wky/cs-rv18wky-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-rv18wky/cs-rv18wky-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/panasonic/cs-rv18wky/cs-rv18wky-03-500x500.webp"],"product_seo_title":"Panasonic 1.5 Ton Non-Inverter AC (CS-RV18WKY) Price in Bangladesh","product_seo_description":"Buy Panasonic 1.5 Ton Non-Inverter AC (CS-RV18WKY) at best price in Bangladesh. Latest Panasonic 1.5 Ton Non-Inverter Air Conditioner at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic 1.5 Ton Non-Inverter AC (Split Type CS-RV18WKY)"}]