[{"url":"https://www.startech.com.bd/apple-mac-pro-m2-ultra-tower-desktop-pc","img":"https://www.startech.com.bd/image/cache/catalog/desktop-pc/mac-pro/mac-pro-tower-01-228x228.webp","title":"Apple Mac Pro M2 Ultra Tower Desktop PC","product_list_short_description":["Proccessor: Apple M2 Ultra 24-Core CPU, 76-Core GPU","RAM: 64GB, Storage: 1TB SSD","Support for up to eight displays","Magic Keyboard with Touch ID & Keypad, Magic Mouse"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Apple Mac Pro Price in Bangladesh | Star Tech","cat_seo_description":"Buy Apple Mac Pro at the best price in Bangladesh. Latest Apple Mac Pro Tower and Rack Desktop PC available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Apple Mac Pro","status":"Up Coming","code":"28922","brand":"Apple","product_page_short_description":["Model: Mac Pro","Proccessor: Apple M2 Ultra 24-Core CPU, 76-Core GPU","RAM: 64GB, Storage: 1TB SSD","Support for up to eight displays","Magic Keyboard with Touch ID & Keypad, Magic Mouse"],"emi_price":0,"full_description":"<h2 style=\"\">Apple Mac Pro M2 Ultra Tower Desktop PC</h2><p style=\"\">The Apple Mac Pro is equipped with the M2 Ultra 24-Core CPU, which enables creative professionals to tackle the most demanding workflows with speed and efficiency. The Mac Pro has the performance of seven Afterburner cards built-in, thanks to a 76-Core GPU and 64GB of unified RAM with 800 GB/s memory bandwidth. The M2 Ultra's media engine can handle up to 22 streams of 8K ProRes video. The 1TB SSD enables quick boot and load times. With six PCIe Gen 4.0 slots, the Mac Pro can be easily upgraded. There are two PCIe Gen 4.0 x16 and four PCIe Gen 4.0 x8 slots. The Apple I/O card also occupies a half-length PCIe Gen 3.0 x4 slot. Speaking of I/O, the Mac Pro has eight Thunderbolt 4 ports, each with 40 Gb/s data throughput and DisplayPort support. Connect to the internet via the dual 10 Gigabit Ethernet LAN jacks or go wireless with Wi-Fi 6E (802.11ax). Bluetooth 5.3 enables you to connect compatible devices wirelessly. The Mac Pro includes the Magic Keyboard with Touch ID and Numeric Keypad, as well as the Magic Mouse. To begin, all you need is a display. You also don't have to limit yourself to one screen because the Mac Pro can support up to eight 4K 60 Hz displays, six 6K 60 Hz displays, or three 8K 60 Hz displays.</p><h3 style=\"\">Apple M2 Ultra Chip</h3><p style=\"\">The M2 Ultra is a powerful chip created by Apple, using their UltraFusion technology. It combines two M2 Max dies through a silicon interposer, providing high interprocessor bandwidth. The M2 Ultra's 24-Core CPU consists of 16 performance cores and 8 high-efficiency cores, delivering 20% faster performance than the M1 Ultra. With a 76-core GPU, 64GB of RAM, and industry-leading media engine, it offers exceptional performance and can handle up to 22 streams of 8K ProRes video playback. Its unified design eliminates the need for code rewriting to utilize its extreme performance.</p><h3 style=\"\">Expansion</h3><p style=\"\">The Mac Pro combines Apple silicon performance with PCI expansion capability. It offers six PCIe Gen 4.0 slots, providing enhanced bandwidth for audio, video I/O, networking, and storage cards. The configuration includes two double-height PCIe Gen 4.0 x16 slots, two single-height PCIe 4.0 x8 slots, and two double-height PCIe 4.0 x8 slots. Additionally, there is a half-length PCIe 3.0 x4 slot occupied by the Apple I/O card.<br></p><h3 style=\"\">Stacked with high-performance I/O</h3><p style=\"\">The Mac Pro offers extensive connectivity options, including eight Thunderbolt 4 ports with high-speed data transfer and DisplayPort support. It has two HDMI ports for 8K resolutions and 240 Hz refresh rates. Legacy USB devices can be connected through two USB-A ports, and headphone support is available with the 3.5 mm audio jack. The wireless connectivity features Wi-Fi 6E (802.11ax) and Bluetooth 5.3. Additionally, there are dual 10 Gigabit Ethernet LAN jacks for a reliable wired connection.</p><h2>Buy Apple Mac Pro M2 Ultra Tower Desktop PC from the best Apple Shop in Bangladesh: Star Tech</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/apple-mac-pro-m2-ultra-tower-desktop-pc\" target=\"\">Apple Mac Pro M2 Ultra Tower Desktop PC</a> From Star Tech. We have a large collection of latest Apple Mac Pro to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Apple Mac Pro M2 Ultra Tower Desktop PC comes with 1 year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"Apple M2 Ultra chip"},{"key":"RAM","value":"64GB unified memory"},{"key":"Graphics Card","value":"76-core GPU"},{"key":"Storage","value":"1TB SSD"},{"key":"Monitor","value":"Simultaneous support for up to eight displays:"},{"key":"Casing","value":"Mac Pro tower enclosure with feet; configurable to tower with wheels"},{"key":"Audio","value":"Built-in speaker"},{"key":"Power Supply","value":"Line voltage: 100–125V AC at 12A; 220–240V AC at 6A"},{"key":"Network & Wireless Connectivity","value":"Wi-Fi 6E (802.11ax)2"},{"key":"Operating System","value":"macOS"}]},{"heading":"Input Devices","values":[{"key":"Keyboard","value":"Magic Keyboard with Touch ID and Numeric Keypad"},{"key":"Mouse","value":"Magic Mouse"},{"key":"Optical Drive","value":"Six full-length PCI Express gen 4 slots"},{"key":"External I/O Ports","value":"Eight Thunderbolt 4 (USB-C) ports"}]},{"heading":"Physical Details","values":[{"key":"Dimension","value":"Height: 20.8 inches (52.9 cm)"},{"key":"Weight","value":"37.2 pounds (16.86 kg)"},{"key":"Color","value":"Silver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 year"}]}],"latest_price":{"heading":"What is the price of Apple Mac Pro M2 Ultra Tower Desktop PC in Bangladesh?","paragraph":"The latest price of Apple Mac Pro M2 Ultra Tower Desktop PC in Bangladesh is 0৳. You can buy the Apple Mac Pro M2 Ultra Tower Desktop PC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/desktop-pc/mac-pro/mac-pro-tower-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/desktop-pc/mac-pro/mac-pro-tower-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/desktop-pc/mac-pro/mac-pro-tower-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/desktop-pc/mac-pro/mac-pro-tower-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/desktop-pc/mac-pro/mac-pro-tower-05-500x500.webp"],"product_seo_title":"Apple Mac Pro M2 Ultra Tower Desktop PC Price in Bangladesh","product_seo_description":"Buy Apple Mac Pro M2 Ultra Tower Desktop PC at best price in BD. Latest Apple Mac Pro M2 Ultra Tower Desktop PC available at Star Tech Shop. Order online for delivery in BD.","product_seo_keywords":"Apple Mac Pro M2 Ultra Tower Desktop PC"}]