[{"url":"https://www.startech.com.bd/mibro-z3-kids-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-z3/z3-blue-01-228x228.webp","title":"Mibro Z3 Kids Smart Watch","product_list_short_description":["1.3-inch IPS Display","2 Megapixel Dual-Camera","9 Geolocation Modes","IPX8 Waterproof"],"price_new":8950,"price_old":9499,"price_single":8950,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"In Stock","code":"28870","brand":"Mibro","product_page_short_description":["MPN: XPSWZ001","Model: Z3","1.3-inch IPS Display","2 Megapixel Dual-Camera","9 Geolocation Modes","IPX8 Waterproof"],"emi_price":817,"full_description":"<h2>Mibro Z3 Kids Smart Watch</h2><p>The Mibro Z3 Kids Smart Watch is designed to keep children connected and safe. It boasts a durable and vibrant display that is resistant to shocks, scratches, and falls, ensuring excellent visibility even under sunlight. With its 1000 mAh battery, the watch offers an impressive battery life of up to 8 days in active mode and up to 13 days in standby mode. The watch supports mobile communication and Wi-Fi connectivity, allowing voice and video calls as well as chat functions. Parents can take advantage of the parental control features, such as setting safe zones and receiving instant notifications if their child goes beyond the boundaries. The watch is waterproof, enabling swimming at depths of up to two meters, and it features IPX8 protection to safeguard against moisture. The Mibro Z3 watch offers a wide range of functionality, including setting up a class schedule, monitoring sports activities, accessing the side camera to see what the child is doing, engaging in chats, and activating the search mode.</p><h2>Buy Mibro Z3 Kids Smart Watch from the best Smartwatch Shop in Bangladesh: Star Tech</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/mibro-z3-kids-smart-watch\" target=\"\">Mibro Z3 Kids Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/mibro-smart-watch\" target=\"\">Mibro Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Mibro Z3 Kids Smart Watch comes with 6-month Service Warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.3-inch"},{"key":"Battery","value":"1000mAH Lithium battery"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"SpecialFeatures","value":"IPX8 Waterproof"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Blue"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"6-month Service Warranty"}]}],"latest_price":{"heading":"What is the price of Mibro Z3 Kids Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro Z3 Kids Smart Watch in Bangladesh is 8,950৳. You can buy the Mibro Z3 Kids Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-z3/z3-blue-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-z3/z3-pink-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-z3/z3-pink-02-500x500.webp"],"product_seo_title":"Mibro Z3 Kids Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro Z3 Kids Smart Watch at the best price in Bangladesh. Latest Mibro Z3 Kids Smart Watch available at Star Tech online shop. Order online for delivery anywhere in BD.","product_seo_keywords":"Mibro Z3 Kids Smart Watch"},{"url":"https://www.startech.com.bd/mibro-p5-kids-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-p5/mibro-p5-blue-01-228x228.webp","title":"Mibro P5 Kids Smart Watch","product_list_short_description":["1.3-inch IPS Display","2 Megapixel Dual-Camera","9 Geolocation Modes","IPX8 Waterproof"],"price_new":8700,"price_old":8990,"price_single":8700,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"In Stock","code":"28872","brand":"Mibro","product_page_short_description":["MPN: XPSWP003","Model: P5","1.3-inch IPS Display","2 Megapixel Dual-Camera","9 Geolocation Modes","IPX8 Waterproof"],"emi_price":775,"full_description":"<h2>Mibro P5 Kids Smart Watch</h2><p>The Mibro P5 Kids Smart Watch is a reliable and feature-packed wearable device designed to keep children connected and safe. It features a shock-resistant display with vibrant colors, ensuring excellent visibility even in bright sunlight, and it is designed to withstand scratches and falls. With its built-in 900 mAh battery, the watch offers a remarkable battery life of up to 7 days in active mode and up to 11 days in standby mode. The watch supports mobile communication and Wi-Fi connectivity, enabling voice and video calls as well as chat functions. Parents can utilize parental control features, such as setting safe zones and receiving instant notifications when their child goes beyond the defined boundaries. The watch is waterproof and equipped with IPX8 protection, making it resistant to water and moisture. The Mibro P5 watch offers a wide range of functionality, including setting up a class schedule, monitoring sports activities, accessing the side camera to see what the child is doing, engaging in chats, and activating the search mode.</p><h2>Buy Mibro P5 Kids Smart Watch from the best Smartwatch Shop in Bangladesh: Star Tech</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/mibro-p5-kids-smart-watch\" target=\"\">Mibro P5 Kids Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/mibro-smart-watch\" target=\"\">Mibro Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Mibro P5 Kids Smart Watch comes with 6 months Service Warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.3-inch"},{"key":"Battery","value":"900mAH Lithium battery"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"SpecialFeatures","value":"IPX8 Waterproof"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Blue"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"6 Months Service Warranty"}]}],"latest_price":{"heading":"What is the price of Mibro P5 Kids Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro P5 Kids Smart Watch in Bangladesh is 8,700৳. You can buy the Mibro P5 Kids Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-p5/mibro-p5-blue-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-p5/mibro-p5-blue-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-p5/mibro-p5-blue-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-p5/mibro-p5-pink-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-p5/mibro-p5-pink-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-p5/mibro-p5-pink-03-500x500.webp"],"product_seo_title":"Mibro P5 Kids Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro P5 Kids Smart Watch at the best price in Bangladesh. Latest Mibro P5 Kids Smart Watch available at Star Tech online shop. Order online for delivery anywhere in BD.","product_seo_keywords":"Mibro P5 Kids Smart Watch"},{"url":"https://www.startech.com.bd/mibro-c3-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-c3/mibro-c3-01-228x228.webp","title":"Mibro C3 Bluetooth Calling Smart Watch","product_list_short_description":["1.85\" HD Screen with 60Hz Refresh Rate","Wrist Bluetooth calling","Updated 4 PD heart rate monitoring","2ATM waterproof"],"price_new":3220,"price_old":3999,"price_single":3220,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"In Stock","code":"30320","brand":"Mibro","product_page_short_description":["MPN: XPAW014","Model: C3","1.85\" HD Screen with 60Hz Refresh Rate","Wrist Bluetooth calling","Updated 4 PD heart rate monitoring","2ATM waterproof"],"emi_price":367,"full_description":"<h2 style=\"\">Mibro C3 Bluetooth Calling Smart Watch</h2><p>The Mibro C3 Smart Watch offers a dual-core 2-in-1 chip, a 1.85\" HD screen with a smooth 60fps frame rate. The Smart Watch offers convenient wrist Bluetooth calling. This fitness tracking smart watch is equipped with an advanced 4 PD heart rate monitoring. It offers extensive support for 70 sport modes, a remarkable 10-day battery life. Mibro C3 Bluetooth Calling Smart Watch offers reliable 2ATM waterproofing.<br></p><h3 style=\"\">Dual-core 2-in-1 Chip</h3><p>The Mibro C3 Smart Watch comes with a brand new two-in-one Bluetooth chip that enables seamless and stable connections. With a simple click, users can connect to dual-mode Bluetooth, ensuring reliability. The watch's low power consumption and dual-core architecture enhance processor performance by 80%, delivering improved efficiency. Additionally, the inclusion of a 2.5D GPU empowers fluid dynamic wallpaper for a visually enhanced experience.<br></p><h3 style=\"\">1.85\" HD Screen with 60Hz Refresh Rate</h3><p>The Mibro C3 Smart Watch features a spacious 1.85\" HD screen that offers an expansive and clear visual experience. With an impressive 60Hz screen refresh rate, the watch ensures a smooth and fluid user interaction. The 60fps frame rate, refreshing 60 frames per second, contributes to seamless visuals. Adding to its appeal, the watch supports cool and dynamic dials, providing an interactive experience where users can enjoy playful interactions like igniting fireworks with a simple touch on the screen.<br></p><h3 style=\"\">Wrist Bluetooth calling</h3><p>The Mibro C3 Smart Watch offers a touch of elegance to your calling experience. Whether you're immersed in work or engaged in exercise, the watch allows you to seamlessly answer calls with ease and convenience. Managing unwanted calls is a breeze, simply click to send an SMS and reject calls effortlessly, ensuring a hassle-free communication experience.</p><h3 style=\"\">Updated Health Monitoring</h3><p>The Mibro C3 Smart Watch features an advanced 4PD matrix heart rate sensor, coupled with a professional optical design and finely crafted Fresnel lens, this watch ensures highly efficient heart rate monitoring with unparalleled accuracy. The integration of biometric identification technology further enhances measurement precision. You can benefit from round-the-clock heart rate monitoring with the innovative heart rate sensor, providing comprehensive insights into your heart health throughout the day. Wear the watch during your sleep to gain valuable insights into your sleep patterns and overall sleep quality, empowering you with information to improve your rest. The Mibro C3 can conveniently measure your blood oxygen saturation levels with ease.</p><h3 style=\"\">Tailored Precision for Women's Health</h3><p>The Mibro C3 Smart Watch goes the extra mile by incorporating precision algorithms to address women's health needs. Record your physiological cycle effortlessly and receive predictions for upcoming menstrual and ovulation periods, providing invaluable support for proactive health management.</p><h3 style=\"\">70+ Sports Modes</h3><p>Mibro C3 Smart Watch offers over 70 workout modes including running, cycling, swimming, outdoor and indoor activities. It covers a wide range of options like dance, ball games, aquatic sports, and fighting, enhancing your fitness tracking experience.</p><h3 style=\"\">2ATM Waterproof</h3><p>The Mibro C3 Smart Watch is rated at 2ATM waterproof, as per Mibro lab tests. It's important to note that the actual waterproof effect may vary depending on the specific product, user habits, and environmental conditions, including factors like temperature, humidity, and pressure. While the watch is resistant to water exposure, it is not suitable for activities such as scuba diving, surfing, or hot spring use.</p><h3 style=\"\">10-day Battery Life</h3><p>The Mibro C3 Smart Watch ensures worry-free usage with its impressive 10-day ultra-long battery life. Thanks to an upgraded low power consumption chip and optimized algorithms, a single charge offers a remarkable 10 days of uninterrupted use, providing extended convenience and efficiency.</p><h2 style=\"\">Buy Mibro C3 Bluetooth Calling Smart Watch&nbsp;from Star Tech</h2><p>In Bangladesh, you can get original&nbsp;<span style=\"font-weight: bold;\">Mibro C3 Bluetooth Calling Smart Watch</span>&nbsp;From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/mibro-smart-watch\" target=\"\">Mibro Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Mibro C3 Bluetooth Calling Smart Watch comes with 1 year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"Dual-core 2-in-1 chip"},{"key":"Display","value":"1.85 inch TFT HD (240*284) touch screen"},{"key":"Battery","value":"350mAh"},{"key":"Connectivity","value":"BLE5.3"},{"key":"Material","value":"Body material: Metal + Plastic cement"},{"key":"SpecialFeatures","value":"2 ATM Water-resistance"},{"key":"Sensor","value":"Blood oxygen, G-sensor, PPG Heart Rate"},{"key":"Supported Apps/ Software","value":"Mibro Fit"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"47*39.5*11.8mm (without heart rate boss)"},{"key":"Weight","value":"43.5g (including strap)"},{"key":"Color","value":"Navy blue"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Mibro C3 Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro C3 Smart Watch in Bangladesh is 3,220৳. You can buy the Mibro C3 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-c3/mibro-c3-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-c3/mibro-c3-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-c3/mibro-c3-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-c3/mibro-c3-04-500x500.webp"],"product_seo_title":"Mibro C3 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro C3 Bluetooth Calling Smart Watch at the best price in Bangladesh. Latest Mibro C3 Smart Watch available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"Mibro C3 Bluetooth Calling Smart Watch"},{"url":"https://www.startech.com.bd/mibro-a2-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-a2/mibro-a2-01-228x228.webp","title":"Mibro A2 Bluetooth Calling Smart Watch","product_list_short_description":["1.39 inch HD touch screen","Wrist Bluetooth calling","Updated 4 PD heart rate monitoring","2ATM waterproof"],"price_new":3540,"price_old":4299,"price_single":3540,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"In Stock","code":"30321","brand":"Mibro","product_page_short_description":["MPN: XPAW015","Model: A2","1.39 inch HD touch screen","Wrist Bluetooth calling","Updated 4 PD heart rate monitoring","2ATM waterproof"],"emi_price":394,"full_description":"<h2 style=\"\">Mibro A2 Bluetooth Calling Smart Watch</h2><p>The Mibro A2 Smart Watch offers a dual-core 2-in-1 chip, a 1.39 inch HD touch screen. It has a sports look and a round shape. The Smart Watch offers convenient wrist Bluetooth calling. This fitness tracking smart watch is equipped with an advanced 4 PD heart rate monitoring. This sports smart watch offers extensive support for 70 sport modes, a remarkable 10-day battery life. Mibro A2 Bluetooth Calling Smart Watch offers reliable 2ATM waterproofing.<br></p><h3 style=\"\">Dual-core 2-in-1 Chip</h3><p>The Mibro A2 Smart Watch comes with a brand new two-in-one Bluetooth chip that enables seamless and stable connections. With a simple click, users can connect to dual-mode Bluetooth, ensuring reliability. The watch's low power consumption and dual-core architecture enhance processor performance by 80%, delivering improved efficiency. Additionally, the inclusion of a 2.5D GPU empowers fluid dynamic wallpaper for a visually enhanced experience.<br></p><h3 style=\"\">1.39 inch HD Touch Screen</h3><p>The Mibro A2 Smart Watch features a 1.39 inch HD touch screen that offers an expansive and clear visual experience. It has a screen PPI of 391. Adding to its appeal, the watch supports cool and dynamic dials, providing an interactive experience where users can enjoy playful interactions like igniting fireworks with a simple touch on the screen.<br></p><h3 style=\"\">Wrist Bluetooth calling</h3><p>The Mibro A2 Smart Watch offers a touch of elegance to your calling experience. Whether you're immersed in work or engaged in exercise, the watch allows you to seamlessly answer calls with ease and convenience. Managing unwanted calls is a breeze, simply click to send an SMS and reject calls effortlessly, ensuring a hassle-free communication experience.</p><h3 style=\"\">Updated Health Monitoring</h3><p>The Mibro A2 Smart Watch features an advanced 4PD matrix heart rate sensor, coupled with a professional optical design and finely crafted Fresnel lens, this watch ensures highly efficient heart rate monitoring with unparalleled accuracy. The integration of biometric identification technology further enhances measurement precision. You can benefit from round-the-clock heart rate monitoring with the innovative heart rate sensor, providing comprehensive insights into your heart health throughout the day. Wear the watch during your sleep to gain valuable insights into your sleep patterns and overall sleep quality, empowering you with information to improve your rest. The Mibro A2 can conveniently measure your blood oxygen saturation levels with ease.</p><h3 style=\"\">70 Specialized Sports Modes</h3><p>Mibro A2 Smart Watch offers 70 workout modes including running, cycling, swimming, outdoor and indoor activities. It covers a wide range of options like dance, ball games, aquatic sports, and fighting, enhancing your fitness tracking experience.</p><h3 style=\"\">2ATM Waterproof</h3><p>The Mibro A2 Smart Watch is rated at 2ATM waterproof, as per Mibro lab tests. It's important to note that the actual waterproof effect may vary depending on the specific product, user habits, and environmental conditions, including factors like temperature, humidity, and pressure. While the watch is resistant to water exposure, it is not suitable for activities such as scuba diving, surfing, or hot spring use.</p><h3 style=\"\">10-day Battery Life</h3><p>The Mibro A2 Smart Watch ensures worry-free usage with its impressive 10-day ultra-long battery life. Thanks to an upgraded low power consumption chip and optimized algorithms, a single charge offers a remarkable 10 days of uninterrupted use, providing extended convenience and efficiency.</p><h2 style=\"\">Buy Mibro A2 Bluetooth Calling Smart Watch&nbsp;from Star Tech</h2><p>In Bangladesh, you can get original&nbsp;<span style=\"font-weight: bold;\">Mibro </span><span style=\"font-weight: 700;\">A2</span><span style=\"font-weight: bold;\">&nbsp;Bluetooth Calling Smart Watch</span>&nbsp;From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/mibro-smart-watch\" target=\"\">Mibro Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Mibro A2 Bluetooth Calling Smart Watch comes with 1 year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Processor","value":"Dual-core 2-in-1 chip"},{"key":"Display","value":"1.39 inch TFT HD ( 360*360) touch screen"},{"key":"Battery","value":"350mAh"},{"key":"Connectivity","value":"BLE5.3"},{"key":"Material","value":"Body material: Metal + Plastic cement"},{"key":"SpecialFeatures","value":"2 ATM Water-resistance"},{"key":"Sensor","value":"Blood oxygen, G-sensor, PPG Heart Rate"},{"key":"Supported Apps/ Software","value":"Mibro Fit"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"φ=45.17mm, T=11.4mm (without heart rate boss)"},{"key":"Weight","value":"46.89g (including strap)"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Mibro A2 Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro A2 Smart Watch in Bangladesh is 3,540৳. You can buy the Mibro A2 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-a2/mibro-a2-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-a2/mibro-a2-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-a2/mibro-a2-03-500x500.webp"],"product_seo_title":"Mibro A2 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro A2 Bluetooth Calling Smart Watch at the best price in Bangladesh. Latest Mibro A2 Smart Watch available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"Mibro A2 Bluetooth Calling Smart Watch"},{"url":"https://www.startech.com.bd/mibro-t1-calling-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-t1/mibro-t1-01-228x228.webp","title":"Mibro T1 Calling Amoled Smart Watch","product_list_short_description":["Display: 1.6\" AMOLED HD Touch Screen","Capacity: 350mAh","Waterproof rating: 2 ATM","Sensors: Heart rate sensor, SpO2 sensor, Accelerometer"],"price_new":4340,"price_old":5290,"price_single":4340,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"In Stock","code":"24798","brand":"Mibro","product_page_short_description":["Model: Mibro T1","Display: 1.6\" AMOLED HD Touch Screen","Capacity: 350mAh","Waterproof rating: 2 ATM","Sensors: Heart rate sensor, SpO2 sensor, Accelerometer"],"emi_price":485,"full_description":"<h2>Mibro T1 Calling Amoled Smart Watch</h2><p>The Mibro T1 Smart Watch has a 1.6-inch AMOLED screen with a resolution of 320 × 360 pixels. It has Bluetooth 5.0 connection, so you can use your smartphone to make calls through it. The smart wearable also includes sleep tracking, SpO2, and 24-hour heart rate monitoring. The Mibro T1 offers possibilities during workouts with more than 20 sports modes. A 350mAh battery within the T1<a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\"> Smart Watch </a>allows for either 5 hours of Bluetooth calling or 7 days of ordinary use. The water resistance of this smartwatch is 2 ATM. This indicates that the wristwatch is not water- or shower-proof, making it vulnerable to harm. The watch also has a silicone strap, a metal alloy case, and interchangeable watch faces. They can even make phone calls. You link the smartwatch with your phone using the most recent Bluetooth 5.0 technology, so you don't have to be concerned about unintentional power shortages. You may use the microphone and speaker to place calls while connected to the phone, in addition to monitoring alerts. The Mibro T1 Calling Smart Watch comes with a 06-month warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.6\" AMOLED HD touchscreen"},{"key":"Battery","value":"Capacity: 350mAh"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"body material: metal alloy"},{"key":"OS","value":"Android 5.0 or higher, iOS 10.0 or higher"},{"key":"SpecialFeatures","value":"2ATM Water"},{"key":"Sensor","value":"heart rate sensor"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"Dimension: 43.5 x 35 x 11.3 mm"},{"key":"Weight","value":"51g (Including Strap)"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"06 Month Warranty (Must Claim With Box & All Accessories)"}]}],"latest_price":{"heading":"What is the price of Mibro T1 Calling Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro T1 Calling Smart Watch in Bangladesh is 4,340৳. You can buy the Mibro T1 Calling Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-t1/mibro-t1-01-500x500.webp"],"product_seo_title":"Mibro T1 Calling Amoled Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro T1 Calling Amoled Smart Watch at the best price in Bangladesh. Latest Mibro Smart Watch available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"Mibro T1 Calling Amoled Smart Watch"},{"url":"https://www.startech.com.bd/mibro-t2-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-t2/mibro-t2-01-228x228.webp","title":"Mibro T2 Bluetooth Calling Smart Watch","product_list_short_description":["1.75 inch AMOLED Screen","GPS satellite positioning","6-Axis motion sensor","2ATM Waterproof"],"price_new":5790,"price_old":7299,"price_single":5790,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"In Stock","code":"31924","brand":"Mibro","product_page_short_description":["Model: Mibro T2","1.75 inch AMOLED Screen","GPS satellite positioning","6-Axis motion sensor","2ATM Waterproof"],"emi_price":669,"full_description":"<h2 style=\"text-align: justify; \">Mibro T2 Bluetooth Calling Smart Watch</h2><p>The <strong>Mibro T2</strong> Smart Watch comes with a 1.75-inch AMOLED screen. It has a resolution of 390*450 pixels. This smartwatch has Bluetooth 5.3 connectivity so you can make calls using your smartphone. In addition, the wearable smart device has 24-hour heart rate monitoring, SpO2, and sleep tracking features. During exercise, the Mibro T2 provides options with over 105 sports modes. The T2 Smart Watch has a 300mAh battery that lasts for 10 days on daily mood and 45 days on Basic mood. This smartwatch has a 2 ATM water resistance rating. This suggests that the watch is not resistant to water or showers, leaving it open to damage. In addition, the watch features a metal alloy case, a silicone band, and replaceable watch faces.</p><h3>GPS Satellite Positioning</h3><p>The Mibro T2 watch supports the five-star positioning systems of GPS, Beidou, GLONASS, Galileo, and QZSS; swiftly search for stars for positioning; and follow the movement trajectory in its entirety.</p><h3>Super-Retina AMOLED HD Always on Display</h3><p>With a HD AMOLED screen PPI of 340, a larger color spectrum, more vibrant and delicate image quality, and the ability to see every last detail, you can see more clearly and broadly.</p><h3>A watch for more elegant calling</h3><p>Answer a call through the <strong>Mibro T2</strong> watch when you are busy at work or doing exercise, easy yet convenient. Just click to send a SMS to reject an unwanted call.</p><h3>Cool dynamic dial</h3><p>Mibro T2 smart <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(66, 66, 66);\">watch </a>supports a dynamic and cool dial that lets you play fireworks on the screen with just a finger click.</p><h2 style=\"text-align: justify; \">Buy Mibro T2 Bluetooth Calling Smart Watch from Star Tech</h2><p style=\"text-align: justify; \">In Bangladesh, you can get original&nbsp;<span style=\"font-weight: bold;\">Mibro T2 Bluetooth Calling Smart Watch</span> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/mibro-smart-watch\" target=\"\">Mibro Smartwatch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Mibro T2 Bluetooth Calling Smart Watch comes with 01 year of warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.75-inch AMOLED HD Display (390*450)"},{"key":"Battery","value":"300mAh"},{"key":"Connectivity","value":"Bluetooth 5.3"},{"key":"Material","value":"Body material: Metal+ plastic cement + Liquid silicone"},{"key":"SpecialFeatures","value":"2ATM Water-resistance Grade"},{"key":"Supported Apps/ Software","value":"Mibro Fit"},{"key":"Others","value":"Buttons: 1 keys"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"50.95*36.67*11.3mm (without heart rate boss)"},{"key":"Weight","value":"37.9g (without strap)"},{"key":"Color","value":"Deep Blue"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 year"}]}],"latest_price":{"heading":"What is the price of Mibro T2 Calling Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro T2 Calling Smart Watch in Bangladesh is 5,790৳. You can buy the Mibro T2 Calling Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-t2/mibro-t2-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-t2/mibro-t2-02-500x500.webp"],"product_seo_title":"Mibro T2 Smart Watch Price in Bangladesh","product_seo_description":"Buy Mibro T2 Smart Watch at best price in Bangladesh. Latest Mibro T2 Bluetooth Calling Smart Watch available at Star Tech Shop. Order online & get delivery in BD.","product_seo_keywords":"Mibro T2 Bluetooth Calling Smart Watch"},{"url":"https://www.startech.com.bd/mibro-gs-pro-bluetooth-calling-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-gs-pro/gs-pro-01-228x228.webp","title":"Mibro GS Pro AMOLED Display Bluetooth Calling Smart Watch","product_list_short_description":["1.43 inch AMOLED HD Color Screen","GPS satellite positioning","Intelligent Health Monitoring","5ATM Waterproof"],"price_new":6850,"price_old":8299,"price_single":6850,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"In Stock","code":"31923","brand":"Mibro","product_page_short_description":["Model: GS Pro","1.43 inch AMOLED HD Color Screen","GPS satellite positioning","Intelligent Health Monitoring","5ATM Waterproof"],"emi_price":761,"full_description":"<h2 style=\"text-align: justify; \">Mibro GS Pro AMOLED Display Bluetooth Calling Smart Watch</h2><p>The 1.43-inch AMOLED HD Color Screen that comes with the Mibro <strong>GS Pro</strong> Smart Watch. It supports GPS satellite navigation and is powered by a dual-core main chip. It has features for female health monitoring and intelligent health monitoring. The smartwatch has seventy specific sports modes. You may see movement statistics in real time. With its 5ATM waterproof rating, the Mibro GS Pro is appropriate for every event. It has also a Bluetooth calling feature.</p><h3>GPS Satellite Positioning</h3><p>The Mibro Watch GS Pro supports GPS, Beidou, GLONASS, GZSS satellite positioning, and rapid search positioning trace and record detailed motion trajectory.</p><h3>Super-Retina AMOLED HD Always on Display</h3><p>The Mibro <strong>GS Pro</strong> smart watch can trace and record exact motion trajectories and is compatible with GPS, Beidou, GLONASS, GZSS, and quick search location.</p><h3>Dual-core Mian Chip</h3><p>The Mibro GS Pro <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(66, 66, 66);\">watch </a>is driven by a low power consumption dual-core design, an integrated 2.5D GPU visual processing unit, and a unique dual-core Bluetooth primary control chip.</p><h3>Real-time Health Monitoring</h3><p>Accurate sport, sleep, and resting heart rate monitoring is provided with the Mibro Watch GS. Additionally, SpO2 can be measured if you want to safeguard your health constantly. Stress testing and sleeping monitoring are supported by the watch. It can assist you in taking care of your body and managing it scientifically, as well as in recording the physiological cycle and monitoring the women health conditions.</p><h2 style=\"text-align: justify; \">Buy Mibro GS Pro AMOLED Display Bluetooth Calling Smart Watch from Star Tech</h2><p style=\"text-align: justify; \">In Bangladesh, you can get original <span style=\"font-weight: bold;\">Mibro GS Pro AMOLED Display Bluetooth Calling Smart Watch </span>from Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/mibro-smart-watch\" target=\"\">Mibro Smartwatch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Mibro GS Pro AMOLED Display Bluetooth Calling Smart Watch comes with 01 year of warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.43-inch AMOLED HD Display (466*466)"},{"key":"Battery","value":"460mAh"},{"key":"Connectivity","value":"Bluetooth 5.3"},{"key":"Material","value":"Body material: Metal"},{"key":"SpecialFeatures","value":"5ATM Water-resistance Grade"},{"key":"Supported Apps/ Software","value":"Mibro Fit"},{"key":"Others","value":"Buttons: 2 keys"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"φ=46.5mm, T=11.8mm (without heart rate boss)"},{"key":"Weight","value":"39.82g (without strap)"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 year"}]}],"latest_price":{"heading":"What is the price of Mibro GS Pro Bluetooth Calling SmartWatch in Bangladesh?","paragraph":"The latest price of Mibro GS Pro Bluetooth Calling SmartWatch in Bangladesh is 6,850৳. You can buy the Mibro GS Pro Bluetooth Calling SmartWatch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-gs-pro/gs-pro-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-gs-pro/gs-pro-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-gs-pro/gs-pro-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-gs-pro/gs-pro-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/mibro-gs-pro/gs-pro-05-500x500.webp"],"product_seo_title":"Mibro GS Pro Smart Watch Price in Bangladesh","product_seo_description":"Buy Mibro GS Pro Smart Watch at best price in Bangladesh. Latest Mibro GS Pro AMOLED Display Bluetooth Calling Smart Watch available at Star Tech Shop. Order online & get delivery in BD.","product_seo_keywords":"Mibro GS Pro AMOLED Display Bluetooth Calling Smart Watch"},{"url":"https://www.startech.com.bd/xiaomi-mibro-s5-kids-4g-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro/mibro-s5-kids-4g/s5-kids-4g-01-228x228.jpg","title":"Mibro S5 Kids 4G Smart Watch","product_list_short_description":["Display: 1.30 inch IPS TFT 240 x 240 p","Waterproof rating: IPX8","4G Cellular Network with 9 Location Mode GPS and SOS","Camera: 2 million Pixels HD"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"Up Coming","code":"23139","brand":"Mibro","product_page_short_description":["Model: Mibro S5","Display: 1.30 inch IPS TFT 240 x 240 p","Waterproof rating: IPX8","4G Cellular Network with 9 Location Mode GPS and SOS","Camera: 2 million Pixels HD"],"emi_price":0,"full_description":"<h2>Mibro S5 Kids 4G Smart Watch</h2><p>Mibro S5 Kids 4G Smart Watch is a smartwatch from Mibro. This Smartwatch is designed specifically for children. So naturally, they come with a few child-friendly features. It has an IPX8 Water-Resistance rating. The display is a 1.30-inch IPS Panel TFT 240 x 240 pixels HD screen. It has an 860mAH Lithium battery that uses Magnetic charging. The Sports modes include Outdoor running and rope skipping. This watch also has a pedometer to count Steps.</p><h3>4G Cellular Network and Wi-Fi Support</h3><p>This Mibro smartwatch supports 4G Cellular Networks making it a Watch Phone. This feature is particularly helpful for parents to locate their children. The supported Bands include GSM: B3/B8; WCDMA: B1/B5/B8; FDD-LTE: B1/B3/B5/B8 and DD-LTEB38/B39/B40/B41. So it is usable in 2G, 3G, or 4G networks. It also comes with Wi-fi Support.</p><h3>9 Location Modes with GPS and SOS</h3><p>This Smartwatch comes equipped with 9 Location Modes with GPS and SOS. The location mode stores up the last 9 locations the child has been to and the capacity allows it to store 3-month data. This smartwatch also supports GPS, Beidou, Basestation, and Wi-Fi plus location modes. To signal for emergencies the watch has an SOS function. To activate it the user has to Long Press the SOS Button and the concerned party will be notified of the location of the wearer. It also has advanced tracking options. namely: G-sensor, AGPS, IndoorLocation, Photo assisted positioning, and smart Al Locating. The GPS for Children in this watch also features real-time Trajectory Tracking alongside Add friends and pet tracking.</p><h3>Video Call and Remote Shooting</h3><p>Mibro S5 Kids 4G Smart Watch also comes equipped with a 2 million pixels HD Camera which allows remote access feed. which enables the user to Video Call and Remote Shooting. so it is possible to Video call, Voicechat, and take photographs. Mibro S5 Kids 4G Smart Watch offers No Warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.30 inch IPS TFT"},{"key":"Battery","value":"860mAH Lithium battery"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"Metal+PC/ABS+ silicone"},{"key":"OS","value":"Compatible OS: Android 5.0 or above; iOS 10.0 or above"},{"key":"SpecialFeatures","value":"IPX8 Waterproof"},{"key":"Supported Apps/ Software","value":"Mibro Fit"},{"key":"Others","value":"Outdoor running"}]},{"heading":"Exterior","values":[{"key":"Weight","value":"52 g (Including Strap)"},{"key":"Color","value":"Body:White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"No warranty"}]}],"latest_price":{"heading":"What is the price of Mibro S5 Kids 4G Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro S5 Kids 4G Smart Watch in Bangladesh is 0৳. You can buy the Mibro S5 Kids 4G Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro/mibro-s5-kids-4g/s5-kids-4g-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro/mibro-s5-kids-4g/s5-kids-4g-02-500x500.jpg"],"product_seo_title":"Mibro S5 Kids 4G Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro S5 Kids 4G Smart Watch at best price in Bangladesh. Latest Smart Watch available at Star Tech shop. Order online for delivery anywhere in BD.","product_seo_keywords":"Mibro S5 Kids 4G Smart Watch"},{"url":"https://www.startech.com.bd/xiaomi-mibro-y2-kids-4g-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro/mibro-y2-kids-4g/mibro-y2-kids-4g-blue-228x228.jpg","title":"Mibro Y2 Kids 4G Smart Watch","product_list_short_description":["Display: 1.40 inch IPS TFT 240 x 240 p","Waterproof rating: 2 ATM","4G Cellular Network with 9 Location Mode GPS and SOS","Camera: Dual 5 million Pixels HD"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"Up Coming","code":"23140","brand":"Mibro","product_page_short_description":["Model: Mibro Y2","Display: 1.40 inch IPS TFT 240 x 240 p","Waterproof rating: 2 ATM","4G Cellular Network with 9 Location Mode GPS and SOS","Camera: Dual 5 million Pixels HD"],"emi_price":0,"full_description":"<h2>Mibro Y2 Kids 4G Smart Watch</h2><p>Mibro Y2 Kids 4G Smart Watch is a smartwatch from Mibro. This Smartwatch is designed specifically for children. So naturally, they come with a few child-friendly features. This Smartwatch has 512MB RAM and 4GB Storage capacity. It has a 2ATM Water-Resistance rating. which ensures 20-meter Water-Resistance. The display is a 1.40-inch IPS Panel TFT 240 x 240 pixels HD screen. It has a 920mAH Lithium battery that uses Magnetic charging. The Sports modes include Outdoor running and rope skipping. This watch also has a pedometer to count Steps.</p><h3>4G Cellular Network and Wi-Fi Support</h3><p>This Mibro smartwatch supports 4G Cellular Networks making it a Watch Phone. This feature is particularly helpful for parents to locate their children. The supported Bands include GSM: B3/B8; WCDMA: B1/B5/B8; FDD-LTE: B1/B3/B5/B8 and DD-LTEB38/B39/B40/B41. So it is usable in 2G, 3G, or 4G networks. It also comes with Wi-fi Support.</p><h3>9 Location Modes with GPS and SOS</h3><p>This Smartwatch comes equipped with 9 Location Modes with GPS and SOS. The location mode stores up the last 9 locations. This smartwatch also supports GPS, Beidou, Base station, Wi-Fi, and location modes. To signal for emergencies the watch has an SOS function. To activate it the user has to Long Press the SOS Button and the concerned party will be notified of the location of the wearer. It also has advanced tracking options. namely: G-sensor, AGPS, IndoorLocation, Photo assisted positioning, and smart Al Locating. The GPS for Children in this watch also features real-time Trajectory Tracking alongside Add friends and pet tracking.</p><h3>Video Call and Remote Shooting with Dual 5 million pixels HD Camera </h3><p>Mibro Y2 Kids 4G Smart Watch also comes equipped with two Dual 5 million pixels HD Camera which allows remote access feed. which enables the user to Video Call and Remote Shooting. so it is possible to Video call, Voicechat, and take HD photographs. It also has a virtual Pet powered by a pedometer calorie count. Mibro Y2 Kids 4G Smart Watch offers No Warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.40 inch IPS TFT"},{"key":"Memory","value":"RAM: 512MB"},{"key":"Battery","value":"920mAH Lithium battery"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"Metal+PC/ABS+ silicone"},{"key":"OS","value":"Compatible OS: Android 5.0 or above; iOS 10.0 or above"},{"key":"SpecialFeatures","value":"2 ATM Waterproof"},{"key":"Supported Apps/ Software","value":"Mibro Fit"},{"key":"Others","value":"Outdoor running"}]},{"heading":"Exterior","values":[{"key":"Weight","value":"52 g (Including Strap)"},{"key":"Color","value":"Body: Silver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"No warranty"}]}],"latest_price":{"heading":"What is the price of Mibro Y2 Kids 4G Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro Y2 Kids 4G Smart Watch in Bangladesh is 0৳. You can buy the Mibro Y2 Kids 4G Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro/mibro-y2-kids-4g/mibro-y2-kids-4g-blue-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro/mibro-y2-kids-4g/mibro-y2-kids-4g-pink-500x500.jpg"],"product_seo_title":"Mibro Y2 Kids 4G Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro Y2 Kids 4G Smart Watch at best price in Bangladesh. Latest Smart Watch available at Star Tech shop. Order online for delivery anywhere in BD.","product_seo_keywords":"Mibro Y2 Kids 4G Smart Watch"},{"url":"https://www.startech.com.bd/xiaomi-mibro-color-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-color/mibro-color-228x228.jpg","title":"Mibro Color Smart Watch with SPO2 (Global Version)","product_list_short_description":["Body's Pressure Measurement","24/ 7 Heart Rate Monitoring","SpO2 Measurement","5ATM Waterproof"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"Out Of Stock","code":"17781","brand":"Mibro","product_page_short_description":["MPN: XPAW002","Model: Mibro Color","Body's Pressure Measurement","24/ 7 Heart Rate Monitoring","SpO2 Measurement","5ATM Waterproof"],"emi_price":0,"full_description":"<h2>Mibro Color Smart Watch with SPO2 (Global Version)</h2>\n<p>The 1.57 HD full-color touch screen is made by diamond cutting technology, ensuring to display the vivid color and smooth readability. In addition, we also added anti-fingerprint oil technology to the surface of the watch screen, keeping the screen always clean and clear.<br></p>\n<h3>Perfectly Match Your Look<br></h3>\n<p>Choose the color you like. Thereâ€™re five colors available and make your watch more versatile and fashionable, whether youâ€™re dressing up for an occasion or heading to the gym. The food grade liquid silicone gel straps can better isolate dirt and dust, making the watch comfortable to wear.<br></p>\n<h3>Customize Your Own Watch Face<br></h3>\n<p>The dial market provides a variety of creative and colorful watch faces to match your mood. You can also customize your own one with your favorite photos from your mobile device.<br></p>\n<h3>Always Know Your Heart<br></h3>\n<p>Mibro Color can accurately monitor your heart rate dynamically no matter when you're exercising or sleeping. You can take action to consult your health earlier once you find the irregularities of data.<br></p>\n<h3>Blood Oxygen Monitoring<br></h3>\n<p>Blood oxygen saturation is an important indicator to the metabolic circulation. The normal blood oxygen saturation of human body is above 95%.Mibro Color supports to measure blood oxygen level and it can help adjust your status timely when you're having a long-time brain activities or high-intensity exercise.<br></p>\n<h3>Relax Your Mind and Body<br></h3>\n<p>Measure the body's pressure condition and relax body and mind by breathing training. Support stress tracking and keep abreast of your stress status. You can relax and recover in time through breathing training.<br></p>\n<h3>Improve Your Sleeping Quality<br></h3>\n<p>Mibro Color is capable of recording your sleep time and sleep quality in detail through the body movement frequency. And the App can provide you a variety of sleep improvement suggestions to help you sleep better. Time to create a healthy bedtime routine from now on.<br></p>\n<h3>Track All The Ways You Move<br></h3>\n<p>Stop doing exercise in a blind way! Mibro Color provides you 15 sports modes to track your real-time fitness data including heart rate, calories and duration of the workout. You can take a look at the date by lifting your wrist without breaking the exercise. Exercise in a more scientifically way!<br></p>\n<h3>5ATM Waterproof<br></h3>\n<p>The watch is water resistant to up to 50 meters in depth for 10 minutes. You can wear it for shallow-water activities like swimming in a pool. Donâ€™t worry about getting wet if you're caught in the rain. But it is forbidden to wear watches for surfing, diving, and hot spring.<br></p>\n<h3>Your Best Life Assistant<br></h3>\n<p>Mibro Color will keep track of your step count, calories, exercise data and other daily activities. It can also remind you timely the SMS, calls, weather, alarm clock and other social application information. Never miss an important thing!<br></p>\n<h3>Longer Battery Life<br></h3>\n<p>By using the deeply-optimized battery management system, the watch can last for up to 10 day. Never worry about running out of the battery life in a day.<br></p>\n","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.57inch HD Screen"},{"key":"Battery","value":"Battery Capacity: 270mAh"},{"key":"Connectivity","value":"Bluetooth Version: V5.0"},{"key":"Material","value":"Metal + PC/ ABS + Liquid silicone rubber"},{"key":"SpecialFeatures","value":"Charge: Magnetic Charging cable"},{"key":"Supported Apps/ Software","value":"APP: Mibro Fit"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"Body Dimension: 43*35mm"},{"key":"Weight","value":"52g (Including strap)"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Mibro Color Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro Color Smart Watch in Bangladesh is 2,550৳. You can buy the Mibro Color Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-color/mibro-color-500x500.jpg"],"product_seo_title":"Mibro Color Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro Color Smart Watch with SPO2 (Global Version) at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","product_seo_keywords":"Mibro Color Smart Watch with SPO2 (Global Version)"},{"url":"https://www.startech.com.bd/xiaomi-mibro-c2-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-c2/mibro-c2-01-228x228.webp","title":"Mibro C2 1.69-inch HD Screen Smart Watch","product_list_short_description":["Display: 1.69\" HD Display","Capacity: 270mAh","Waterproof rating: 2 ATM","Sensors: PPG Heart Rate, SpO2, Three-Axis"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"Out Of Stock","code":"23905","brand":"Mibro","product_page_short_description":["MPN: XPAW009","Model: Mibro C2","Display: 1.69\" HD Display","Capacity: 270mAh","Waterproof rating: 2 ATM","Sensors: PPG Heart Rate, SpO2, Three-Axis"],"emi_price":0,"full_description":"<h2>Mibro C2 1.69-inch HD Screen Smart Watch</h2><p style=\"text-align: justify; \">The Mibro C2 Smart Watch's body is constructed of zinc alloy, and silicone is an option for the strap. about the monitor! The Mibro C2 smartwatch features a 1.69-inch TFT touch retina screen that is curved with 2.5D glass and has a 240 x 280-pixel resolution. This smartwatch comes in black and white and offers a wide range of watch faces. Since the Mibro C2 is a 2ATM waterproof smartwatch, you may wear it when swimming, washing your hands, or even while it's raining. The wearable features a heart rate sensor that records information about our heart rate over a day. Thanks to its comprehensive sleep monitor, this wristwatch also aids with sleep management. It also features a pedometer, which lets us monitor and predict how many calories we burn each day. The Mibro Watch C2 can monitor up to 20 sporting activities, including walking, jogging, cycling, climbing, football, basketball, swimming, and more, in addition to the functions described above. A blood oxygen monitor, sedentary reminder, NFC access control, remote camera, call or message reminder, app notification, and other features are additional features. A 270mAh battery is also included with the Mibro C2, which has a battery life of 30 days in basic watch mode and 5-7 days with typical usage. The Mibro C2 Smart Watch has 6 Months warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"Size: 1.69 Inch"},{"key":"Battery","value":"Capacity: 270mAh"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"body material: zinc alloy"},{"key":"OS","value":"Android 5.0 or higher, iOS 10.0 or higher"},{"key":"SpecialFeatures","value":"2 ATM Water"},{"key":"Sensor","value":"PPG heart rate sensor"},{"key":"Supported Apps/ Software","value":"Mibro Fit APP"},{"key":"Others","value":"Additional Features:"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"45*35.3*11.2mm"},{"key":"Weight","value":"34g"},{"key":"Color","value":"Dark Gray"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"6 Months"}]}],"latest_price":{"heading":"What is the price of Mibro C2 Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro C2 Smart Watch in Bangladesh is 2,650৳. You can buy the Mibro C2 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-c2/mibro-c2-01-500x500.webp"],"product_seo_title":"Mibro C2 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro C2 1.69-inch Smart Watch at the best price in Bangladesh. Latest Mibro SmartWatch is available at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Xiaomi Mibro C2 1.69-inch HD Screen Smart Watch"},{"url":"https://www.startech.com.bd/xiaomi-mibro-lite-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-lite/mibro-lite-01-228x228.jpg","title":"Mibro Lite Smart Watch","product_list_short_description":["1.3\" AMOLED Full-circle Touch Display with 2.5D tempered glass","SpO2 (Blood Oxygen) Monitor","24h Bio Heart Rate Tracker","IP68 Waterproof"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"Out Of Stock","code":"20117","brand":"Mibro","product_page_short_description":["MPN: XPAW004","Model: Mibro Lite","1.3\" AMOLED Full-circle Touch Display with 2.5D tempered glass","SpO2 (Blood Oxygen) Monitor","24h Bio Heart Rate Tracker","IP68 Waterproof"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">Mibro Lite Smart Watch</h2><p style=\"text-align: justify; \">The Mibro Lite Smart Watch features a circular design, a wearable with a thin body having 9.8 mm in thickness. With its thin design body, the wearable weighs 48 grams only. It has a minimalist design with a single physical oval shape button on the side. It has a rich AMOLED screen, measuring 1.3 inches. Beautiful high-definition screen display. It is a fully circular screen and on top of it is a 2.5D tempered glass. The wearable supports activity tracking. It automatically tracks your steps, calories as well as distance. It is also loaded with at least 15 sports modes. It monitors your HR 24/7, especially during your workout. It provides you with overall protection of your heart health. The HR function also features abnormal heart rate reminders. The Mibro Lite SpO2 measurement. It monitors your blood oxygen while working out, or doing your regular activities, or even while sleeping. It is powered by a 230 mAh battery with 10 days of battery life, 8 days in basic mode. It is compatible with Android and iOS. The watch works perfectly with the Mibro Fit App, which can record various body data in real-time. The heart rate, step count, sleep, and other data are clear at a glance. The Mibro Lite has no warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.3 Inch AMOLED Full circle (360 x 360) Touch Display with 2.5D tempered glass"},{"key":"Battery","value":"230 mAh with 10 days of battery life, 8 days in basic mode"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"OS","value":"Compatible Os: Android & IOS"},{"key":"SpecialFeatures","value":"IP68 Waterproof"},{"key":"Sensor","value":"Accelerometer, Optical Heart Rate, SpO2 sensor"},{"key":"Supported Apps/ Software","value":"Mibro Fit"}]},{"heading":"Exterior","values":[{"key":"Weight","value":"48 g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Mibro Lite Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro Lite Smart Watch in Bangladesh is 3,600৳. You can buy the Mibro Lite Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-lite/mibro-lite-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-lite/mibro-lite-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-lite/mibro-lite-03-500x500.jpg"],"product_seo_title":"Mibro Lite Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro Lite Smart Watch at best price in Bangladesh. Latest Xiaomi Smart Watch available at Star Tech Shop. Order online to get delivery anywhere in BD.","product_seo_keywords":"Xiaomi Mibro Lite XPAW004 Smart Watch"},{"url":"https://www.startech.com.bd/mibro-watch-gs-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/watch-gs/watch-gs-01-228x228.webp","title":"Mibro Watch GS AMOLED Display GPS Sports Smart Watch","product_list_short_description":["1.43 inch AMOLED HD Color Screen","GPS satellite positioning","Intelligent Health Monitoring","5ATM Waterproof"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"Out Of Stock","code":"27284","brand":"Mibro","product_page_short_description":["MPN: XPAW008","Model: Mibro Watch GS XPAW008","1.43 inch AMOLED HD Color Screen","GPS satellite positioning","Intelligent Health Monitoring","5ATM Waterproof"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">Mibro Watch GS AMOLED Display GPS Sports Smart Watch</h2><p style=\"text-align: justify; \">Mibro Watch GS Smart Watch comes with a 1.43-inch AMOLED HD Color Screen. It is powered by a dual-core main chip and offers GPS satellite positioning support. It comes with&nbsp;Intelligent health monitoring and offers female health monitoring facilities. There are 70 specialized sports modes on the <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">smartwatch</a>. It can show you real-time movement data. The&nbsp;Mibro Watch GS is 5ATM waterproof and is suitable for all occasions.<br></p><h3 style=\"text-align: justify; \">GPS Satellite Positioning</h3><p style=\"text-align: justify; \">The Mibro Watch GS supports GPS, Beidou, GLONASS, GZSS satellite positioning, and rapid search positioning trace and record detailed motion trajectory.<br></p><h3 style=\"text-align: justify; \">Super-Retina AMOLED HD Always on Display</h3><p style=\"text-align: justify; \">Mibro Watch GS Smart Watch comes with a 1.43 inch HD AMOLED Display. It brings you an extraordinary visual feast thanks to higher image quality. It&nbsp;supports AOD (Always on Display) screen-off clock display and multiple forms of screen-off watch faces.<br></p><h3 style=\"text-align: justify; \">Dual-core Mian Chip</h3><p style=\"text-align: justify; \">The Mibro Watch GS is empowered by an innovative dual-core Bluetooth main control chip, low power consumption dual-core architecture, and a built-in 2.5D GPU graphic processing unit.<br></p><h3 style=\"text-align: justify; \">Real-time Health Monitoring</h3><p style=\"text-align: justify; \">The Mibro Watch GS offers accurate monitoring of Sport/Sleep/Resting heart rate data. You can also measure SpO2 at any time to protect your health around the clock. The watch supports Sleeping Monitoring and Stress testing. It can help you record the physiological period and predict the next menstrual period and ovulation period, take care of your body and manage it scientifically.<br></p><h2 style=\"text-align: justify; \">Buy Mibro Watch GS GPS Sports Smart Watch from the best Smartwatch Shop in Bangladesh: Star Tech</h2><p style=\"text-align: justify; \">In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/mibro-watch-gs-smart-watch\" target=\"\">Mibro Watch GS GPS Sports Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/mibro-smart-watch\" target=\"\">Mibro Smartwatch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Mibro Watch GS comes with a 06-Month warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.43-inch AMOLED HD Display (466*466)"},{"key":"Battery","value":"460mAh"},{"key":"Connectivity","value":"Bluetooth 5.1"},{"key":"Material","value":"Body material: Metal"},{"key":"SpecialFeatures","value":"5ATM Water-resistance Grade"},{"key":"Supported Apps/ Software","value":"Mibro Fit"},{"key":"Others","value":"Buttons: 2 keys"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"Φ47mm, T=11.4mm (without heart rate boss)"},{"key":"Weight","value":"56.5g (including strap)"},{"key":"Color","value":"Mocha Grey"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"06-month Warranty"}]}],"latest_price":{"heading":"What is the price of Mibro Watch GS Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro Watch GS Smart Watch in Bangladesh is 5,990৳. You can buy the Mibro Watch GS Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/watch-gs/watch-gs-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/watch-gs/watch-gs-02-500x500.webp"],"product_seo_title":"Mibro Watch GS GPS Sports Smart Watch Price in Bangladesh","product_seo_description":"Buy Mibro Watch GS GPS Sports Smart Watch at best price in BD. Latest XIAOMI Mibro Watch GS available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"XIAOMI Mibro Watch GS AMOLED Display GPS Sports Smart Watch"},{"url":"https://www.startech.com.bd/xiaomi-mibro-a1-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-a1/mibro-a1-01-228x228.jpg","title":"Mibro A1 Smart Watch","product_list_short_description":["Display: 1.28\" HD Display","Capacity: 270mAh","Waterproof rating: 5 ATM","Sensors: PPG heart rate, SpO2, Accelerometer"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"Out Of Stock","code":"22750","brand":"Mibro","product_page_short_description":["Model: Mibro A1","Display: 1.28\" HD Display","Capacity: 270mAh","Waterproof rating: 5 ATM","Sensors: PPG heart rate, SpO2, Accelerometer"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">Mibro A1 Smart Watch</h2><p style=\"text-align: justify; \">The Mibro Watch A1 has a slim yet stylish design that will make your vacation more pleasurable. Its 5mm thin watch body is ideal for you. Slim yet simple design with exquisite skin-friendly workmanship. This smartwatch has a lightweight and thin design for a more comfortable and ultimate experience. It has a user-friendly design for health care. Monitor your health and alert you to any aberrant signals in real-time to assist you in restoring your health. This features a heart rate monitoring device that operates 24 hours a day, seven days a week. Forewarning of prospective issues Supports three types of early warning: activity, rest, and sleep. When you exercise outside, your health is protected throughout the clock. It offers a very extended battery life for more efficient operation. Fully charged and safely utilized, the Daily mode lasts 10 days and the Basic mode lasts 45 days. Everyday Mode It may be utilized once fully charged by connecting to the mobile phone App, which has the following features: 24h dynamic heart rate monitoring, sleep monitoring, recording of 60-minutes of sports exercise per week on average, 100 messages, and 6 calls per day (hang up in 5 seconds), checking time by lighting up the screen and raising the wrist 60 times, alarm clock 3 times per day, and other factory default settings Fundamental Mode When completely charged, it is not worn when switched on and not connected to the mobile APP. It is 5ATM waterproof, making it perfect for many situations. 5ATM waterproofing stimulates vitality and eases life's challenges. Sports modes are diverse for more efficient workouts. 20 professional sports modes are supported, including running, cycling, climbing, and swimming. The Mibro A1 Smart Watch comes with a 06-months warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"Size: 1.28” (round)"},{"key":"Battery","value":"Capacity: 270mAh"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"body material: metal alloy"},{"key":"OS","value":"Android 5.0 or higher, iOS 10.0 or higher"},{"key":"SpecialFeatures","value":"5ATM Water"},{"key":"Sensor","value":"PPG heart rate sensor"},{"key":"Supported Apps/ Software","value":"Mibro Fit APP"},{"key":"Others","value":"Incoming call alerts and notifications (via Bluetooth)"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"45 x 45 x 9.8 mm"},{"key":"Weight","value":"42 g (Including Strap)"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"06 Month Warranty (Must Claim With Box & All Accessories)"}]}],"latest_price":{"heading":"What is the price of Mibro A1 Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro A1 Smart Watch in Bangladesh is 2,580৳. You can buy the Mibro A1 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-a1/mibro-a1-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-a1/mibro-a1-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-a1/mibro-a1-03-500x500.jpg"],"product_seo_title":"Mibro A1 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro A1 Smart Watch at the best price in Bangladesh. Latest Mibro SmartWatch is available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"Mibro A1 Smart Watch"},{"url":"https://www.startech.com.bd/mibro-watch-lite2-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/watch-lite2/watch-lite2-brown-01-228x228.webp","title":"Mibro Watch Lite2 AMOLED Display Bluetooth Call Smart Watch","product_list_short_description":["1.3 inch AMOLED HD Color Screen","HD Bluetooth Call","Intelligent Health Monitoring","2ATM Waterproof"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"Out Of Stock","code":"27282","brand":"Mibro","product_page_short_description":["Model: Mibro Watch Lite2 XPAW011","1.3 inch AMOLED HD Color Screen","HD Bluetooth Call","Intelligent Health Monitoring","2ATM Waterproof"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">Mibro Watch Lite2 Bluetooth Call Smart Watch</h2><p style=\"text-align: justify; \">Mibro Watch Lite2 Smart Watch comes with a 1.3-inch AMOLED HD Color Screen. It is powered by a dual-core main chip and offers HD Bluetooth call support. It comes with&nbsp;Intelligent health monitoring and offers female health monitoring facilities. There are 60specialized sports modes on the <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">smartwatch</a>. It can show you real-time movement data. The&nbsp;Mibro Watch Lite2 is 2ATM waterproof and is suitable for all occasions.<br></p><h3 style=\"text-align: justify; \">HD Bluetooth Call Support</h3><p style=\"text-align: justify; \">The Mibro Watch Lite2 supports answering incoming calls on the wrist. It is equipped with Bluetooth 5.1 and supports the calling function. In case of an incoming call when you are busy, you can click to reply SMS to reject the call.<br></p><h3 style=\"text-align: justify; \">AMOLED HD Always on Display</h3><p style=\"text-align: justify; \">Mibro Watch Lite2 Smart Watch comes with an AMOLED HD Display that features 391 ppi and wider color space, bringing you an extraordinary visual feast thanks to higher image quality. It&nbsp;supports AOD (Always on Display) screen-off clock display and multiple forms of screen-off watch faces.<br></p><h3 style=\"text-align: justify; \">Dual-core Mian Chip</h3><p style=\"text-align: justify; \">The Mibro Watch Lite2 is empowered by an innovative dual-core Bluetooth main control chip, low power consumption dual-core architecture, and a built-in 2.5D GPU graphic processing unit.<br></p><h3 style=\"text-align: justify; \">Smart Health Monitoring</h3><p style=\"text-align: justify; \">The Mibro Watch Lite2 offers accurate monitoring of Sport/Sleep/Resting heart rate data. You can also measure SpO2 at any time to protect your health around the clock. The watch supports Sleeping Monitoring and Stress testing. It can help you record the physiological period and predict the next menstrual period and ovulation period, take care of your body and manage it scientifically.<br></p><h2 style=\"text-align: justify; \">Buy Mibro Watch Lite2 Bluetooth Call Smart Watch from the best Smartwatch Shop in Bangladesh: Star Tech</h2><p style=\"text-align: justify; \">In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/mibro-watch-lite2-smart-watch\" target=\"\">Mibro Watch Lite2 Bluetooth Call Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/mibro-smart-watch\" target=\"\">Mibro Smartwatch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Mibro Watch Lite2 comes with a 06-months Brand warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.3-inch AMOLED HD Display (360*360)"},{"key":"Battery","value":"350mAh"},{"key":"Connectivity","value":"Bluetooth 5.1"},{"key":"Material","value":"Body material: Metal (PA+GF)"},{"key":"SpecialFeatures","value":"2ATM Water-resistance Grade"},{"key":"Supported Apps/ Software","value":"Mibro Fit"},{"key":"Others","value":"Buttons: 2 keys"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"Φ44.7mm，T=11.5mm(without heart rate boss)"},{"key":"Weight","value":"54.2g (Leather strap), 53.8g (Silicone strap)"},{"key":"Color","value":"Black and Brown"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"06-months Brand Warranty"}]}],"latest_price":{"heading":"What is the price of Mibro Watch Lite2 Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro Watch Lite2 Smart Watch in Bangladesh is 6,499৳. You can buy the Mibro Watch Lite2 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/watch-lite2/watch-lite2-brown-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/mibro/watch-lite2/watch-lite2-black-01-500x500.webp"],"product_seo_title":"Mibro Watch Lite2 Bluetooth Call Smart Watch Price in Bangladesh","product_seo_description":"Buy Mibro Watch Lite2 Bluetooth Call Smart Watch at best price in BD. Latest XIAOMI Mibro Watch Lite2 available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"XIAOMI Mibro Watch Lite2 Bluetooth Call Smart Watch"},{"url":"https://www.startech.com.bd/xiaomi-mibro-x1-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-x1/mibro-x1-01-228x228.jpg","title":"Mibro X1 Smart Watch","product_list_short_description":["Display: 1.3\" AMOLED Full-circle Touch Display","PPG Heart Rate, Blood Oxygen, Acc Sensor","SpO2 (Blood Oxygen) Monitor","38Sports Modes and 5ATM Waterproof"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Mibro Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy Mibro Smart Watch at best price in Bangladesh. Latest Mibro A1, C2, X1, Mibro Color, Mibro Lite Smart Watch available at Star Tech Shop. Order online for delivery in BD.","cat_seo_keywords":"Mibro Smart Watch","status":"Out Of Stock","code":"20812","brand":"Mibro","product_page_short_description":["MPN: XPAW005","Model: Mibro X1","Display: 1.3\" AMOLED Full-circle Touch Display","PPG Heart Rate, Blood Oxygen, Acc Sensor","SpO2 (Blood Oxygen) Monitor","38Sports Modes and 5ATM Waterproof"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">Mibro X1 Smart Watch</h2><p style=\"text-align: justify; \">The Mibro X1 Smart Watch features a frameless and HD full-screen design. It has a 1.3 inches AMOLED colorful screen. This watch is powered by a built-in 350mAh large battery and it can be used for 14 days with one charge. The Mibro X1 comes with 38 Sports modes that include outdoor running, walking, cycling, spinning, yoga, etc. An exclusive exercise report can be generated to witness every step of your success. It is also rated waterproof to 5 ATM. No need to take off in a shower or swim, worry-free wear for you. It can withstand pressure 50 meters deep of still water for 10 min under normal temperature. The Mibro X1 Smart Watch is equipped with SpO2 Tracking. Low blood oxygen levels can easily cause fatigue lack of energy and decreased concentration. The Mibro X1 comes with a 06-Months Warranty.<br></p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.3 Inch AMOLED Full circle (360 x 360) Touch Display"},{"key":"Battery","value":"350mAh(4.5 hours to be fully charged)"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"Metal+PC/ABS+ silicone"},{"key":"OS","value":"Compatible OS: Android 5.0 or above; iOS 10.0 or above"},{"key":"SpecialFeatures","value":"5ATM Water and Dustproof"},{"key":"Sensor","value":"PPG Heart Rate, Blood Oxygen, Acc Sensor"},{"key":"Supported Apps/ Software","value":"Mibro Fit"},{"key":"Others","value":"Workout Modes:"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"Body: Φ47mm, Thickness=11.4mm"},{"key":"Weight","value":"52 g (Including Strap)"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"06-Months Warranty"}]}],"latest_price":{"heading":"What is the price of Mibro X1 Smart Watch in Bangladesh?","paragraph":"The latest price of Mibro X1 Smart Watch in Bangladesh is 4,190৳. You can buy the Mibro X1 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-x1/mibro-x1-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-x1/mibro-x1-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xiaomi/mibro-x1/mibro-x1-03-500x500.jpg"],"product_seo_title":"Mibro X1 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy Mibro X1 Smart Watch at the best price in Bangladesh. Latest Xiaomi Mibro Smart Watch available at Star Tech Shop. Order online to get delivery anywhere in BD.","product_seo_keywords":"Xiaomi Mibro X1 Smart Watch"}]