[{"url":"https://www.startech.com.bd/sony-playstation-5-slim-console-global-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-01-228x228.webp","title":"Sony PlayStation 5 Slim Gaming Console (Global Edition, Region Free)","product_list_short_description":["Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"price_new":89900,"price_old":120900,"price_single":89900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"35794","brand":"Sony","product_page_short_description":["MPN: CFI-2000A01","Model: PlayStation 5 Slim","Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"emi_price":11083,"full_description":"<h2>Sony PlayStation 5 Slim Gaming Console (Global Edition, Region Free)</h2><p>The Sony <strong>PlayStation 5</strong> <a href=\"https://www.startech.com.bd/gaming-console\" target=\"\" style=\"color: rgb(0, 0, 0);\">Console </a>offers gaming experiences never before possible, shorter loading times, and greater immersion thanks to its haptic feedback, adaptive triggers, 3D audio, and lightning-fast SSD. Also, take advantage of a fantastic assortment of freshly released PlayStation games. With the DualSense wireless controller, you can experience dynamic sensory input that lets you feel the results and impacts of your in-game activities. In several PS5 games, immersive adaptive triggers mimic the physical impacts of specific in-game behaviors through dynamic resistance levels. Playing this PS5 system-bundled game allows you to explore four different worlds and has innovative gameplay that takes advantage of the unique features of the DualSense wireless controller. Your most beloved games will always be there and simply waiting for you to pick them up and play thanks to the 1TB SSD storage included with the PS5 console. The <strong>PS5</strong> will improve playtime with its blazingly quick game loading times. The PS5 system is compatible with more than 4,000 PS4 games. Using the Game Boost option in some of the top PS4 titles may even result in faster and more fluid frame rates. This game can be played at up to 120 frames per second on 4K TVs with a 120Hz output, so enjoy fluid and seamless gameplay. Thanks to individually simulated light beams that create realistic shadows and reflections, compatible PS5 titles allow you to fully immerse yourself in settings with remarkable realism. The sleek, compact Sony PlayStation 5 Slim Console is equipped with cutting-edge gaming technologies. The PS5 console's unique system integration has made it possible for developers to swiftly extract data from the SSD and make games in a way that was before impossible.</p><h2>Buy Sony PlayStation 5 Slim Gaming Console (Global Edition, Region Free) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation 5 Slim Gaming Console (Global Edition, Region Free)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/play-station\" target=\"\">Sony Gaming Console</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Sony PlayStation 5 Slim Gaming Console (Global Edition, Region Free) comes with 1 year service warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PlayStation 5 Slim Gaming Console (Global Edition) in Bangladesh?","paragraph":"The latest price of Sony PlayStation 5 Slim Gaming Console (Global Edition) in Bangladesh is 89,900৳. You can buy the Sony PlayStation 5 Slim Gaming Console (Global Edition) at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-04-500x500.webp"],"product_seo_title":"Sony PlayStation 5 Slim Console (Global Edition) Price in Bangladesh","product_seo_description":"Buy Sony PlayStation 5 Slim Console (Global Edition) at best price in Bangladesh. Latest Sony PS5 Slim Gaming Console available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Sony PlayStation 5 Slim Gaming Console (Global Edition, Region Free)"},{"url":"https://www.startech.com.bd/sony-playstation-5-analog-console-slim-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-01-228x228.webp","title":"Sony PlayStation 5 Slim Gaming Console (UK Edition)","product_list_short_description":["Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Out Of Stock","code":"32752","brand":"Sony","product_page_short_description":["Model: PlayStation 5 Slim","Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"emi_price":0,"full_description":"<h2>Sony PlayStation 5 Gaming Console Slim Edition</h2><p>The Sony <strong>PlayStation 5 Console Slim Edition</strong> opens up hitherto unimagined gaming possibilities. With the support of haptic feedback, adaptive triggers, 3D audio, and an ultra-high-speed SSD, enjoy lightning-fast loading times as well as deeper immersion. Plus, enjoy an outstanding selection of new PlayStation titles. Feel the effects and impact of your in-game activities through dynamic sensory feedback by using the DualSense wireless controller. Immersive adaptive triggers with dynamic resistance levels imitate the physical impact of in-game activities in certain PS5 titles. Explore four worlds, each with creative gameplay that makes use of the varied characteristics of the DualSense wireless controller, in this game included with the PS5 Digital Edition console.</p><h3>Ultra-High-Speed 1TB SSD Storage</h3><p>With 1TB of SSD storage built in, you can have your favorite games ready and waiting for you to pick them up and play. Get the most out of your play sessions with almost instantaneous PS5 game loads. Over 4,000 PS4 titles are compatible with the PS5 system. You may even experience quicker and more fluid frame rates in some of the best PS4 with the Game Boost function.</p><h3>Slim Design</h3><p>Get modern gaming technology housed in a stylish, small console with the Sony PS5 Slim Console. Because of the PS5 console's unique system integration, developers can now instantly retrieve data from the SSD and construct games in a way that was before unattainable.</p><h3>Up to 120fps with 120Hz Output</h3><p>With compatibility for 120Hz output on 4K TVs, experience fluid and smooth high-frame rate gaming at up to 120 frames per second. With individually simulated light beams producing lifelike shadows and reflections in compatible PS5 games, you can fully immerse yourself in settings with incredible realism. Enjoy your favorite PS5 Digital Edition Slim on your gorgeous 4K television. Playing PS5 games on an HDR TV brings the games' incredibly vivid and realistic color palette to life.</p><h3>3D AudioTech</h3><p>Enter environments where noises seem to be coming from all directions. Games that support Tempest 3D AudioTech make your environment seem very real. With individually simulated light beams producing lifelike shadows and reflections in compatible PS5 games, you can fully immerse yourself in settings with incredible realism.</p><h2>Buy Sony PlayStation 5 Gaming Console Slim Edition From Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation 5 Gaming Console Slim Edition</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/play-station\" target=\"\" style=\"\">Sony Gaming Console</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Sony PlayStation 5 Console Slim Edition comes with no warranty.</p><p><span style=\"background-color: yellow; font-weight: bold;\">*** Vertical Stand Sold Separately</span></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PS5 Slim Console in Bangladesh?","paragraph":"The latest price of Sony PS5 Slim Console in Bangladesh is 75,000৳. You can buy the Sony PS5 Slim Console at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-04-500x500.webp"],"product_seo_title":"Sony PlayStation 5 Slim Console Price in Bangladesh | Star Tech","product_seo_description":"Buy Sony PlayStation 5 Slim Gaming Console at best price in Bangladesh. Order latest Sony PS5 Slim Console from Star Tech Shop for delivery in BD.","product_seo_keywords":"Sony PlayStation 5 Gaming Console Slim Edition, Sony PS5 Slim Console"},{"url":"https://www.startech.com.bd/sony-playstation-5-slim-console-gulf-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-01-228x228.webp","title":"Sony PlayStation 5 Slim Gaming Console (Gulf Edition)","product_list_short_description":["Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"price_new":89900,"price_old":120900,"price_single":89900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"35792","brand":"Sony","product_page_short_description":["MPN: CFI-1216A","Model: PlayStation 5 Slim","Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"emi_price":11083,"full_description":"<h2>Sony PlayStation 5 Slim Gaming Console (Gulf Edition)</h2><p>The Sony <strong>PlayStation 5</strong> <a href=\"https://www.startech.com.bd/gaming-console\" target=\"\" style=\"color: rgb(0, 0, 0);\">Console </a>offers gaming opportunities never before possible. Get faster loading times and greater immersion thanks to haptic feedback, adaptive triggers, 3D audio, and a very fast SSD. Plus, take advantage of a fantastic assortment of brand-new PlayStation games. Using the DualSense wireless controller, you can experience dynamic sensory input that lets you feel the results and impact of your in-game activity. In some PS5 games, immersive adaptive triggers mimic the physical repercussions of in-game activities with dynamic resistance levels. Included with the <strong>PS5</strong> Digital Edition system, this game allows you to explore four different worlds and features inventive gameplay that utilizes the unique features of the DualSense wireless controller. Having 1TB of SSD storage integrated into the PS5 Console means that your favorite games will always be available and waiting for you to pick them up and play. Play sessions will be more enjoyable thanks to the PS5's very quick game loading. The PS5 system is compatible with more than 4,000 PS4 games. With the Game Boost feature, you might even notice faster and smoother frame rates in some of the top PS4 titles. Experience seamless and silky high-frame-rate gameplay at up to 120 frames per second thanks to compatibility with 120Hz output on 4K TVs. You may completely immerse yourself in environments with remarkable realism in compatible PS5 games thanks to individually simulated light beams that produce genuine shadows and reflections. </p><h3>Slim Design</h3><p>The Sony <strong>PlayStation 5</strong> Slim Console offers cutting-edge gaming technology contained in a fashionable, compact console. Developers may now rapidly extract data from the SSD and create games in a way that was before unreachable thanks to the PS5 console's unique system integration.</p><h2>Buy Sony PlayStation 5 Slim Gaming Console (Gulf Edition) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation 5 Slim Gaming Console (Gulf Edition)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/play-station\" target=\"\">Sony Gaming Console</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\" style=\"\">Star Tech Shop</a> to get yours at lowest price. The Sony PlayStation 5 Slim Gaming Console (Gulf Edition) comes with 1 year service warranty.</p><p><span style=\"background-color: yellow; font-weight: bold;\">*** Vertical Stand Sold Separately</span></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PS5 Slim Gaming Console in Bangladesh?","paragraph":"The latest price of Sony PS5 Slim Gaming Console in Bangladesh is 89,900৳. You can buy the Sony PS5 Slim Gaming Console at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-04-500x500.webp"],"product_seo_title":"Sony PlayStation 5 Slim Gaming Console Price in Bangladesh | Star Tech","product_seo_description":"Buy Sony PlayStation 5 Slim Gaming Console at best price in Bangladesh. Latest Sony PS5 Slim Gaming Console available at Star Tech Shop. Order online for delivery in BD.","product_seo_keywords":"Sony PlayStation 5 Slim Gaming Console (Gulf Edition)"},{"url":"https://www.startech.com.bd/sony-playstation-5-slim-console-japan-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-01-228x228.webp","title":"Sony PlayStation 5 Slim Gaming Console (Japan Edition)","product_list_short_description":["Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"price_new":89900,"price_old":120900,"price_single":89900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"35793","brand":"Sony","product_page_short_description":["MPN: CFI-1200A","Model: PlayStation 5 Slim","Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"emi_price":11083,"full_description":"<h2>Sony PlayStation 5 Slim Gaming Console (Japan Edition)</h2><p>The Sony <strong>PlayStation 5</strong> <a href=\"https://www.startech.com.bd/gaming-console\" target=\"\" style=\"color: rgb(0, 0, 0);\">Console</a>'s haptic feedback, adaptive triggers, 3D audio, and lightning-fast SSD allow for gaming experiences never previously imaginable, faster loading times, and increased immersion. Enjoy a great selection of recently released PlayStation games as well. You can get dynamic sensory input with the DualSense wireless controller, which allows you to feel the effects and outcomes of your in-game actions. Immersive adaptive triggers with dynamic resistance levels imitate the physical effects of certain in-game behaviors in certain PS5 titles. This game, which comes with the <strong>PS5</strong> system, lets you explore four distinct worlds and has creative gameplay that makes use of the special capabilities of the DualSense wireless controller. The PS5 Console's 1TB SSD storage ensures that your favorite games are always accessible and just waiting for you to pick them up and play. Playtime will be enhanced by the PS5's lightning-fast game loading times. Over 4,000 PS4 titles are compatible with the PS5 system. You may even notice faster and more fluid frame rates in some of the best PS4 games when using the Game Boost option. Enjoy fluid and smooth gameplay at up to 120 frames per second because this game is compatible with 4K TVs that have 120Hz output. With compatible PS5 titles, you can fully immerse yourself in scenes with astounding realism thanks to individually simulated light beams that create real-world shadows and reflections.</p><h3>Slim Design</h3><p>The Sony <strong>PlayStation 5</strong> Slim Console is a stylish, small console that houses state-of-the-art gaming technology. Thanks to the PS5 console's unique system integration, developers can now quickly extract data from the SSD and create games in a way that was before unattainable.</p><h2>Buy Sony PlayStation 5 Slim Gaming Console (Japan Edition) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation 5 Slim Gaming Console (Japan Edition)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/play-station\" target=\"\">Sony Gaming Console</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\" style=\"\">Star Tech Shop</a> to get yours at lowest price. The Sony PlayStation 5 Slim Gaming Console (Japan Edition) comes with 1 year service warranty.</p><p><span style=\"background-color: yellow; font-weight: bold;\">*** Vertical Stand Sold Separately</span></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PS5 Gaming Console in Bangladesh?","paragraph":"The latest price of Sony PS5 Gaming Console in Bangladesh is 89,900৳. You can buy the Sony PS5 Gaming Console at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-04-500x500.webp"],"product_seo_title":"Sony PlayStation 5 Slim Console Price in Bangladesh | Star Tech","product_seo_description":"Buy Sony PlayStation 5 Slim Console at the best price in Bangladesh. Latest Sony PS5 Slim Gaming Console available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"Sony PlayStation 5 Slim Gaming Console (Japan Edition)"},{"url":"https://www.startech.com.bd/sony-playstation-hd-camera","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-hd-camera/playstation-hd-camera-01-228x228.webp","title":"Sony PlayStation HD Camera for PS5","product_list_short_description":["Dual Lenses for 1080p Capture","USB Type-A Connector, Built-in Stand","Background Removal Tools","Compatible with PlayStation 5"],"price_new":0,"price_old":0,"price_single":7500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"35489","brand":"Sony","product_page_short_description":["Model: PlayStation HD Camera","Dual Lenses for 1080p Capture","USB Type-A Connector, Built-in Stand","Background Removal Tools","Compatible with PlayStation 5"],"emi_price":675,"full_description":"<h2>Sony PlayStation HD Camera for PS5</h2><p>The Sony PlayStation <strong>HD Camera</strong> is a multifunctional gadget that can improve your gaming experience on the PlayStation 5 console. As you experience your most thrilling gaming moments, use the camera's two wide-angle lenses to capture yourself in fluid, clear full-HD. Easily record or broadcast yourself while playing by using the create button on your DualSense wireless controller. Setup is easy and quick thanks to the built-in stand and handy USB Type-A connector. With the HD camera's integrated, adjustable stand, you can capture the ideal shot. The camera's small size allows it to be safely placed above or below your television, allowing you to adjust the angle to fit your setup. You can easily add personalization to your movies and broadcasts with the help of the background removal tools for the Sony <a href=\"https://www.startech.com.bd/play-station\" target=\"\" style=\"color: rgb(0, 0, 0);\">PlayStation </a>HD Camera. Easily integrating with the PlayStation 5, this HD Camera offers smooth operation and increases the possibilities for gaming on the system. The Sony PlayStation HD Camera is a must-have accessory for any PlayStation 5 owner, whether you're streaming games, interacting with friends online, or making content. Utilize the PS5 console's integrated background removal features to take center stage in your creations. By using the HD camera, you can record gaming videos in picture-in-picture mode and include yourself in them. You can use your own green screen to totally obscure the background or cut it out completely.</p><h2>Buy Sony PlayStation HD Camera for PS5 from Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation HD Camera for PS5</strong> From Star Tech. We have a large collection of latest Sony PlayStation Camera to purchase for your <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Sony PlayStation HD Camera for PS5 comes with comes with no warranty</p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PlayStation HD Camera in Bangladesh?","paragraph":"The latest price of Sony PlayStation HD Camera in Bangladesh is 7,500৳. You can buy the Sony PlayStation HD Camera at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-hd-camera/playstation-hd-camera-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-hd-camera/playstation-hd-camera-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-hd-camera/playstation-hd-camera-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-hd-camera/playstation-hd-camera-04-500x500.webp"],"product_seo_title":"Sony PlayStation HD Camera for PS5 Price in Bangladesh | Star Tech","product_seo_description":"Buy Sony PlayStation HD Camera for PS5 at the best price in Bangladesh. Latest Sony PlayStation HD Camera available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"Sony PlayStation HD Camera for PS5"},{"url":"https://www.startech.com.bd/sony-playstation-5-digital-edition-slim-gaming-console-japan-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-digital-edition-slim/playstation-5-digital-edition-slim-001-228x228.webp","title":"Sony PlayStation 5 Digital Edition Slim Gaming Console (Japan Edition)","product_list_short_description":["Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech"],"price_new":0,"price_old":0,"price_single":69900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"32741","brand":"Sony","product_page_short_description":["Model: PlayStation 5","Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech"],"emi_price":6333,"full_description":"<h2>Sony PlayStation 5 Digital Edition Slim Gaming Console (Japan Edition)</h2><p>The Sony <strong>PlayStation 5</strong> Digital Edition Slim Gaming Console Japan Edition opens up hitherto unimagined gaming possibilities. With the support of haptic feedback, adaptive triggers, 3D audio, and an ultra-high-speed SSD, this PlayStation 5 allows you to enjoy lightning-fast loading times as well as deeper immersion. Plus, enjoy an outstanding selection of new PlayStation titles. Feel the effects and impact of your in-game activities through dynamic sensory feedback by using the DualSense wireless controller with this PlayStation 5. Immersive adaptive triggers with dynamic resistance levels imitate the physical impact of in-game activities in certain PlayStation 5 titles. Explore four worlds, each with creative gameplay that makes use of the varied characteristics of the DualSense wireless controller, in this game included with the PS5 Digital Edition console.</p> <h3>Slim Design</h3><p>Get modern gaming technology housed in a stylish, small console with the PlayStation 5 Digital Edition Slim. Because of the PS5 console's unique system integration, developers can now instantly retrieve data from the SSD and construct games in a way that was before unattainable.</p><h3>Ultra-High-Speed 1TB SSD Storage</h3><p>With 1TB of SSD storage built in, you can have your favorite games ready and waiting for you to pick them up and play. Get the most out of your play sessions with almost instantaneous PlayStation 5 game loads. Over 4,000 PS4 titles are compatible with the PS5 system. You may even experience quicker and more fluid frame rates in some of the best PS4 with the Game Boost function.</p><h3>Up to 120fps with 120Hz output</h3><p>With compatibility for 120Hz output on 4K TVs, experience fluid and smooth high-frame rate gaming at up to 120 frames per second. With individually simulated light beams producing lifelike shadows and reflections in compatible PlayStation 5 games, you can fully immerse yourself in settings with incredible realism. Enjoy your favorite PS5 Digital Edition Slim&nbsp;on your gorgeous 4K television. Playing PS5 games on an HDR TV brings the games' incredibly vivid and realistic color palette to life.</p><h3>3D AudioTech</h3><p>Enter environments where noises seem to be coming from all directions. Games that support Tempest 3D AudioTech make your environment seem very real. With individually simulated light beams producing lifelike shadows and reflections in compatible PlayStation 5 games, you can fully immerse yourself in settings with incredible realism.</p><h2>Buy Sony PlayStation 5 Digital Edition Slim Gaming Console (Japan Edition) From Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation 5 Digital Edition Slim Gaming Console (Japan Edition)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/play-station\" target=\"\">Sony Gaming Console</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop </a>to get yours at lowest price. The Sony PlayStation 5 Digital Edition Slim Gaming Console (Japan Edition) comes with no warranty.</p><p><span style=\"font-size: 12px; font-weight: bold; background-color: yellow;\">**Vertical Stand Sold Separately</span><br></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PlayStation 5 Digital Edition Slim Gaming Console in Bangladesh?","paragraph":"The latest price of Sony PlayStation 5 Digital Edition Slim Gaming Console in Bangladesh is 69,900৳. You can buy the Sony PlayStation 5 Digital Edition Slim Gaming Console at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-digital-edition-slim/playstation-5-digital-edition-slim-001-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-digital-edition-slim/playstation-5-digital-edition-slim-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-digital-edition-slim/playstation-5-digital-edition-slim-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-digital-edition-slim/playstation-5-digital-edition-slim-04-500x500.webp"],"product_seo_title":"Sony PlayStation 5 Digital Edition Slim Gaming Console Price in Bangladesh","product_seo_description":"Buy Sony PlayStation 5 Digital Edition Slim Gaming Console at best price in Bangladesh. Order latest PlayStation 5 Digital Edition Slim Gaming Console Japan Edition from Star Tech Shop for delivery in BD.","product_seo_keywords":"Sony PlayStation 5 Digital Edition Slim Gaming Console (Japan Edition)"},{"url":"https://www.startech.com.bd/sony-vertical-console-stand-for-ps5","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/vertical-stand/vertical-stand-01-228x228.webp","title":"Sony Vertical Console Stand for PS5","product_list_short_description":["Premium Metal Stand, Rubber Padding","Stand PS5 Console Horizontally In Style","Material: Hard Plastic Center and Metal Ring","Compatible PS5 Models: PS5 CFI-1000, PS5 CFI-2000"],"price_new":0,"price_old":0,"price_single":7500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"32745","brand":"Sony","product_page_short_description":["Model: Vertical Stand","Premium Metal Stand, Rubber Padding","Stand PS5 Console Horizontally In Style","Material: Hard Plastic Center and Metal Ring","Compatible PS5 Models: PS5 CFI-1000, PS5 CFI-2000"],"emi_price":675,"full_description":"<h2>Sony Vertical Console Stand for PS5</h2><p>The Sony <strong>Vertical Stand</strong> for PS5 Consoles will keep your console upright and secure. Stand your PS5 console horizontally in style. the ideal addition to complete your gaming system. By safely holding your PS5 console vertically and highlighting its iconic design, this legally licensed stand frees up valuable shelf or entertainment center space. The <strong>Sony PS5 Vertical Console Stand</strong> keeps your PS5 steady and safe thanks to its strong metal ring and long-lasting hard plastic center. Your console won't tip over or slide thanks to the non-slip grip offered by the rubber cushioning on the stand. Placing your PS5 vertically encourages the best possible circulation around it, which helps to dissipate heat and avoid overheating. This prolongs the life and performance of your console. The Sony Vertical Console Stand is the ideal complement to your PS5 gaming setup thanks to its elegant appearance and safe operation. With this official device, you may raise your console, improve airflow, and conserve space.</p><h3>How to Attach the Vertical Stand to PS5 CFI-2000 Slim Console</h3><p>Before attaching the stand, place your console on a soft cloth that has been spread out across a level area. Navigate to the control center, then choose Power &gt; Switch Off PS5. The power indicator flashes white before turning off, and the screen goes black. After positioning the PS5 console so that the back is facing up, take off the screw cap. Fit the screw cap onto the stand's screw hole (designed with a triangle and circle).  Using your hand, align the stand's screw hole (designed with a cross and square) with the console's screw hole and tighten it with the mounting screw. To tighten the screw, you can alternatively use a penny.</p><h3>How to Attach the Vertical Stand to PS5 CFI-1000 Console</h3><p>Before attaching the stand, place your console on a soft cloth that has been spread out across a level area. Navigate to the control center, then choose Power &gt; Switch Off PS5. The power indicator flashes white before turning off, and the screen goes black. Fasten the stand's attachment. Place the attachment in the stand's elevated section. After positioning the PS5 console so that the back is facing up, take off the screw cap. Fit the screw cap onto the stand's screw hole (designed with a cross and square). To tighten the screw, you can alternatively use a penny. Align the stand's screw hole (designated with a triangle and circle) with the console's screw hole, and then use your hand to tighten the mounting screw. To tighten the screw, you can alternatively use a penny.</p><h2>Buy Sony Vertical Console Stand for PS5 From Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony Vertical Console Stand for PS5</strong> From Star Tech. We have a large collection of latest Sony Console Stand to purchase for your <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/play-station\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Sony Vertical Console Stand for PS5 comes with no warranty.</p><p><span style=\"font-weight: bold; background-color: yellow;\">*** PS5 Not Included, Only Stand</span></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony Vertical Console Stand for PS5 in Bangladesh?","paragraph":"The latest price of Sony Vertical Console Stand for PS5 in Bangladesh is 7,500৳. You can buy the Sony Vertical Console Stand for PS5 at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/vertical-stand/vertical-stand-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/vertical-stand/vertical-stand-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/vertical-stand/vertical-stand-03-500x500.webp"],"product_seo_title":"Sony Vertical Console Stand for PS5 Price in Bangladesh | Star Tech","product_seo_description":"Buy Sony Vertical Console Stand for PS5 at best price in Bangladesh. Latest Sony Vertical Console Stand for PS5 available at Star Tech. Order Online for delivery in BD.","product_seo_keywords":"Sony Vertical Console Stand for PS5"},{"url":"https://www.startech.com.bd/sony-playstation-5-console-two-dualsense-controllers-bundle","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-console-two-dualsense-controllers-bundle/playstation-5-console-two-controllers-bundle-01-228x228.webp","title":"Sony PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle (Japan Edition)","product_list_short_description":["Ultra-High Speed SSD","Ray Tracing, 4K-TV Gaming","Tempest 3D AudioTech","Adaptive Triggers"],"price_new":0,"price_old":0,"price_single":82000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"34027","brand":"Sony","product_page_short_description":["Model: PlayStation 5","Ultra-High Speed SSD","Ray Tracing, 4K-TV Gaming","Tempest 3D AudioTech","Adaptive Triggers"],"emi_price":7517,"full_description":"<h2>Sony PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle (Japan Edition)</h2><p>The Sony <strong>PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle</strong> provides lightning-fast loading thanks to an ultra-high-speed SSD, deeper immersion thanks to haptic feedback, adaptive triggers, and 3D audio, and an all-new generation of fantastic PlayStation titles. With almost instantaneous startup times for installed PS5 titles, the Sony PlayStation 5 Gaming Console maximizes your gaming sessions. With supported PS5 titles, you may experience worlds with an unprecedented level of realism thanks to the individual simulation of light beams that produce realistic shadows and reflections. Use your gorgeous 4K TV to play your favorite PS5 games. Take in soundscapes that give the impression that noise is coming from all directions. In games that feature Tempest 3D AudioTech, your surroundings come to life through your compatible headphones. In certain PS5 games, you can use the DualSense wireless controller to receive haptic feedback. Dynamic sensory feedback allows you to feel the impact and results of your actions in-game. Learn to use immersive adaptive triggers, which in some PS5 games have dynamic resistance levels that mimic the physical effects of in-game activities. The Sony PlayStation 5 <a href=\"https://www.startech.com.bd/gaming-console\" target=\"\" style=\"color: rgb(0, 0, 0);\">Gaming Console</a> Bundle combines cutting-edge technology and high-performance features to deliver an immersive gaming experience. Two DualSense Wireless Controllers are included in this set, so players may start playing cooperative games right away. With its formidable technology, the PlayStation 5 machine can provide amazing graphics, fluid gameplay, and blazingly quick loading times. Its cutting-edge SSD storage allows players to jump between games and explore huge open worlds without missing a beat. The DualSense controllers improve responsiveness and immersion in games with their novel haptic feedback and adjustable triggers. This bundle offers all the essentials for an exciting gaming experience in the upcoming console generation, whether you want to play blockbuster games or compete online with others.</p><h2>Buy Sony PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle (Japan Edition) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle (Japan Edition)</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/play-station\" target=\"\">Sony Gaming Console</a> to purchase for your <a href=\"https://www.startech.com.bd/gaming\" target=\"\">Gaming</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Sony PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle (Japan Edition) comes with no warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle in Bangladesh?","paragraph":"The latest price of PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle in Bangladesh is 82,000৳. You can buy the PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-console-two-dualsense-controllers-bundle/playstation-5-console-two-controllers-bundle-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-console-two-dualsense-controllers-bundle/playstation-5-console-two-controllers-bundle-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-console-two-dualsense-controllers-bundle/playstation-5-console-two-controllers-bundle-03-500x500.webp"],"product_seo_title":"Sony PlayStation 5 Console With Two DualSense Controllers Bundle Price in BD","product_seo_description":"Buy Sony PlayStation 5 Console With Two DualSense Controllers Bundle at best price in Bangladesh. Latest PlayStation 5 Console Bundle available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Sony PlayStation 5 Gaming Console With Two DualSense Wireless Controllers Bundle (Japan Edition)"},{"url":"https://www.startech.com.bd/vertux-powerbase-ps5-dualdock-charging-hub","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/vertux/powerbase-ps5-01-228x228.webp","title":"Vertux PowerBase-PS5 DualDock Charging Hub For PS5 DualSense Controller","product_list_short_description":["Dual Charging Slots","Quick Docking Design","Input: 5V/2A, Output: 5.94V, 900mA","LED Charging Indicators"],"price_new":0,"price_old":0,"price_single":2990,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"23875","brand":"Vertux","product_page_short_description":["Model: PowerBase-PS5","Dual Charging Slots","Quick Docking Design","Input: 5V/2A, Output: 5.94V, 900mA","LED Charging Indicators"],"emi_price":274,"full_description":"<h2>Vertux PowerBase-PS5 DualDock Charging Hub For PS5 DualSense Controller</h2><p>The Vertux PowerBase-PS5 will enable you to always have a charged and prepared DualSense controller. Utilize two USB ports more efficiently by charging two controllers at once without attaching them to your console. Once docked, you may leave the controllers to charge whenever it's convenient for you. PowerBase-PS5 keeps you refueled and prepared to go. The Vertux PowerBase-PS5 DualDock Charging Hub comes with a 02-Year replacement warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Vertux PowerBase-PS5 DualDock Charging Hub in Bangladesh?","paragraph":"The latest price of Vertux PowerBase-PS5 DualDock Charging Hub in Bangladesh is 2,990৳. You can buy the Vertux PowerBase-PS5 DualDock Charging Hub at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/vertux/powerbase-ps5-01-500x500.webp"],"product_seo_title":"Vertux PowerBase-PS5 DualDock Charging Hub Price in Bangladesh","product_seo_description":"Buy Vertux PowerBase-PS5 DualDock Charging Hub at the best price in BD. Latest Vertux Charging Hub available at Star Tech.Order online & get delivery anywhere in BD.","product_seo_keywords":"Vertux PowerBase-PS5 DualDock Charging Hub For PS5 DualSense Controller"},{"url":"https://www.startech.com.bd/sony-playstation-5-dualsense-charging-station","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-charging-station/dualsense-charging-station-228x228.jpg","title":"Sony PlayStation 5 DualSense Charging Station","product_list_short_description":["Compatible with PS5","Charge two controllers","Free up USB ports","Click-in design"],"price_new":0,"price_old":0,"price_single":5000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"20353","brand":"Sony","product_page_short_description":["Model: DualSense Charging Station","Compatible with PS5","Charge two controllers","Free up USB ports","Click-in design"],"emi_price":458,"full_description":"<h2 style=\"text-align: justify; \">Sony PlayStation 5 DualSense Charging Station</h2><p style=\"text-align: justify; \">The Sony DualSense Charging Station is compatible with PlayStation 5. With this charging station, you can charge up to two DualSense wireless controllers at the same time and dock them quickly and easily with the charging station's click-in design. Your controllers charge as quickly as when connected to your PS5 console. So you can free up USB ports without sacrificing performance. The DualSense wireless controllers are sold separately. The Sony PS5 DualSense Charging Station comes with no warranty.</p><p style=\"text-align: justify; \"><span style=\"font-weight: bold; background-color: yellow;\">Safety Tip: When charging your Sony PlayStation 5 DualSense Charging Station, use only with an electric power source. Be cautious not to overcharge, as prolonged connection may lead to overheating. Follow the recommended charging times for a safe and optimal experience.</span><br></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PS5 DualSense Charging Station in Bangladesh?","paragraph":"The latest price of Sony PS5 DualSense Charging Station in Bangladesh is 5,000৳. You can buy the Sony PS5 DualSense Charging Station at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-charging-station/dualsense-charging-station-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-charging-station/dualsense-charging-station-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-charging-station/dualsense-charging-station-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-charging-station/dualsense-charging-station-04-500x500.jpg"],"product_seo_title":"Sony PlayStation 5 DualSense Charging Station Price in Bangladesh","product_seo_description":"Buy Sony PlayStation 5 DualSense Charging Station at best price in Bangladesh. Latest Sony PS5 Charging Station available at Star Tech. Order online & get delivery in BD.","product_seo_keywords":"Sony PlayStation 5 DualSense Charging Station"},{"url":"https://www.startech.com.bd/sony-playstation-5-media-remote","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/media-remote/media-remote-01-228x228.jpg","title":"Sony PlayStation 5 Media Remote","product_list_short_description":["Dedicated app buttons: Disney+, Netflix, Spotify, and YouTube","Built-in media playback controls","Seamless console compatibility","Compatible TVs with the built-in IR transmitter"],"price_new":0,"price_old":0,"price_single":4500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"20354","brand":"Sony","product_page_short_description":["Model: Media Remote","Dedicated app buttons: Disney+, Netflix, Spotify, and YouTube","Built-in media playback controls","Seamless console compatibility","Compatible TVs with the built-in IR transmitter"],"emi_price":397,"full_description":"<h2 style=\"text-align: justify; \">Sony PlayStation 5 Media Remote</h2><p style=\"text-align: justify; \">The Sony PlayStation 5 Media Remote lets you conveniently navigate entertainment on your PlayStation5 console with intuitive media and TV controls. It comes with dedicated app buttons. You can very easily launch Disney+, Netflix, Spotify, and YouTube at the push of a button, even when the console is powered off. It comes with built-in play/pause, fast forward, and fast reverse buttons. So you can quickly navigate media. Power on your PS5 console and navigate its menus directly with the remote for ultimate convenience. You can also adjust the volume and power settings of compatible TVs with the built-in IR transmitter. The Sony PlayStation 5 Media Remote comes with no warranty.</p><div class=\"video-wrapper\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/0vo0iEmThCQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe> </div>","specifications":[],"latest_price":{"heading":"What is the price of Sony PlayStation 5 Media Remote in Bangladesh?","paragraph":"The latest price of Sony PlayStation 5 Media Remote in Bangladesh is 4,500৳. You can buy the Sony PlayStation 5 Media Remote at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/media-remote/media-remote-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/media-remote/media-remote-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/media-remote/media-remote-03-500x500.jpg"],"product_seo_title":"Sony PlayStation 5 Media Remote Price in Bangladesh | Star Tech","product_seo_description":"Buy Sony PlayStation 5 Media Remote at best price in Bangladesh. Latest Sony PlayStation 5 Media Remote available at Star Tech. Order online, get delivery anywhere in BD.","product_seo_keywords":"Sony PlayStation 5 Media Remote"},{"url":"https://www.startech.com.bd/ps4-dualshock-4-controller","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/ps4-dualshock-4-228x228.jpg","title":"PS4 DualShock 4 Wireless Controller Black (Original)","product_list_short_description":["SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers","Motion sensors, Stereo headset jack"],"price_new":0,"price_old":0,"price_single":6900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"14561","brand":"Sony","product_page_short_description":["MPN: CUH-ZCT2E/CUH-ZCT2G","Model: PS4 Dualshock 4","SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers","Motion sensors, Stereo headset jack"],"emi_price":593,"full_description":"<h2>PS4 DualShock 4 Wireless Controller Black (Original)  <br></h2>\n<p>Stay classy with a selection of timeless classic colours returning to the DUALSHOCK 4 wireless controller range. Capture and show off your finest moments with just the push of a button. Upload gameplay videos and screenshots directly from your PS4 system or livestream your gameplay, all without disturbing your in-progress game. Get even more precise control with the built-in touch pad that now shows the unique light bar, adding an extra dimension to your games. Get the edge with a much tighter sense of control over in-game actions. See even more of your games with the integrated light bar that glows with various colours depending on in-game action - now visible on the touch pad. Bring your games to life and hear every detail with sound effects coming directly from your DUALSHOCK 4 wireless controller. Listen to your games in private and hear every boom, bang and blast with an integrated 3.5mm audio jack for your headphones. Rock and roll as a highly sensitive built-in accelerometer and gyroscope detect the motion, tilt and rotation of your DUALSHOCK 4 wireless controller. Charge the controller's internal battery from your PS4 USB port, giving you hassle-free charging as you play.<br></p>\n<div class=\"video-wrapper\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/uQXN3Azvq9E\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></div>","specifications":[],"latest_price":{"heading":"What is the price of PS4 Dualshock 4 Controller in Bangladesh?","paragraph":"The latest price of PS4 Dualshock 4 Controller in Bangladesh is 6,900৳. You can buy the PS4 Dualshock 4 Controller at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/ps4-dualshock-4-500x500.jpg"],"product_seo_title":"PS4 Dualshock 4 Controller Price in Bangladesh","product_seo_description":"Buy PS4 DualShock 4 Wireless Controller Black (Original)   at best price in Bangladesh. Order online or visit your nearest Star tech branch","product_seo_keywords":"PS4 DualShock 4 Wireless Controller Black (Original)  "},{"url":"https://www.startech.com.bd/ps4-dualshock-4-wireless-controller-midnight-blue","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-b-01-228x228.jpg","title":"PS4 Dualshock 4 Wireless Controller Midnight Blue (Original)","product_list_short_description":["Motion sensors, Stereo headset jack","SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers"],"price_new":0,"price_old":0,"price_single":6700,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"16198","brand":"Sony","product_page_short_description":["MPN: CUH-ZCT2E","Model: Dualshock 4","Motion sensors, Stereo headset jack","SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers"],"emi_price":614,"full_description":"<h2 style=\"text-align: justify; \">PS4 Dualshock 4 Wireless Controller Midnight Blue (Original)</h2>\n\n<p style=\"text-align: justify; \">Stay classy with a selection of timeless classic colours returning to the DUALSHOCK 4 wireless controller range. Capture and show off your finest moments with just the push of a button. Upload gameplay videos and screenshots directly from your PS4 system or livestream your gameplay, all without disturbing your in-progress game. \n</p>\n<p style=\"text-align: justify; \">The latest PS4 Dualshock 4 Controller featured with Precision Control offering players absolute control over all of their games, Sharing at Your Fingertips: The SHARE button allows you to upload gameplay videos and screenshots or live-stream your gameplay while the game is in progress. This controller has different kind of uniqe Features like the touch pad, integrated light bar, and built-in speaker offer new ways to experience and interact with your games. Get even more precise control with the built-in touch pad that now shows the unique light bar, adding an extra dimension to your games. Get the edge with a much tighter sense of control over in-game actions. See even more of your games with the integrated light bar that glows with various colours depending on in-game action - now visible on the touchpad. \n</p>\n<p style=\"text-align: justify; \">Bring your games to life and hear every detail with sound effects coming directly from your DUALSHOCK 4 wireless controller. Listen to your games in private and hear every boom, bang, and blast with an integrated 3.5mm audio jack for your headphones. Rock and roll as a highly sensitive built-in accelerometer and gyroscope detect the motion, tilt and rotation of your DUALSHOCK 4 wireless controller. Charge the controller's internal battery from your PS4 USB port, giving you hassle-free charging as you play. This PS4 Dualshock 4 Wireless Controller has no warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-b-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-b-04-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-b-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-b-02-500x500.jpg"],"product_seo_title":"PS4 Dualshock 4 Controller Midnight Blue Price in Bangladesh","product_seo_description":"Buy PS4 Dualshock 4 Wireless Controller Midnight Blue (Original) at the best price in Bangladesh, purchase your favorite PS4 Controller from our shop. Order online or visit your nearest Star Tech branch.\n","product_seo_keywords":"PS4 Dualshock 4 Wireless Controller Midnight Blue (Original)"},{"url":"https://www.startech.com.bd/ps4-dualshock-4-wireless-controller-green-camouflage","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-g-01-228x228.jpg","title":"PS4 Dualshock 4 Wireless Controller Green Camouflage (Original)","product_list_short_description":["Motion sensors, Stereo headset jack","SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers"],"price_new":0,"price_old":0,"price_single":6900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"16200","brand":"Sony","product_page_short_description":["MPN: CUH-ZCT2E","Model: Dualshock 4","Motion sensors, Stereo headset jack","SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers"],"emi_price":633,"full_description":"<h2 style=\"text-align: justify; \">PS4 Dualshock 4 Wireless Controller Green Camouflage (Original)</h2>\n\n<p style=\"text-align: justify; \">Stay classy with a selection of timeless classic colours returning to the DUALSHOCK 4 wireless controller range. Capture and show off your finest moments with just the push of a button. Upload gameplay videos and screenshots directly from your PS4 system or livestream your gameplay, all without disturbing your in-progress game. \n</p>\n<p style=\"text-align: justify; \">The latest PS4 Dualshock 4 Controller featured with Precision Control offering players absolute control over all of their games, Sharing at Your Fingertips: The SHARE button allows you to upload gameplay videos and screenshots or live-stream your gameplay while the game is in progress. This controller has different kind of uniqe Features like the touch pad, integrated light bar, and built-in speaker offer new ways to experience and interact with your games. Get even more precise control with the built-in touch pad that now shows the unique light bar, adding an extra dimension to your games. Get the edge with a much tighter sense of control over in-game actions. See even more of your games with the integrated light bar that glows with various colours depending on in-game action - now visible on the touchpad. \n</p>\n<p style=\"text-align: justify; \">Bring your games to life and hear every detail with sound effects coming directly from your DUALSHOCK 4 wireless controller. Listen to your games in private and hear every boom, bang, and blast with an integrated 3.5mm audio jack for your headphones. Rock and roll as a highly sensitive built-in accelerometer and gyroscope detect the motion, tilt and rotation of your DUALSHOCK 4 wireless controller. Charge the controller's internal battery from your PS4 USB port, giving you hassle-free charging as you play. This PS4 Dualshock 4 Wireless Controller has no warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-g-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-g-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-g-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-g-04-500x500.jpg"],"product_seo_title":"PS4 Dualshock 4 Controller Green Camouflage Price in Bangladesh","product_seo_description":"Buy PS4 Dualshock 4 Wireless Controller Green Camouflage (Original) at the best price in Bangladesh, purchase your favorite PS4 Controller from our shop. Order online or visit your nearest Star Tech branch.\n","product_seo_keywords":"PS4 Dualshock 4 Wireless Controller Green Camouflage (Original)"},{"url":"https://www.startech.com.bd/ps4-dualshock-4-controller-magma-red","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-magma-red-01-228x228.jpg","title":"PS4 DualShock 4 Wireless Controller Magma Red (Original)","product_list_short_description":["SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers","Motion sensors, Stereo headset jack"],"price_new":0,"price_old":0,"price_single":6900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"18980","brand":"Sony","product_page_short_description":["MPN: CUH-ZCT2E","Model: PS4 Dualshock 4","SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers","Motion sensors, Stereo headset jack"],"emi_price":593,"full_description":"<h2>PS4 DualShock 4 Wireless Controller Magma Red (Original)  <br></h2>\n\n\n<p>Stay classy with a selection of timeless classic colours returning to the DUALSHOCK 4 wireless controller range. Capture and show off your finest moments with just the push of a button. Upload gameplay videos and screenshots directly from your PS4 system or livestream your gameplay, all without disturbing your in-progress game. Get even more precise control with the built-in touch pad that now shows the unique light bar, adding an extra dimension to your games. Get the edge with a much tighter sense of control over in-game actions. See even more of your games with the integrated light bar that glows with various colours depending on in-game action - now visible on the touch pad. Bring your games to life and hear every detail with sound effects coming directly from your DUALSHOCK 4 wireless controller. Listen to your games in private and hear every boom, bang and blast with an integrated 3.5mm audio jack for your headphones. Rock and roll as a highly sensitive built-in accelerometer and gyroscope detect the motion, tilt and rotation of your DUALSHOCK 4 wireless controller. Charge the controller's internal battery from your PS4 USB port, giving you hassle-free charging as you play.<br></p>\n\n\n<div class=\"video-wrapper\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/uQXN3Azvq9E\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></div>","specifications":[],"latest_price":{"heading":"What is the price of PS4 Dualshock 4 Controller Magma Red in Bangladesh?","paragraph":"The latest price of PS4 Dualshock 4 Controller Magma Red in Bangladesh is 6,900৳. You can buy the PS4 Dualshock 4 Controller Magma Red at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-magma-red-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-magma-red-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-magma-red-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-magma-red-04-500x500.jpg"],"product_seo_title":"PS4 Dualshock 4 Wireless Controller Magma Red Price in Bangladesh","product_seo_description":"Buy PS4 DualShock 4 Wireless Controller Magma Red at best price in Bangladesh. Latest PS4 Controller available at Star Tech. Order online to get delivery anywhere in BD.","product_seo_keywords":"PS4 DualShock 4 Wireless Controller Magma Red (Original)  "},{"url":"https://www.startech.com.bd/playstation-5-console-cover","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-console-cover/ps5-cover-midnight-black-01-228x228.webp","title":"PlayStation 5 Console Cover","product_list_short_description":["Head Case Design, Easy to Use","Ultra-Thin and Super Lightweight","1x Matching DualSense Controller Cover","Compatible with PS5, PS5 Disc Edition"],"price_new":0,"price_old":0,"price_single":6900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"32516","brand":"Sony","product_page_short_description":["Model: PS5 Console Cover","Head Case Design, Easy to Use","Ultra-Thin and Super Lightweight","1x Matching DualSense Controller Cover","Compatible with PS5, PS5 Disc Edition"],"emi_price":633,"full_description":"<h2>PlayStation 5 Console Cover</h2><p>The <strong>PlayStation 5 Console Cover</strong>, Discover new gaming horizons with customized PS5 console covers. The only PS5 console covers created by PlayStation that are intended to meet your expectations for quality  With a wide variety of additional color options, you can customize your PlayStation 5 or PlayStation 5 Digital Edition media player. Separate sales are made for the DualSense wireless controller, console, and console cover. Just take out the white Sony PS5 console covers that came with it and click the new ones in. The only Sony PS5 console covers created by PlayStation that are intended to meet your expectations for quality Give your PS5 console a classy metallic sheen to enhance your gaming setting. Select from the fiery Volcanic Red, the seductive Cobalt Blue, or the elegant Sterling Silver, all of which are inspired by the potent colors found in the planet's depths. Use the Gray Camouflage PS5 console covers, which feature distinctive patterns inspired by the classic PlayStation Shapes, to update the look of your setup. The PS5 console cover and DualSense wireless controller have been redesigned with striking patterns and rhythmic hues by the LeBron James Limited Edition Collection, which is sure to inspire your game. </p><h2>Buy PlayStation 5 Console Cover From Star Tech</h2><p>In Bangladesh, you can get original <strong>PlayStation 5 Console Cover</strong> From Star Tech. We have a large collection of latest PlayStation Cover to Purchase for your <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The PlayStation 5 Console Cover comes no warranty.</p>","specifications":[{"heading":"Physical Specifications","values":[{"key":"Color","value":"Midnight Black"}]}],"latest_price":{"heading":"What is the price of PlayStation 5 Console Cover in Bangladesh?","paragraph":"The latest price of PlayStation 5 Console Cover in Bangladesh is 6,900৳. You can buy the PlayStation 5 Console Cover at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-console-cover/ps5-cover-midnight-black-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-console-cover/ps5-cover-midnight-black-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-console-cover/ps5-console-cover-midnight-black-003-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-console-cover/ps5-console-cover-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-console-cover/ps5-console-cover-02-500x500.webp"],"product_seo_title":"PlayStation 5 Console Cover Price in Bangladesh | Star Tech","product_seo_description":"Buy PlayStation 5 Console Cover at the best price in Bangladesh. Latest Sony PlayStation 5 Console Cover available at Star Tech Shop. Order Online for delivery in BD.","product_seo_keywords":"PlayStation 5 Console Cover"},{"url":"https://www.startech.com.bd/playstation-5-console-cover-god-of-war-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-cover/playstation-5-console-cover-god-of-war/playstation-5-console-cover-god-of-war-01-228x228.webp","title":"PlayStation 5 Console Cover God of War Edition","product_list_short_description":["Head Case Design, Easy to Use","Ultra-Thin and Super Lightweight","1x Matching DualSense Controller Cover","Compatible with PS5, PS5 Disc Edition"],"price_new":0,"price_old":0,"price_single":7500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"32983","brand":"Sony","product_page_short_description":["Model: PS5 Console Cover","Head Case Design, Easy to Use","Ultra-Thin and Super Lightweight","1x Matching DualSense Controller Cover","Compatible with PS5, PS5 Disc Edition"],"emi_price":688,"full_description":"<h2>PlayStation 5 Console Cover God of War Edition </h2><p> The PlayStation 5 Console Cover God of War Edition is a stunning mix of gaming gear and the vast, immersive God of War universe. This limited edition cover is a work of art, meticulously crafted to capture the essence of the iconic God of War franchise. The cover image is a work of art, presenting a dynamic representation of Kratos and Atreus in a visually appealing setting. Every aspect, from the characters' ferocious emotions to the exquisitely depicted legendary elements, has been meticulously examined to provide fans with a completely immersive and fascinating experience. This limited edition cover adds distinctive themed features to the PlayStation 5 hardware. The console itself is transformed into a work of art, with emblems and themes inspired by the God of War series adorning it. The combination of the PlayStation 5's incredible powers and the famous graphics of God of War produces a gaming experience that transcends the virtual environment. The God of War Edition PlayStation 5 Console Cover is an essential collector's piece, regardless of your level of devotion to the God of War series or your appreciation for the fusion of art and technology. It honors one of the most recognizable and cherished tales in gaming history in addition to celebrating the PlayStation 5's unmatched gaming experience. This limited edition cover is a sought-after addition to any enthusiast's collection and represents the changing dynamic between gaming and art. </p><h2>Buy PlayStation 5 Console Cover God of War Edition From Star Tech</h2><p>In Bangladesh, you can get original <strong>PlayStation 5 Console Cover God of War Edition</strong> From Star Tech. We have a large collection of latest PlayStation Cover to Purchase for your <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The PlayStation 5 Console Cover God of War Edition comes no warranty.<br><span style=\"font-weight: bold; background-color: yellow;\">*Only PlayStation 5 Console Cover</span></p>","specifications":[],"latest_price":{"heading":"What is the price of PlayStation 5 Console Cover God of War Edition in Bangladesh?","paragraph":"The latest price of PlayStation 5 Console Cover God of War Edition in Bangladesh is 7,500৳. You can buy the PlayStation 5 Console Cover God of War Edition at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-cover/playstation-5-console-cover-god-of-war/playstation-5-console-cover-god-of-war-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-cover/playstation-5-console-cover-god-of-war/playstation-5-console-cover-god-of-war-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/ps5-cover/playstation-5-console-cover-god-of-war/playstation-5-console-cover-god-of-war-03-500x500.webp"],"product_seo_title":"PlayStation 5 Console Cover God of War Edition Price in Bangladesh ","product_seo_description":"Buy PlayStation 5 Console Cover God of War Edition at best price in Bangladesh. Latest PlayStation 5 Console Cover available at Star Tech. Order online & get delivery in BD.","product_seo_keywords":"PlayStation 5 Console Cover God of War Edition "},{"url":"https://www.startech.com.bd/playstation-5-dualsense-controller","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-228x228.jpg","title":"PlayStation 5 DualSense Wireless Controller","product_list_short_description":["Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery","Integrated Speaker"],"price_new":0,"price_old":0,"price_single":8500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"15985","brand":"Sony","product_page_short_description":["MPN: CFI-ZCT1W","Model: PlayStation 5 DualSense","Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery","Integrated Speaker"],"emi_price":779,"full_description":"<h2 style=\"text-align: justify; \">PlayStation 5 DualSense Wireless Controller<br></h2>\n\n\n<p style=\"text-align: justify; \">The latest PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, dynamic adaptive triggers and a built-in microphone, all integrated into an iconic design. This Controller provides you physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. In your hands, This dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons. \n</p>\n\n<p style=\"text-align: justify; \">This new The DualSense wireless controller retains many DUALSHOCK 4 features, returning for a new generation of play. You can connecting a headset to the 3.5-mm jack and Easily switch off voice capture at a moment's notice with the dedicated mute button. This Wireless Controller has built-in battery (Charge and play, now via USB Type-C) and also this controller has Integrated speaker, so that you can Select games take on an extra dimension with higher-fidelity sound effects bursting from the controller. Here, It Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. It's Experience varying levels of force and tension as you interact with your in-game gear and environments. From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, feel physically connected to your on-screen actions. With the create button, you can Capture and broadcast. Building on the success of the pioneering SHARE button, \"create\" offers players more ways to produce gaming content and broadcast their adventures live to the world. Take control with an evolved, two-tone design that combines an iconic, intuitive layout with enhanced sticks and a reimagined light bar. This PlayStation 5 DualSense Wireless Controller has no warranty.</p>\n\n\n","specifications":[],"latest_price":{"heading":"What is the price of PlayStation 5 Controller in Bangladesh?","paragraph":"The latest price of PlayStation 5 Controller in Bangladesh is 8,500৳. You can buy the PlayStation 5 Controller at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-1-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-2-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-3-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-4-500x500.jpg"],"product_seo_title":"PlayStation 5 DualSense Controller Price in Bangladesh","product_seo_description":"Buy PlayStation 5 DualSense Wireless Controller at the best price in Bangladesh, Order online, or visit your nearest Star Tech branch.","product_seo_keywords":"PlayStation 5 DualSense Wireless Controller"},{"url":"https://www.startech.com.bd/playstation-5-dualsense-controller-midnight-black","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-01-228x228.jpg","title":"PlayStation 5 DualSense Wireless Controller - Midnight Black","product_list_short_description":["Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Midnight Black"],"price_new":0,"price_old":0,"price_single":8500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"18748","brand":"Sony","product_page_short_description":["MPN: CFI-ZCT1W","Model: PlayStation 5 DualSense","Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Midnight Black"],"emi_price":779,"full_description":"<h2 style=\"text-align: justify; \">PlayStation 5 DualSense Wireless Controller -&nbsp;Midnight Black<br></h2><p style=\"text-align: justify; \">The Latest PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, dynamic adaptive triggers, and a built-in microphone, all integrated into an iconic design. You will Discover a deeper gaming experienc1 with the innovative new PS5 controller. This PlayStation 5 DualSense Wireless Controller provides you physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. In your hands, These dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons.</p><h3 style=\"text-align: justify; \">Heighten Your Senses:</h3><p style=\"text-align: justify; \">The brand new PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, dynamic adaptive triggers, and This Controller has a built-in microphone, all integrated into an iconic design.</p><h3 style=\"text-align: justify; \">Bring gaming worlds to life: </h3><p style=\"text-align: justify; \">By using this Wireless controller, you will feel physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. These dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons that game will you play. This PlayStation 5 DualSense also featured Adaptive triggers. You will feel the experience of varying levels of force and tension as you interact with your in-game gear and environments. When you playing racing type game, From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, and you will feel physically connected to your on-screen actions.</p><h3 style=\"text-align: justify; \">Built-in microphone, Battery, and headset jack:</h3><p style=\"text-align: justify; \">This PlayStation 5 DualSense Wireless Controller has a Built-in microphone and a 3.5mm headset jack. So that, you can Chat with friends online using the built-in microphone or by connecting a headset to the 3.5mm jack. Easily switch off voice capture at a momentâ€™s notice with the dedicated mute button. This Wireless Controller has a built-in battery (Charge and play, now via USB Type-C) and also this controller has an Integrated speaker so that you can Select games that take on an extra dimension with higher-fidelity sound effects bursting from the controller. </p><h3 style=\"text-align: justify; \">Create button:</h3><p style=\"text-align: justify; \">When you using this PlayStation 5 DualSense Wireless Controller, you can capture and broadcast your most epic gaming moments with the create button. Building on the success of the pioneering SHARE button, â€œcreateâ€� offers players more ways to produce gaming content and broadcast their adventures live to the world.</p><h3 style=\"text-align: justify; \">Familiar features:</h3><p style=\"text-align: justify; \">The DualSense wireless controller retains many DUALSHOCK 4 for a new generation of play. This PlayStation 5 DualSense Wireless Controller has a Built-in battery ( Charge and play, now via USB Type-C ). The DualSense Wireless Controller has an integrated speaker. The PlayStation 5 DualSense Wireless Controller featured with Motion sensor, It is also Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope.</p><p style=\"text-align: justify; \">This Latest DualSense wireless controller retains many DUALSHOCK 4 features, returning for a new generation of play. With this DualSense wireless controller can connect a headset to the 3.5-mm jack and Easily switch off voice capture at a moment's notice with the dedicated mute button. Here, It Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. It's Experience varying levels of force and tension as you interact with your in-game gear and environments. From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, feel physically connected to your on-screen actions. This PlayStation 5 DualSense Wireless Controller has no warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-04-500x500.jpg"],"product_seo_title":"PlayStation 5 DualSense Controller Midnight Black Price in Bangladesh","product_seo_description":"Buy PlayStation 5 DualSense Controller Midnight Black at best price in BD.Latest PlayStation Controller available at Star Tech.Order online & get delivery anywhere in BD.","product_seo_keywords":"PlayStation 5 DualSense Wireless Controller - Midnight Black"},{"url":"https://www.startech.com.bd/playstation-5-dualsense-controller-cosmic-red","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-10-228x228.jpg","title":"PlayStation 5 DualSense Wireless Controller - Cosmic Red","product_list_short_description":["Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Cosmic Red"],"price_new":0,"price_old":0,"price_single":8500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"18749","brand":"Sony","product_page_short_description":["MPN: CFI-ZCT1W","Model: PlayStation 5 DualSense","Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Cosmic Red"],"emi_price":779,"full_description":"<h2 style=\"text-align: justify; \">PlayStation 5 DualSense Wireless Controller -&nbsp;Cosmic Red<br></h2><p style=\"text-align: justify; \">The Latest PlayStation 5 DualSense Wireless Controller - Cosmic Red offers immersive haptic feedback, dynamic adaptive triggers, and a built-in microphone, all integrated into an iconic design. You will Discover a deeper gaming experienc1 with the innovative new PS5 controller. In your hands, These dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons. This Latest PlayStation 5 DualSense Wireless Cosmic Red Color Controller provides you physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. </p><h3 style=\"text-align: justify; \">Bring gaming worlds to life: </h3><p style=\"text-align: justify; \">You will feel physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors, By using this Wireless controller. These dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons that game will you play. This PlayStation 5 DualSense also featured Adaptive triggers. You will feel the experience of varying levels of force and tension as you interact with your in-game gear and environments. When you playing a racing Car type game, From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, and you will feel physically connected to your on-screen actions.</p><h3 style=\"text-align: justify; \">Heighten Your Senses:</h3><p style=\"text-align: justify; \">The brand new PlayStation 5 DualSense Wireless Controller offers dynamic adaptive triggers, immersive haptic feedback and This Controller has a built-in microphone, all integrated into an iconic design.</p><h3 style=\"text-align: justify; \">Create button:</h3><p style=\"text-align: justify; \">When you playing with the PlayStation 5 DualSense Wireless Controller, you can capture and broadcast your most epic gaming moments with the create button. Building on the success of the pioneering SHARE button, Here, â€œcreate offers players more ways to produce gaming content and broadcast their adventures live to the world.</p><h3 style=\"text-align: justify; \">Built-in microphone, Battery, and headset jack:</h3><p style=\"text-align: justify; \">This PlayStation 5 DualSense Wireless Controller has a Built-in microphone and a 3.5mm headset jack. So that, you can Chat with friends online using the built-in microphone or by connecting a headset to the 3.5mm jack. This Wireless Controller has a built-in battery and also this controller has an Integrated speaker so that you can Select games that take on an extra dimension with higher-fidelity sound effects bursting from the controller. Easily switch off voice capture at a momentâ€™s notice with the dedicated mute button.</p><h3 style=\"text-align: justify; \">Familiar features:</h3><p style=\"text-align: justify; \">The DualSense wireless controller retains many DUALSHOCK 4 for a new generation of play. This PlayStation 5 DualSense Wireless Controller has a Built-in battery ( Charge and play, now via USB Type-C ). The DualSense Wireless Controller has an integrated speaker. The PlayStation 5 DualSense Wireless Controller featured with Motion sensor, It also Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope.</p><p style=\"text-align: justify; \">This Latest PlayStation 5 DualSense Wireless Controller - Cosmic Red retains many DUALSHOCK 4 features, returning for a new generation of play. With this DualSense wireless controller can connect a headset to the 3.5-mm jack and Easily switch off voice capture at a moment's notice with the dedicated mute button. It's Experience varying levels of force and tension as you interact with your in-game gear and environments. Here, It Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, feel physically connected to your on-screen actions. This exclusive PlayStation 5 DualSense Wireless Cosmic Red Controller has no warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-10-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-20-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-30-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/dualsense-40-500x500.jpg"],"product_seo_title":"PlayStation 5 DualSense Controller - Cosmic Red Price in Bangladesh","product_seo_description":"Buy PlayStation 5 DualSense Controller Cosmic Red at the best price in BD. Latest PlayStation Controller available at Star Tech.Order online & get delivery anywhere in BD.","product_seo_keywords":"PlayStation 5 DualSense Wireless Controller - Cosmic Red"},{"url":"https://www.startech.com.bd/playstation-5-dualsense-controller-galactic-purple","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-galactic-purple-01-228x228.jpg","title":"PlayStation 5 DualSense Wireless Controller - Galactic Purple","product_list_short_description":["Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Galactic Purple"],"price_new":0,"price_old":0,"price_single":8500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"27877","brand":"Sony","product_page_short_description":["MPN: CFI-ZCT1W","Model: PlayStation 5 DualSense","Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Galactic Purple"],"emi_price":779,"full_description":"<h2 style=\"text-align: justify; \">PlayStation 5 DualSense Wireless Controller -&nbsp;Galactic Purple<br></h2><p style=\"text-align: justify; \">The Latest PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, dynamic adaptive triggers, and a built-in microphone, all integrated into an iconic design. You will Discover a deeper gaming experienc1 with the innovative new PS5 controller. This PlayStation 5 DualSense Wireless Controller provides you physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. In your hands, These dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons.</p><h3 style=\"text-align: justify; \">Heighten Your Senses:</h3><p style=\"text-align: justify; \">The brand new PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, and dynamic adaptive triggers, and This Controller has a built-in microphone, all integrated into an iconic design.</p><h3 style=\"text-align: justify; \">Bring gaming worlds to life: </h3><p style=\"text-align: justify; \">By using this Wireless controller, you will feel physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. These dynamic vibrations can simulate the feeling of everything from environment to the recoil of different weapons that the game will play. This PlayStation 5 DualSense also featured Adaptive triggers. You will feel the experience of varying levels of force and tension as you interact with your in-game gear and environments. When you play the racing-type game, From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, and you will feel physically connected to your on-screen actions.</p><h3 style=\"text-align: justify; \">Built-in microphone, Battery, and headset jack:</h3><p style=\"text-align: justify; \">This PlayStation 5 DualSense Wireless Controller has a Built-in microphone and a 3.5mm headset jack. So that, you can Chat with friends online using the built-in microphone or by connecting a headset to the 3.5mm jack. Easily switch off voice capture at a moment's notice with the dedicated mute button. This Wireless Controller has a built-in battery (Charge and play, now via USB Type-C) and also this controller has an Integrated speaker so that you can Select games that take on an extra dimension with higher-fidelity sound effects bursting from the controller. </p><h3 style=\"text-align: justify; \">Create button:</h3><p style=\"text-align: justify; \">When you use this PlayStation 5 DualSense Wireless Controller, you can capture and broadcast your most epic gaming moments with the create button. Building on the success of the pioneering SHARE button offers players more ways to produce gaming content and broadcast their adventures live to the world.</p><h3 style=\"text-align: justify; \">Familiar features:</h3><p style=\"text-align: justify; \">The DualSense wireless controller retains many DUALSHOCK 4 for a new generation of play. This PlayStation 5 DualSense Wireless Controller has a Built-in battery ( Charge and play, now via USB Type-C ). The DualSense Wireless Controller has an integrated speaker. The PlayStation 5 DualSense Wireless Controller featured with Motion sensor, It also Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. This Latest DualSense wireless controller retains many DUALSHOCK 4 features, returning for a new generation of play. With this DualSense wireless controller can connect a headset to the 3.5-mm jack and Easily switch off voice capture at a moment's notice with the dedicated mute button. Here, It Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. It's Experience varying levels of force and tension as you interact with your in-game gear and environments. From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, feel physically connected to your on-screen actions.</p><h2 style=\"font-family: &quot;Open Sans&quot;, sans-serif; color: rgb(102, 102, 102);\">Buy PlayStation 5 DualSense Wireless Controller - Galactic Purple from Star tech</h2><p style=\"text-align: justify;\">In Bangladesh, you can get the original&nbsp;<a href=\"https://www.startech.com.bd/playstation-5-dualsense-controller-galactic-purple\" target=\"\">PlayStation 5 DualSense Wireless Controller - Galactic Purple</a>&nbsp;From Star Tech. We have a large collection of the latest<a href=\"https://www.startech.com.bd/game-pad\" target=\"_blank\">&nbsp;Gamepads&nbsp;</a>to purchase. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech</a>&nbsp;Shop to get yours at the lowest price.&nbsp;The PlayStation 5 DualSense Wireless Controller - Galactic Purple has No Warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-galactic-purple-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-galactic-purple-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-galactic-purple-03-500x500.jpg"],"product_seo_title":"PlayStation 5 DualSense Controller Galactic Purple Price in Bangladesh","product_seo_description":"Buy PlayStation 5 DualSense Controller Galactic Purple at best price in BD.Latest PlayStation Controller available at Star Tech.Order online & get delivery anywhere in BD.","product_seo_keywords":"PlayStation 5 DualSense Wireless Controller - Galactic Purple"},{"url":"https://www.startech.com.bd/playstation-5-dualsense-controller-nova-pink","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-nova-pink-05-228x228.webp","title":"PlayStation 5 DualSense Wireless Controller - Nova Pink","product_list_short_description":["Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Nova Pink"],"price_new":0,"price_old":0,"price_single":8500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"27895","brand":"Sony","product_page_short_description":["MPN: CFI-ZCT1W","Model: PlayStation 5 DualSense","Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Nova Pink"],"emi_price":779,"full_description":"<h2 style=\"text-align: justify; \">PlayStation 5 DualSense Wireless Controller -&nbsp;Nova Pink<br></h2><p style=\"text-align: justify; \">The Latest PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, dynamic adaptive triggers, and a built-in microphone, all integrated into an iconic design. You will Discover a deeper gaming experienc1 with the innovative new PS5 controller. This PlayStation 5 DualSense Wireless Controller provides you physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. In your hands, These dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons.</p><h3 style=\"text-align: justify; \">Heighten Your Senses:</h3><p style=\"text-align: justify; \">The brand new PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, and dynamic adaptive triggers, and This Controller has a built-in microphone, all integrated into an iconic design.</p><h3 style=\"text-align: justify; \">Bring gaming worlds to life: </h3><p style=\"text-align: justify; \">By using this Wireless controller, you will feel physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. These dynamic vibrations can simulate the feeling of everything from environment to the recoil of different weapons that the game will play. This PlayStation 5 DualSense also featured Adaptive triggers. You will feel the experience of varying levels of force and tension as you interact with your in-game gear and environments. When you play the racing-type game, From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, and you will feel physically connected to your on-screen actions.</p><h3 style=\"text-align: justify; \">Built-in microphone, Battery, and headset jack:</h3><p style=\"text-align: justify; \">This PlayStation 5 DualSense Wireless Controller has a Built-in microphone and a 3.5mm headset jack. So that, you can Chat with friends online using the built-in microphone or by connecting a headset to the 3.5mm jack. Easily switch off voice capture at a moment's notice with the dedicated mute button. This Wireless Controller has a built-in battery (Charge and play, now via USB Type-C) and also this controller has an Integrated speaker so that you can Select games that take on an extra dimension with higher-fidelity sound effects bursting from the controller. </p><h3 style=\"text-align: justify; \">Create button:</h3><p style=\"text-align: justify; \">When you use this PlayStation 5 DualSense Wireless Controller, you can capture and broadcast your most epic gaming moments with the create button. Building on the success of the pioneering SHARE button offers players more ways to produce gaming content and broadcast their adventures live to the world.</p><h3 style=\"text-align: justify; \">Familiar features:</h3><p style=\"text-align: justify; \">The DualSense wireless controller retains many DUALSHOCK 4 for a new generation of play. This PlayStation 5 DualSense Wireless Controller has a Built-in battery ( Charge and play, now via USB Type-C ). The DualSense Wireless Controller has an integrated speaker. The PlayStation 5 DualSense Wireless Controller featured with Motion sensor, It also Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. This Latest DualSense wireless controller retains many DUALSHOCK 4 features, returning for a new generation of play. With this DualSense wireless controller can connect a headset to the 3.5-mm jack and Easily switch off voice capture at a moment's notice with the dedicated mute button. Here, It Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. It's Experience varying levels of force and tension as you interact with your in-game gear and environments. From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, feel physically connected to your on-screen actions.</p><h2 style=\"\">Buy PlayStation 5 DualSense Wireless Controller - Nova Pink from Star tech</h2><p style=\"text-align: justify;\">In Bangladesh, you can get the original&nbsp;<a href=\"https://www.startech.com.bd/playstation-5-dualsense-controller-nova-pink\" target=\"\">PlayStation 5 DualSense Wireless Controller - Nova Pink</a>&nbsp;From Star Tech. We have a large collection of the latest<a href=\"https://www.startech.com.bd/game-pad\" target=\"_blank\">&nbsp;Gamepads&nbsp;</a>to purchase. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech</a>&nbsp;Shop to get yours at the lowest price.&nbsp;The PlayStation 5 DualSense Wireless Controller - Nova Pink has No Warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-nova-pink-05-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-nova-pink-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-nova-pink-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-nova-pink-04-500x500.webp"],"product_seo_title":"PlayStation 5 DualSense Controller Nova Pink Price in Bangladesh","product_seo_description":"Buy PlayStation 5 DualSense Controller Nova Pink at best price in BD.Latest PlayStation Controller available at Star Tech.Order online & get delivery in BD.","product_seo_keywords":"PlayStation 5 DualSense Wireless Controller - Nova Pink"},{"url":"https://www.startech.com.bd/playstation-5-dualsense-controller-starlight-blue","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-starlight-blue-01-228x228.webp","title":"PlayStation 5 DualSense Wireless Controller - Starlight Blue","product_list_short_description":["Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Starlight Blue"],"price_new":0,"price_old":0,"price_single":8500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"27896","brand":"Sony","product_page_short_description":["MPN: CFI-ZCT1W","Model: PlayStation 5 DualSense","Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Starlight Blue"],"emi_price":779,"full_description":"<h2 style=\"text-align: justify; \">PlayStation 5 DualSense Wireless Controller -&nbsp;Starlight Blue<br></h2><p style=\"text-align: justify; \">The Latest PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, dynamic adaptive triggers, and a built-in microphone, all integrated into an iconic design. You will Discover a deeper gaming experienc1 with the innovative new PS5 controller. This PlayStation 5 DualSense Wireless Controller provides you physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. In your hands, These dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons.</p><h3 style=\"text-align: justify; \">Heighten Your Senses:</h3><p style=\"text-align: justify; \">The brand new PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, and dynamic adaptive triggers, and This Controller has a built-in microphone, all integrated into an iconic design.</p><h3 style=\"text-align: justify; \">Bring gaming worlds to life: </h3><p style=\"text-align: justify; \">By using this Wireless controller, you will feel physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. These dynamic vibrations can simulate the feeling of everything from environment to the recoil of different weapons that the game will play. This PlayStation 5 DualSense also featured Adaptive triggers. You will feel the experience of varying levels of force and tension as you interact with your in-game gear and environments. When you play the racing-type game, From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, and you will feel physically connected to your on-screen actions.</p><h3 style=\"text-align: justify; \">Built-in microphone, Battery, and headset jack:</h3><p style=\"text-align: justify; \">This PlayStation 5 DualSense Wireless Controller has a Built-in microphone and a 3.5mm headset jack. So that, you can Chat with friends online using the built-in microphone or by connecting a headset to the 3.5mm jack. Easily switch off voice capture at a moment's notice with the dedicated mute button. This Wireless Controller has a built-in battery (Charge and play, now via USB Type-C) and also this controller has an Integrated speaker so that you can Select games that take on an extra dimension with higher-fidelity sound effects bursting from the controller. </p><h3 style=\"text-align: justify; \">Create button:</h3><p style=\"text-align: justify; \">When you use this PlayStation 5 DualSense Wireless Controller, you can capture and broadcast your most epic gaming moments with the create button. Building on the success of the pioneering SHARE button offers players more ways to produce gaming content and broadcast their adventures live to the world.</p><h3 style=\"text-align: justify; \">Familiar features:</h3><p style=\"text-align: justify; \">The DualSense wireless controller retains many DUALSHOCK 4 for a new generation of play. This PlayStation 5 DualSense Wireless Controller has a Built-in battery ( Charge and play, now via USB Type-C ). The DualSense Wireless Controller has an integrated speaker. The PlayStation 5 DualSense Wireless Controller featured with Motion sensor, It also Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. This Latest DualSense wireless controller retains many DUALSHOCK 4 features, returning for a new generation of play. With this DualSense wireless controller can connect a headset to the 3.5-mm jack and Easily switch off voice capture at a moment's notice with the dedicated mute button. Here, It Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. It's Experience varying levels of force and tension as you interact with your in-game gear and environments. From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, feel physically connected to your on-screen actions.</p><h2 style=\"\">Buy PlayStation 5 DualSense Wireless Controller - Starlight Blue from Star tech</h2><p style=\"text-align: justify;\">In Bangladesh, you can get the original&nbsp;<a href=\"https://www.startech.com.bd/playstation-5-dualsense-controller-starlight-blue\" target=\"\">PlayStation 5 DualSense Wireless Controller - Starlight Blue</a>&nbsp;From Star Tech. We have a large collection of the latest<a href=\"https://www.startech.com.bd/game-pad\" target=\"_blank\">&nbsp;Gamepads&nbsp;</a>to purchase. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech</a>&nbsp;Shop to get yours at the lowest price.&nbsp;The PlayStation 5 DualSense Wireless Controller - Starlight Blue has No Warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-starlight-blue-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-starlight-blue-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-starlight-blue-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-starlight-blue-04-500x500.webp"],"product_seo_title":"PlayStation 5 DualSense Controller Starlight Blue Price in Bangladesh","product_seo_description":"Buy PlayStation 5 DualSense Controller Starlight Blue at best price in BD.Latest PlayStation Controller available at Star Tech.Order online & get delivery in BD.","product_seo_keywords":"PlayStation 5 DualSense Wireless Controller - Starlight Blue"},{"url":"https://www.startech.com.bd/playstation-5-dualsense-controller-grey-camouflage","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-grey-camouflage-01-228x228.webp","title":"PlayStation 5 DualSense Wireless Controller - Grey Camouflage","product_list_short_description":["Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Grey Camouflage"],"price_new":0,"price_old":0,"price_single":8500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"27961","brand":"Sony","product_page_short_description":["MPN: CFI-ZCT1W","Model: PlayStation 5 DualSense","Built-in microphone and headset jack","Motion sensor, Create button","Built-in Battery, Integrated Speaker","Color: Grey Camouflage"],"emi_price":779,"full_description":"<h2 style=\"text-align: justify; \">PlayStation 5 DualSense Wireless Controller -&nbsp;Grey Camouflage<br></h2><p style=\"text-align: justify; \">The Latest PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, dynamic adaptive triggers, and a built-in microphone, all integrated into an iconic design. You will Discover a deeper gaming experienc1 with the innovative new PS5 controller. This PlayStation 5 DualSense Wireless Controller provides you physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. In your hands, These dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons.</p><h3 style=\"text-align: justify; \">Heighten Your Senses:</h3><p style=\"text-align: justify; \">The brand new PlayStation 5 DualSense Wireless Controller offers immersive haptic feedback, and dynamic adaptive triggers, and This Controller has a built-in microphone, all integrated into an iconic design.</p><h3 style=\"text-align: justify; \">Bring gaming worlds to life: </h3><p style=\"text-align: justify; \">By using this Wireless controller, you will feel physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. These dynamic vibrations can simulate the feeling of everything from environment to the recoil of different weapons that the game will play. This PlayStation 5 DualSense also featured Adaptive triggers. You will feel the experience of varying levels of force and tension as you interact with your in-game gear and environments. When you play the racing-type game, From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, and you will feel physically connected to your on-screen actions.</p><h3 style=\"text-align: justify; \">Built-in microphone, Battery, and headset jack:</h3><p style=\"text-align: justify; \">This PlayStation 5 DualSense Wireless Controller has a Built-in microphone and a 3.5mm headset jack. So that, you can Chat with friends online using the built-in microphone or by connecting a headset to the 3.5mm jack. Easily switch off voice capture at a moment's notice with the dedicated mute button. This Wireless Controller has a built-in battery (Charge and play, now via USB Type-C) and also this controller has an Integrated speaker so that you can Select games that take on an extra dimension with higher-fidelity sound effects bursting from the controller. </p><h3 style=\"text-align: justify; \">Create button:</h3><p style=\"text-align: justify; \">When you use this PlayStation 5 DualSense Wireless Controller, you can capture and broadcast your most epic gaming moments with the create button. Building on the success of the pioneering SHARE button offers players more ways to produce gaming content and broadcast their adventures live to the world.</p><h3 style=\"text-align: justify; \">Familiar features:</h3><p style=\"text-align: justify; \">The DualSense wireless controller retains many DUALSHOCK 4 for a new generation of play. This PlayStation 5 DualSense Wireless Controller has a Built-in battery ( Charge and play, now via USB Type-C ). The DualSense Wireless Controller has an integrated speaker. The PlayStation 5 DualSense Wireless Controller featured with Motion sensor, It also Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. This Latest DualSense wireless controller retains many DUALSHOCK 4 features, returning for a new generation of play. With this DualSense wireless controller can connect a headset to the 3.5-mm jack and Easily switch off voice capture at a moment's notice with the dedicated mute button. Here, It Brings intuitive motion control to supported games with the built-in accelerometer and gyroscope. It's Experience varying levels of force and tension as you interact with your in-game gear and environments. From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, feel physically connected to your on-screen actions.</p><h2 style=\"\">Buy PlayStation 5 DualSense Wireless Controller - Grey Camouflage from Star tech</h2><p style=\"text-align: justify;\">In Bangladesh, you can get the original&nbsp;<a href=\"https://www.startech.com.bd/playstation-5-dualsense-controller-grey-camouflage\" target=\"\">PlayStation 5 DualSense Wireless Controller - Grey Camouflage</a>&nbsp;From Star Tech. We have a large collection of the latest<a href=\"https://www.startech.com.bd/game-pad\" target=\"_blank\">&nbsp;Gamepads&nbsp;</a>to purchase. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech</a>&nbsp;Shop to get yours at the lowest price.&nbsp;The PlayStation 5 DualSense Wireless Controller - Grey Camouflage has No Warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-grey-camouflage-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-grey-camouflage-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-grey-camouflage-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense/playstation-5-dualsense-grey-camouflage-03-500x500.webp"],"product_seo_title":"PlayStation 5 DualSense Controller Grey Camouflage Price in Bangladesh","product_seo_description":"Buy PlayStation 5 DualSense Controller Grey Camouflage at best price in BD.Latest PlayStation Controller available at Star Tech.Order online & get delivery in BD.","product_seo_keywords":"PlayStation 5 DualSense Wireless Controller - Grey Camouflage"},{"url":"https://www.startech.com.bd/playstation-dualsense-edge-wireless-controller","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-edge/dualsense-edge-01-228x228.webp","title":"PlayStation DualSense Edge Wireless Controller","product_list_short_description":["Ultra-Customizable Controls, Swappable Profiles","Mappable Back Buttons, Replaceable Stick Modules","Adjustable Triggers, Vibration Intensity","Built-In Microphone, Slip-Resistant Inner Grips"],"price_new":0,"price_old":0,"price_single":29999,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"32522","brand":"Sony","product_page_short_description":["Model: DualSense Edge","Ultra-Customizable Controls, Swappable Profiles","Mappable Back Buttons, Replaceable Stick Modules","Adjustable Triggers, Vibration Intensity","Built-In Microphone, Slip-Resistant Inner Grips"],"emi_price":2708,"full_description":"<h2>PlayStation DualSense Edge Wireless Controller</h2><p>The PlayStation <strong>DualSense Edge</strong> is a wireless controller.  This new PS5 controller, designed with maximum performance and customization in mind, encourages you to customize your&nbsp;gaming experience so you may play how you want. Explore your advantage with interchangeable profiles and adjustable controls that may help you get ready for everything from intense single-player quests to professional competitions. Your DualSense Edge wireless controller is uniquely yours thanks to custom settings. To&nbsp;adjust your settings, simply press the Fn and Options buttons while playing the game to open the customization panel. Adapt the control layout of your preferred games to ensure that the commands you require are always located precisely where you want them. You can swap between your button setups without exiting the game by saving them to your user profile. For precisely calibrated inputs, you can adjust your PlayStation DualSense Edge Wireless Controller stick sensitivity, trigger dead zones, stick dead zones, and vibration intensity. You can also adjust your vibration level for a fully personalized playing experience.</p><h3>Built-In Features</h3><p>Discover all of the immersive capabilities of the DualSense wireless controller in suitable games, such as motion controls, adaptive triggers, haptic feedback, and an integrated microphone.</p><h3>Signature Comfort with Slip-Resistant Inner Grips</h3><p>Experience the same unmatched comfort of the original DualSense wireless controller—now improved with inner grips that are resistant to slipping. Suitable for extended periods of time spent playing solo games and maintaining comfort throughout fierce competitive gameplay.</p><h3>Quick-Swappable Control Profiles</h3><p>Once you've established the perfect control configuration, you can save it to another profile and quickly switch between them, ensuring that your preferred setups are always available when you need them.</p><h2>Buy PlayStation DualSense Edge Wireless Controller From Star Tech</h2><p>In Bangladesh, you can get original <strong>PlayStation DualSense Edge Wireless Controller</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/playstation-gamepad-controller\" target=\"\">PlayStation Controller</a> to purchase for your <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/play-station\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The PlayStation DualSense Edge Wireless Controller comes no warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of PlayStation DualSense Edge Controller in Bangladesh?","paragraph":"The latest price of PlayStation DualSense Edge Controller in Bangladesh is 29,999৳. You can buy the PlayStation DualSense Edge Controller at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-edge/dualsense-edge-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-edge/dualsense-edge-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-edge/dualsense-edge-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-edge/dualsense-edge-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-edge/dualsense-edge-05-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/dualsense-edge/dualsense-edge-06-500x500.webp"],"product_seo_title":"PlayStation DualSense Edge Wireless Controller Price in Bangladesh","product_seo_description":"Buy PlayStation DualSense Edge Wireless Controller at best price in Bangladesh. Order latest PlayStation DualSense Edge Controller available from Star Tech Shop to delivery in BD.","product_seo_keywords":"PlayStation DualSense Edge Wireless Controller"},{"url":"https://www.startech.com.bd/logitech-driving-force-g29","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/logitech/g29/g29-01-228x228.webp","title":"Logitech Driving Force G29 Racing Gaming Wheel for PlayStation","product_list_short_description":["FOR PLAYSTATION 3/4 / PC","DUAL-MOTOR FORCE FEEDBACK","HELICAL GEARING ANTI-BACKLASH","EASY-ACCESS GAME CONTROLS"],"price_new":0,"price_old":0,"price_single":40000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"6674","brand":"Logitech","product_page_short_description":["Model: G29","FOR PLAYSTATION 3/4 / PC","DUAL-MOTOR FORCE FEEDBACK","HELICAL GEARING ANTI-BACKLASH","EASY-ACCESS GAME CONTROLS"],"emi_price":3667,"full_description":"<h2 style=\"text-align: justify; \">Logitech Driving Force G29 Racing Gaming&nbsp;Wheel for PlayStation</h2><span style=\"font-weight: bold;\"><div style=\"text-align: justify;\">FOR PLAYSTATION 3 AND PLAYSTATION 4</div></span><div style=\"text-align: justify; \">Enhance your console experience</div><div style=\"text-align: justify; \">You will never want to race with a regular controller again after you add Driving Force to your controller selection.</div><div style=\"text-align: justify; \">G29 game steering wheel is designed for the latest racing games for your PlayStation 4 or PlayStationÂ®3 console. G29 Driving Force also works on your PC using Logitech Gaming Software.</div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\">DUAL-MOTOR FORCE FEEDBACK</span></div><div style=\"text-align: justify; \">Feel every weight shift, and tire slip</div><div style=\"text-align: justify; \">Feel your tires on every turn and type of terrain, sense under- or over-steer drifting, and more. Powerful dual-motor force feedback realistically simulates force effects so you can respond with precision.</div><div style=\"text-align: justify; \">QUALITY CONSTRUCTION</div><div style=\"text-align: justify; \">Race-ready materials that can handle it all</div><div style=\"text-align: justify; \">Driving Force handles the stress of racing action and is built for long-lasting reliability. G29 has solid steel ball bearings in the wheel shaft and stainless steel paddle shifters and pedals. The race wheel is covered in high-quality, hand-stitched leather, giving it the look and feel of a high-performance racecar wheel and giving you a more comfortable, durable experience.</div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\">HELICAL GEARING WITH ANTI-BACKLASH</span></div><div style=\"text-align: justify; \">Tight, smooth, precise control</div><div style=\"text-align: justify; \">You get an exceptionally smooth, quiet steering action. Helical gears are modeled after gears used in automotive transmissions to reduce unwanted noise and vibration. Anti-backlash keeps the wheel and pedals tight, maximizing your control. G29 Driving Force Racing Wheel features a long-lasting, reliable hall-effect steering sensor, using magnetic fields to sense the position of the wheel.</div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\"><br></span></div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\">EASY-ACCESS GAME CONTROLS</span></div><div style=\"text-align: justify; \">Control right at your fingertips</div><div style=\"text-align: justify; \">All your controls are where you can reach them. The D-Pad, buttons, and paddle shifters are incorporated into the racing wheel. LED indicator lights positioned just above the center of the wheel tell you exactly when to up or down-shift. You maintain maximum acceleration without taking your eyes off the track. A 24-point selection dial and the +/- buttons on the front of the wheel let you further fine-tune your driving preferences.</div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\"><br></span></div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\">RESPONSIVE FLOOR PEDAL UNIT</span></div><div style=\"text-align: justify; \">Adjustable for maximum control</div><div style=\"text-align: justify; \">Maintain a more realistic driving body position with the separate floor pedal unit with integrated throttle, brake, and clutch pedals. G29 Driving Force lets you comfortably accelerate, brake and change gears with the feel of an actual car.</div><div style=\"text-align: justify; \">The nonlinear brake pedal mimics the performance of a pressure-sensitive brake system for a more responsive, accurate braking feel. For even finer control, reposition the pedal faces to make heel-toe maneuvers easier to perform.</div><div style=\"text-align: justify; \">Rubber feet for hard surfaces and a patented retractable carpet grip system help your pedals stay right where you put them.</div><div style=\"text-align: justify; \"><br></div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\">MOUNTS SECURELY</span></div><div style=\"text-align: justify; \">Performance that stays where you want it</div><div style=\"text-align: justify; \">Drive fearlessly knowing the wheel wonâ€™t shift during aggressive maneuvers. The racing wheel mounts securely to your table or racing rig via built-in clamps or screw mounting points.</div><div style=\"text-align: justify; \">Take your racing to the next level with a PlayseatÂ® racing simulation cockpit.</div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\"><br></span></div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\">900Â° STEERING</span></div><div style=\"text-align: justify; \">For realistic turns on the track</div><div style=\"text-align: justify; \">The 900-degree lock-to-lock rotation of the G29 Driving Force means you can turn the wheel two and a half times. Itâ€™s the same degree of motion as a steering wheel inside a car.</div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\"><br></span></div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\">WORKS WITH DRIVING FORCE SHIFTER ATTACHMENT</span></div><div style=\"text-align: justify; \">Pinpoint gear selection</div><div style=\"text-align: justify; \">Complete your racing rig for the most realistic experience. Add the 6-speed manual Driving Force shifter to your racing wheel setup.</div><div style=\"text-align: justify; \"><br></div><div style=\"text-align: justify; \"><span style=\"font-weight: bold;\">GAME COMPATIBILITY&nbsp;</span></div><div style=\"text-align: justify; \">To ensure compatibility, we work closely with game developers to ensure compatibility with our wheels. To see a list of tested games.</div><div style=\"text-align: justify; \"><br></div><div><div style=\"font-family: &quot;Segoe UI&quot;, system-ui, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, sans-serif; font-size: 14px;\"><div style=\"text-align: justify; \"><span style=\"font-family: &quot;Open Sans&quot;, sans-serif; font-size: 12px; font-weight: 700;\">IN THE BOX</span><br></div><div style=\"text-align: justify; \">Steering wheel, Pedals, Power adapter, User documentation</div></div></div><div style=\"text-align: justify; \"><br></div><div style=\"text-align: justify; \">Warranty - 2 Years</div><div style=\"text-align: justify; \"><br></div><div style=\"text-align: justify; \"><br></div>","specifications":[],"latest_price":{"heading":"What is the price of Logitech Driving Force G29 Gaming Wheel in Bangladesh?","paragraph":"The latest price of Logitech Driving Force G29 Gaming Wheel in Bangladesh is 40,000৳. You can buy the Logitech Driving Force G29 Gaming Wheel at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/logitech/g29/g29-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/logitech/g29/g29-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/logitech/g29/g29-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/logitech/g29/g29-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/logitech/g29/g29-05-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/logitech/g29/g29-06-500x500.webp"],"product_seo_title":"Logitech G29 Driving Force Racing Gaming Wheel Price in Bangladesh","product_seo_description":"Buy Logitech Driving Force G29 Racing Gaming Wheel for PlayStation at best price in BD. Latest Gaming wheel available at Star Tech Shop. Order online & Get delivery in BD","product_seo_keywords":"Logitech Driving Force G29 Racing Wheel for PlayStation"},{"url":"https://www.startech.com.bd/logitech-g923-trueforce-gaming-racing-wheel","img":"https://www.startech.com.bd/image/cache/catalog/gaming-wheel/logitech/g923-01-228x228.webp","title":"Logitech G923 TRUEFORCE Gaming Racing Wheel for PlayStation and PC","product_list_short_description":["Racing Wheel with Pedals and Integrated Console Controls","TRUEFORCE Force Feedback Technology","Adjustable Traction, Torque & Brakes","Compatible with PC, PS4 & PS5"],"price_new":0,"price_old":0,"price_single":48500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"26042","brand":"Logitech","product_page_short_description":["MPN: 941-000163","Model: G923","Racing Wheel with Pedals and Integrated Console Controls","TRUEFORCE Force Feedback Technology","Adjustable Traction, Torque & Brakes","Compatible with PC, PS4 & PS5"],"emi_price":4385,"full_description":"<h2>Logitech G923 TRUEFORCE Gaming Racing Wheel for PlayStation and PC</h2><p>The Logitech G923 Gaming Racing Wheel has TRUEFORCE force feedback technology, which syncs with game engines and physics to provide tangible realism. Similarly, for exact torque, the close-loop motor control matches voltage to in-game physics output. A 24-point selection dial is used to adjust the torque, traction, and brake force. The steering wheel's integrated console controls enable controller-like commands without leaving the driver's seat. Use the dual-clutch launch assist to get off to a speedier start. The G923 simulates the feel of a pressure-sensitive brake system thanks to a progressive brake pedal. The pedal faces can also be repositioned for authentic heel-toe driving. When used with approved games, a steering-wheel-mounted rev indicator with colored LEDs displays RPM range. Using the G Hub program, you may change your settings and create custom profiles for games. Add to the realism with the optional Logitech G Driving Force Shifter. The Logitech G G923 TRUEFORCE Sim Racing Wheel and Pedals are PC, PS4, and PS5 compatible.</p><h3>TRUEFORCE Feedback Technology</h3><p>The Logitech G923 integrates force feedback technology, which communicates directly with in-game simulation engines and physics to create higher-quality, real-time answers. In addition, the feedback frequency range has been expanded for significantly greater detail and realism as compared to earlier generations.</p><h3>Closed-Loop Motor Control</h3><p>The advanced programming in the G923 monitors all current going through the wheel motors, continuously altering voltage to match game physics outputs. G923 gives pinpoint precision and unmatched realism by going beyond normal settings.</p><h3>On-Wheel Game Controls and 24-Point Selection Dial</h3><p>The steering wheel incorporates full console controls. Every command is directly at hand, regardless of how you race. An integrated dial control allows you to regulate traction, torque, and brake force.</p><h3>Progressive Brake Pedal</h3><p>The Logitech G923 TRUEFORCE Gaming Racing Wheel has a progressive spring that mimics the performance of a pressure-sensitive brake system for a realistic racing experience. Reposition the pedal faces for heel-toe motions and even more control.</p><h3>Built-In Rev Indicator</h3><p>The Logitech G923 has built-in colorful LEDs that display your RPM range in supported games. See when you're redlining, right in front of your eyes.</p><h3>6-speed “H” Pattern Shifter</h3><p>The Logitech G923 provides the realism of a specialized shifter to elevate the racing simulation experience. The Driving Force Shifter from Logitech G is a driving partner you won't soon forget, with a short-throw sensation and a 6-speed \"H\" pattern shifter with push-down reverse.</p><h2>Buy Logitech G923 TRUEFORCE Gaming Racing Wheel from the best Gaming Shop in BD</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/logitech-g923-trueforce-gaming-racing-wheel\" target=\"\">Logitech G923 TRUEFORCE Gaming Racing Wheel</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/gaming/game-pad/logitech-gamepad\" target=\"\">Logitech Gaming</a> Racing Wheel to purchase for your <a href=\"https://www.startech.com.bd/desktops/gaming-pc\" target=\"\">Gaming Desktop PC</a> or <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest<a href=\"https://www.startech.com.bd/\" target=\"\"> Star Tech </a>Shop to get yours at lowest price. The Logitech G923 TRUEFORCE Gaming Racing Wheel comes with 2 Years warranty.<br></p>","specifications":[],"latest_price":{"heading":"What is the price of Logitech G923 TRUEFORCE Gaming Racing Wheel in Bangladesh?","paragraph":"The latest price of Logitech G923 TRUEFORCE Gaming Racing Wheel in Bangladesh is 48,500৳. You can buy the Logitech G923 TRUEFORCE Gaming Racing Wheel at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-wheel/logitech/g923-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-wheel/logitech/g923-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-wheel/logitech/g923-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-wheel/logitech/g923-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-wheel/logitech/g923-05-500x500.webp"],"product_seo_title":"Logitech G923 TRUEFORCE Gaming Racing Wheel Price in Bangladesh","product_seo_description":"Buy Logitech G923 TRUEFORCE Gaming Racing Wheel for PlayStation and PC at best price in BD. Order latest Logitech G923 Racing Wheel from Star Tech online shop for delivery.","product_seo_keywords":"Logitech G923 TRUEFORCE Gaming Racing Wheel for PlayStation and PC"},{"url":"https://www.startech.com.bd/sony-ps4-slim-jet-gaming-console","img":"https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-1-228x228.jpg","title":"Sony PS4 Slim Jet Black 8Gb RAM, 500GB Gaming Console","product_list_short_description":["1.84 TFLOPS, AMD Radeon based Graphics","Processor: x86-64 AMD Jaguar","8GB GDDR5 RAM+ 500GB Storage","1x Wireless Controller"],"price_new":0,"price_old":0,"price_single":52500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"11905","brand":"Sony","product_page_short_description":["Model: Sony PS4 Slim Jet","1.84 TFLOPS, AMD Radeon based Graphics","Processor: x86-64 AMD Jaguar","8GB GDDR5 RAM+ 500GB Storage","1x Wireless Controller"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">Sony PS4 Slim Jet Black 8Gb RAM, 500GB Gaming Console</h2><p style=\"text-align: justify;\">Sony PS4 Slim Jet Black Gaming Console comes with x86-64 AMD Jaguar, 8 cores Processor, 8GB GDDR5 RAM, 500GB Storage with 1.84 TFLOPS, and AMD Radeon-based graphics. This PS4  supports BD x 6 CAV, DVD x 8 CAV Disk / Media, and also  2 x Super-Speed USB 3.1 Gen 1, 1 x AUX Input / Output ports are available here. This PS4 comes with 1x Wireless Controller, LAN, WiFi, Bluetooth connectivity, AC 100-240V, 50/60Hz power, Max. 165W Power consumption, HDMI AV Output. It provides a 5degree C - 35degree C Operating Temperature. It has no warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-1-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-3-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-2-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-5-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-4-500x500.jpg"],"product_seo_title":"Sony PS4 Slim Jet Black Gaming Console Price in Bangladesh","product_seo_description":"Buy Sony PS4 Slim Jet Black 8Gb RAM, 500GB Gaming Console at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","product_seo_keywords":"Sony PS4 Slim Jet Black 8Gb RAM, 500GB Gaming Console"},{"url":"https://www.startech.com.bd/sony-ps4-slim-jet-1tb-gaming-console","img":"https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-1-228x228.jpg","title":"Sony PS4 Slim Jet Black, 8GB GDDR5, 1TB Gaming Console","product_list_short_description":["1.84 TFLOPS, AMD Radeon based Graphics","Processor: x86-64 AMD Jaguar","8GB GDDR5+ 1TB Storage","1x Wireless Controller"],"price_new":0,"price_old":0,"price_single":55500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"11901","brand":"Sony","product_page_short_description":["Model: Sony PS4 Slim Jet","1.84 TFLOPS, AMD Radeon based Graphics","Processor: x86-64 AMD Jaguar","8GB GDDR5+ 1TB Storage","1x Wireless Controller"],"emi_price":5088,"full_description":"<h2 style=\"text-align: justify; \">Sony PS4 Slim Jet Black, 8GB GDDR5, 1TB Gaming Console</h2><p style=\"text-align: justify;\">Sony PS4 Slim Jet Black Gaming Console comes with x86-64 AMD Jaguar, 8 cores Processor, 8GB GDDR5 RAM, 1TB Storage with 1.84 TFLOPS, AMD Radeon based graphics. This PS4  supports BD x 6 CAV, DVD x 8 CAV Disk / Media and also  2 x Super-Speed USB3.1 Gen 1, 1 x AUX Input / Output ports are available here. This PS4 comes with 1x Wireless Controller, LAN, WiFi, Bluetooth connectivity, AC 100-240V, 50/60Hz power, Max. 165W Power consumption, HDMI AV Output. It provides 5degree C - 35degree C Operating Temperator. The PS4 Slim Jet has 01 year service warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PS4 Slim Jet Black Gaming Console in Bangladesh?","paragraph":"The latest price of Sony PS4 Slim Jet Black Gaming Console in Bangladesh is 55,500৳. You can buy the Sony PS4 Slim Jet Black Gaming Console at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-1-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-4-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-5-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-2-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-slim-jet/ps4-slim-jet-3-500x500.jpg"],"product_seo_title":"Sony PS4 Slim Jet, 1TB Gaming Console Price in Bangladesh","product_seo_description":"Buy Sony PS4 Slim Jet Black, 8GB GDDR5, 1TB Gaming Console at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","product_seo_keywords":"Sony PS4 Slim Jet Black, 8GB GDDR5, 1TB Gaming Console"},{"url":"https://www.startech.com.bd/sony-playstation-move-virtual-reality-motion-controller","img":"https://www.startech.com.bd/image/cache/catalog/vr-controller/playstation-move-01-228x228.jpg","title":"Sony Playstation Move Virtual Reality Motion Controller","product_list_short_description":["Perfect for Virtual Reality","Ergonomic design","Accurate tracking","Intuitive interface"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Up Coming","code":"21961","brand":"Sony","product_page_short_description":["Model: Playstation Move","Perfect for Virtual Reality","Ergonomic design","Accurate tracking","Intuitive interface"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify;\">Sony Playstation Move Virtual Reality Motion Controller</h2><div style=\"text-align: justify;\">Sony Playstation Move Virtual Reality Motion Controller Enhance your PlayStation VR experience with up to two PlayStation Move motion controllers, in compatible games. With its lightweight design, advanced motion sensors, and tracking sphere, the PlayStation Move motion controller lets you effortlessly interact with your virtual environment, with incredible accuracy. The Ergonomic design lets you feel an extraordinary connection to amazing virtual worlds, thanks to the comfortable design and vibration feedback. It also has accurate tracking to experience an astonishing sense of presence with built-in motion sensors, and a color-changing sphere which is tracked by the PlayStation Camera. Thi controller also offers an intuitive interface that lets you take full control of your VR experiences with an easy-to-use button layout, including a large, dedicated trigger and the familiar DUALSHOCK 4 wireless controller PS and action buttons. Playstation Move Virtual Reality Motion Controller offers a No Warranty.<br></div>","specifications":[{"heading":"Basic Information","values":[{"key":"Connectivity","value":"Wireless"}]},{"heading":"Physical Description","values":[{"key":"Color","value":"Black"}]}],"latest_price":{"heading":"What is the price of Sony Playstation Move VR Motion Controller in Bangladesh?","paragraph":"The latest price of Sony Playstation Move VR Motion Controller in Bangladesh is 0৳. You can buy the Sony Playstation Move VR Motion Controller at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/vr-controller/playstation-move-01-500x500.jpg"],"product_seo_title":"Sony Playstation Move Virtual Reality Motion Controller Price in BD","product_seo_description":"Buy Sony Playstation Move Virtual Reality Motion Controller at best price in Bangladesh. Latest Sony Controller available at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Sony Playstation Move Virtual Reality Motion Controller"},{"url":"https://www.startech.com.bd/sony-console-disc-drive-for-ps5-digital-edition-slim","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/disc-drive/disc-drive-01-228x228.webp","title":"Sony Console Disc Drive for PS5 Digital Edition Slim","product_list_short_description":["Supported PS4 Titles on Blu-ray Disc","Drive Supports: 4K Ultra HD Blu-Ray Discs, Blu-Ray Discs and DVDs","Internet connection is required to pair Disc Drive and Console","Compatible PS5 Models: PS5 CFI-2000 model group - slim"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Up Coming","code":"32749","brand":"Sony","product_page_short_description":["Model: Disc Drive","Supported PS4 Titles on Blu-ray Disc","Drive Supports: 4K Ultra HD Blu-Ray Discs, Blu-Ray Discs and DVDs","Internet connection is required to pair Disc Drive and Console","Compatible PS5 Models: PS5 CFI-2000 model group - slim"],"emi_price":0,"full_description":"<h2>Sony Console Disc Drive for PS5 Digital Edition Slim</h2><p>The Sony Console <strong>Disc Drive for PS5 Digital Edition Slim</strong> Consoles is a sleek and excellent add-on that easily attaches to your console, allowing you to play the huge library of physical games and Blu-ray movies available for PS5, PS4, and even Blu-ray movies. You can take your gaming outside of the digital world with the Sony Console Disc Drive. Discover a wide range of PS5 and PS4 games that are available on Blu-ray Disc, including remastered classics, exclusive titles, and undiscovered gems. Additionally, lose yourself in breathtaking 4K Ultra HD Blu-ray films and take in the breathtaking images with remarkable clarity and detail. The Sony Console Disc Drive is made to blend in with the streamlined appearance of the PS5 Digital Edition Slim. It connects to your console with ease while keeping its small size. All you need to pair the drive with your console is an internet connection, which makes setup easy. The Sony Console Disc Drive is compatible with a variety of media types, including 4K Ultra HD Blu-ray Discs, Blu-ray Discs, and DVDs. It is compatible with the PS5 CFI-2000 model group (slim). It is the perfect complement to the setup of any owner of a PS5 Digital Edition Slim because of its adaptability. You may increase your entertainment selections and open up a world of gaming possibilities with the Sony Console Disc Drive. Savor the excitement of collecting physical games, lose yourself in realistic Blu-ray films, and appreciate how convenient it is to have a flexible media drive that works well with your PS5 Digital Edition Slim setup.</p><h3>How to Attach the Vertical Stand to PS5 CFI-2000 Slim Console</h3><p>Before attaching the console disk drive, place your console on a soft cloth spread out on a level surface. Navigate to the control center, then choose Power &gt; Switch Off PS5. The power indicator flashes white, the screen goes blank, and the device shuts off. After removing the wires and AC power cord, let the PS5 console cool. As soon as you use your console, the main unit gets hot. After positioning the console so that the front side is facing you and the bottom is facing up, take off the short horizontal stand feet. To remove the circular cover from the console, gently take it away from the console and remove the clips. After positioning the disc drive's clips into the two holes (designated with an upside-down triangle), firmly press them in until a \"click\" sounds. Securely fasten the circular cover and long horizontal stand feet that come with your disk drive. Press in the cover until a \"click\" sounds by aligning its clips with the matching holes on the console. After plugging in the cables and AC power cord, turn on the electricity. Store the feet and cover you took off in stages three and four in a secure location. The PS5 console cannot be used without them if the disc drive is not connected. During setup, a disc drive and PS5 console must be paired with an internet connection.</p><h2>Buy Sony Console Disc Drive for PS5 Digital Edition Slim From Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony Console Disc Drive for PS5 Digital Edition Slim</strong> From Star Tech. We have a large collection of latest Console Disc Drive to purchase for your <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Sony Console Disc Drive for PS5 Digital Edition Slim comes with no warranty.</p><p><span style=\"background-color: yellow; font-weight: bold;\">*** PS5 Not Included, Only Disc Drive</span></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony Console Disc Drive for PS5 Digital Edition Slim in Bangladesh?","paragraph":"The latest price of Sony Console Disc Drive for PS5 Digital Edition Slim in Bangladesh is 0৳. You can buy the Sony Console Disc Drive for PS5 Digital Edition Slim at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/disc-drive/disc-drive-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/disc-drive/disc-drive-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/disc-drive/disc-drive-03-500x500.webp"],"product_seo_title":"Sony Console Disc Drive for PS5 Digital Edition Slim Price in BD","product_seo_description":"Buy Sony Console Disc Drive for PS5 Digital Edition Slim at best price in Bangladesh. Order latest Sony Console Disc Drive for PS5 Digital Edition Slim From Star Tech Shop for delivery in BD.","product_seo_keywords":"Sony Console Disc Drive for PS5 Digital Edition Slim"},{"url":"https://www.startech.com.bd/sony-playstation-portal-remote-player","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-portal-remote-player/playstation-portal-remote-player-01-228x228.webp","title":"Sony PlayStation Portal Remote Player for PS5 Console","product_list_short_description":["Display Size: 8-inch Full HD LCD Screen","Resolution: 1080p at 60fps","Processor Speed: 3.5 GHz","DualSense Wireless Controller"],"price_new":0,"price_old":0,"price_single":55500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"33026","brand":"Sony","product_page_short_description":["Model: PlayStation Portal Remote Player","Display Size: 8-inch Full HD LCD Screen","Resolution: 1080p at 60fps","Processor Speed: 3.5 GHz","DualSense Wireless Controller"],"emi_price":4725,"full_description":"<h2>Sony PlayStation Portal Remote Player for PS5 Console</h2><p>The Sony <strong>PlayStation Portal Remote Player</strong> allows you to access your PS5 console's games via your home Wi-Fi. Allowing you to play on a beautiful 8\" LCD screen capable of 1080p resolution at 60fps without the need for a TV. PlayStation Portal Remote Player may play suitable games installed on your PS5 console, including your PS5 and PS4 favorites. With the DualSense Wireless Controller, you may experience breathtaking immersion. In compatible games, it provides remarkable immersion through haptic feedback and adjustable triggers. It is not necessary to use a Wi-Fi network to use PlayStation Portal Remote Player because you have control over the quality of your own home Wi-Fi. PlayStation Portal Remote Player can also be used anywhere there is broadband internet Wi-Fi with at least 5Mbps. A high-speed connection of at least 15 Mbps is suggested for a better gaming experience. If you use public Wi-Fi, be aware that the quality of the internet connection is beyond your control and may have an impact on the quality of your gaming experience.</p><h2>Buy Sony PlayStation Portal Remote Player for PS5 Console From Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation Portal Remote Player for PS5 Console</strong> From Star Tech. We have a large collection of latest PlayStation Portal Remote Player to purchase for your <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Sony PlayStation Portal Remote Player for PS5 Console comes with no warranty.</p><p><span style=\"background-color: yellow; font-weight: bold;\">***Only use with PS5 consoles.</span></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PlayStation Portal Remote Player in Bangladesh?","paragraph":"The latest price of Sony PlayStation Portal Remote Player in Bangladesh is 55,500৳. You can buy the Sony PlayStation Portal Remote Player at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-portal-remote-player/playstation-portal-remote-player-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-portal-remote-player/playstation-portal-remote-player-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-portal-remote-player/playstation-portal-remote-player-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-portal-remote-player/playstation-portal-remote-player-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-portal-remote-player/playstation-portal-remote-player-05-500x500.webp"],"product_seo_title":"Sony PlayStation Portal Remote Player Price in Bangladesh | Star Tech","product_seo_description":"Buy Sony PlayStation Portal Remote Player at best price in Bangladesh. Latest PlayStation Portal Remote Player available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Sony PlayStation Portal Remote Player for PS5 Console"},{"url":"https://www.startech.com.bd/ps4-dualshock-4-wireless-controller-steel-glacier-white","img":"https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-glacier-white-01-228x228.webp","title":"PS4 Dualshock 4 Wireless Controller Steel Glacier White (Original)","product_list_short_description":["Motion sensors, Stereo headset jack","SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers"],"price_new":0,"price_old":0,"price_single":6900,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"27866","brand":"Sony","product_page_short_description":["MPN: CUH-ZCT2E","Model: Dualshock 4","Motion sensors, Stereo headset jack","SHARE button, Touch pad","Light bar, Built-in speaker","Refined analog sticks and triggers"],"emi_price":593,"full_description":"<h2 style=\"text-align: justify; \">PS4 Dualshock 4 Wireless Controller Steel Glacier White (Original)</h2>\n\n<p style=\"text-align: justify; \">Stay classy with a selection of timeless classic colors returning to the DUALSHOCK 4 wireless controller range. Capture and show off your finest moments with just the push of a button. Upload gameplay videos and screenshots directly from your PS4 system or live-stream your gameplay, all without disturbing your in-progress game. The latest PS4 Dualshock 4 Controller featured Precision Control offering players absolute control over all of their games, Sharing at Your Fingertips: The SHARE button allows you to upload gameplay videos and screenshots or live-stream your gameplay while the game is in progress. This controller has different kinds of unique features like the touch pad, integrated light bar, and built-in speaker offering new ways to experience and interact with your games. Get even more precise control with the built-in touchpad that now shows the unique light bar, adding an extra dimension to your games. Get the edge with a much tighter sense of control over in-game actions. See even more of your games with the integrated light bar that glows with various colors depending on in-game action - now visible on the touchpad. Bring your games to life and hear every detail with sound effects coming directly from your DUALSHOCK 4 wireless controller. Listen to your games in private and hear every boom, bang, and blast with an integrated 3.5mm audio jack for your headphones. Rock and roll as a highly sensitive built-in accelerometer and gyroscope detect the motion, tilt, and rotation of your DUALSHOCK 4 wireless controller. Charge the controller's internal battery from your PS4 USB port, giving you hassle-free charging as you play. This PS4 Dualshock 4 Wireless Controller has no warranty.</p><h2 style=\"\">Buy PS4 Dualshock 4 Wireless Controller Steel Glacier White (Original) from Star tech</h2><p style=\"text-align: justify; \">In Bangladesh, you can get the original&nbsp;<a href=\"https://www.startech.com.bd/ps4-dualshock-4-wireless-controller-steel-glacier-white\" target=\"\">PS4 Dualshock 4 Wireless Controller Steel Glacier White (Original)</a>&nbsp;From Star Tech. We have a large collection of the latest<a href=\"https://www.startech.com.bd/game-pad\" target=\"_blank\">&nbsp;Gamepads&nbsp;</a>to purchase. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech</a>&nbsp;Shop to get yours at the lowest price.&nbsp;The PS4 Dualshock 4 Wireless Controller Steel Glacier White (Original) has No Warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of PS4 Dualshock 4 Wireless Controller Steel Glacier White (Original) in Bangladesh?","paragraph":"The latest price of PS4 Dualshock 4 Wireless Controller Steel Glacier White (Original) in Bangladesh is 6,900৳. You can buy the PS4 Dualshock 4 Wireless Controller Steel Glacier White (Original) at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-glacier-white-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-glacier-white-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-glacier-white-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/game-pad/sony/ps4-dualshock-4/dualshock-4-glacier-white-04-500x500.webp"],"product_seo_title":"PS4 Dualshock 4 Wireless Controller Steel Glacier White Price in Bangladesh","product_seo_description":"Buy PS4 Dualshock 4 Wireless Controller Steel Glacier White at best price in Bangladesh. Latest PS4 Controller available at Star Tech. Order online, get delivery in BD.","product_seo_keywords":"PS4 Dualshock 4 Wireless Controller Steel Glacier White (Original)"},{"url":"https://www.startech.com.bd/playstation-5-console-cover-marvel-s-spider-man-2-limited-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-console-cover-marvel-s-spider-man-2-limited-edition/playstation-5-console-cover-marvel-s-spider-man-2-limited-edition-01-228x228.webp","title":"PlayStation 5 Console Cover Marvel’s Spider-Man 2 Limited Edition","product_list_short_description":["Head Case Design, Easy to Use","Ultra-Thin and Super Lightweight","1x Matching DualSense Controller Cover","Compatible with PS5, PS5 Disc Edition"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Out Of Stock","code":"32609","brand":"Sony","product_page_short_description":["Model: PS5 Console Cover","Head Case Design, Easy to Use","Ultra-Thin and Super Lightweight","1x Matching DualSense Controller Cover","Compatible with PS5, PS5 Disc Edition"],"emi_price":0,"full_description":"<h2>PlayStation 5 Console Cover Marvel’s Spider-Man 2 Limited Edition</h2><p style=\"text-align: justify; \">The PlayStation 5 Console Cover Marvel’s Spider-Man 2 Limited Edition, expertly produced and especially designed by the gaming superpower, PlayStation, introduces a new degree of gaming aesthetics. Marvel's Spider-Man 2 Limited Edition stands out as a genuine collector's item, with a fascinating symbiote takeover design inspired by the game's enthralling plot. These covers are more than simply accessories; they demonstrate PlayStation's dedication to providing an unrivaled gaming experience. What distinguishes these covers is their provenance; as the only ones designed by PlayStation for the PS5, you can be certain of their quality. The cover of Marvel's Spider-Man 2 Limited Edition, in particular, pays respect to the game's legendary tale, allowing players to bring a piece of the Marvel Universe into their gaming dens. The promise of excellence goes beyond appearances. The PlayStation 5 Console Covers are designed to resist the demands of gameplay, assuring durability and performance. The user-friendly design allows for a simple removal of the original white covers followed by a smooth click into place for the replacement ones. Immerse yourself in the symbiotic appeal of Marvel's Spider-Man 2 Limited Edition cover, where every detail embodies the passion and ingenuity characteristic of the PlayStation brand. Elevate not just the appearance but also the whole feel of your gaming setup with coverings that are a blend of design, substance, and absolute quality. Transform your gaming room into a visual spectacle and immerse yourself in the immersive world of gaming with PlayStation 5 Console Covers - the pinnacle of creativity and perfection.</p><h2 style=\"text-align: justify;\"><span style=\"color: inherit; font-family: inherit;\">Buy </span>PlayStation 5 Console Cover Marvel’s Spider-Man 2 Limited Edition<span style=\"color: inherit; font-family: inherit;\"> From Star Tech</span><br></h2><p>In Bangladesh, you can get original <span style=\"font-weight: 700;\">PlayStation 5 Console Cover Marvel’s Spider-Man 2 Limited Edition</span> From Star Tech. We have a large collection of latest PlayStation Cover to Purchase for your <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The PlayStation 5 Console Cover Marvel’s Spider-Man 2 Limited Edition comes no warranty.<br><span style=\"font-weight: bold; background-color: yellow;\">*Only PlayStation 5 Console Cover</span></p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-console-cover-marvel-s-spider-man-2-limited-edition/playstation-5-console-cover-marvel-s-spider-man-2-limited-edition-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-console-cover-marvel-s-spider-man-2-limited-edition/playstation-5-console-cover-marvel-s-spider-man-2-limited-edition-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-console-cover-marvel-s-spider-man-2-limited-edition/playstation-5-console-cover-marvel-s-spider-man-2-limited-edition-03-500x500.webp"],"product_seo_title":"PlayStation 5 Console Cover Marvel’s Spider-Man 2 Limited Edition Price in BD","product_seo_description":"Buy PlayStation 5 Console Cover Marvel’s Spider-Man 2 Limited Edition at the best price in Bangladesh. Order latest PlayStation 5 Console Cover from Star Tech Online shop in BD.","product_seo_keywords":"PlayStation 5 Console Cover Marvel’s Spider-Man 2 Limited Edition"},{"url":"https://www.startech.com.bd/sony-playstation-pulse-explore-wireless-earbuds","img":"https://www.startech.com.bd/image/cache/catalog/earbuds/sony/pulse-explore/pulse-explore-01-228x228.webp","title":"Sony PlayStation PULSE Explore Wireless Earbuds","product_list_short_description":["Two Hidden Microphones","Multi-Device Bluetooth Connectivity","AI-Enhanced Noise Rejection","Volume and Mic Mute Buttons"],"price_new":0,"price_old":0,"price_single":39999,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"32524","brand":"Sony","product_page_short_description":["Model: PULSE Explore","Two Hidden Microphones","Multi-Device Bluetooth Connectivity","AI-Enhanced Noise Rejection","Volume and Mic Mute Buttons"],"emi_price":3583,"full_description":"<h2>PlayStation PULSE Explore Wireless Earbuds</h2><p>The Sony&nbsp;PlayStation <strong>PULSE Explore</strong> Wireless Earbuds come in a portable design with hidden microphones and a charging case. Stay active for up to 5 hours on a single charge and an additional 10 hours with the accompanying charging case. Take calls and communicate with teammates using two covert microphones. With easy-access volume and mic mute buttons, the PlayStation PULSE Explore Earbuds keep your focus on the game. Connect your earbuds to a mobile phone or tablet device to become mobile. Listen to audio from a PlayStation Link and a Bluetooth device at the same time to stay in the game while answering calls or listening to music from a mobile device. Designed for Adventure With a compact design and charging case, you can enjoy vivid sound wherever you go. The Sony&nbsp;PlayStation PULSE Explore Earbuds have a portable style to take your play wherever it takes you with a lightweight, comfortable true wireless earbud form factor that has the same groundbreaking capabilities as the PULSE Elite wireless headset. Reimagine how fantastic your games can sound on the move and at home, with everything from lifelike sound and lightning-fast networking to AI-enhanced microphone noise rejection. Several Earbud Tips Select from three additional pairs of included earbud tips to find the ideal fit for you. PlayStation Portal Remote Control Ready Use PlayStation Link technology to connect directly to the remote player and hear vivid, lightning-fast audio wherever you have Wi-Fi in your home. </p><h3>Next-Generation Gaming Audio</h3><p>These studio-inspired drivers replicate sound with near-perfect accuracy over the full audible spectrum, allowing you to hear games as the designers intended. The Sony&nbsp;PlayStation PULSE Explore Earbuds immerse you in rich, delicate soundscapes, while deep bass allows you to feel each dramatic in-game confrontation. Improve your perception in 3D audio-supported PS5 games by positioning audio cues with amazing accuracy across all three dimensions.</p><h3>AI-Assisted Noise Rejection</h3><p>With microphone noise-rejection technology, you can be heard clearly and loudly. This Sony&nbsp;PlayStation <strong>PULSE Explore</strong> Earbuds has new technology, which is powered by artificial intelligence and has been trained to identify, isolate, and remove undesired noises when capturing your voice.</p><h3>Easy Connect with PlayStation</h3><p>Never miss a beat again with revolutionary ultra-low latency and lossless PlayStation Link wireless technology that delivers sound at lightning-fast speed without sacrificing a single audio nuance. The Sony&nbsp;PlayStation PULSE Explore Wireless Earbuds connect and switch between PlayStation Link devices, such as your PS5 console, PC, Mac, and PlayStation Portal remote player, with ease.</p><h2>Buy Sony PlayStation PULSE Explore Wireless Earbuds From Star Tech</h2><p>In Bangladesh, you can get original <span style=\"font-size: 12px; font-weight: 700;\">Sony PlayStation PULSE Explore Wireless Earbuds&nbsp;</span>From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/sony-earbuds\" target=\"\">Sony Earbuds</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Sony PlayStation PULSE Explore Wireless Earbuds comes no warranty.</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Frequency"},{"key":"Impedance"},{"key":"Sound level/Sensitivity"},{"key":"Signal/Noise"},{"key":"Power Output"},{"key":"Connection Type","value":"Wireless"},{"key":"Microphone","value":"Yes"},{"key":"Battery"},{"key":"Duration","value":"up to 5 hours of battery life and an additional 10 hours via the included charging case"},{"key":"Others"}]},{"heading":"Physical Specification","values":[{"key":"Cable length"},{"key":"Connector","value":"Bluetooth"},{"key":"Drivers"},{"key":"Dimensions","value":"0.70 x 1.40 x 0.90 Inches"},{"key":"Weight","value":"0.2 oz"},{"key":"Color","value":"White"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Sony PlayStation PULSE Explore Earbuds in Bangladesh?","paragraph":"The latest price of Sony PlayStation PULSE Explore Earbuds in Bangladesh is 39,999৳. You can buy the Sony PlayStation PULSE Explore Earbuds at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/earbuds/sony/pulse-explore/pulse-explore-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/sony/pulse-explore/pulse-explore-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/sony/pulse-explore/pulse-explore-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/sony/pulse-explore/pulse-explore-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/sony/pulse-explore/pulse-explore-05-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/sony/pulse-explore/pulse-explore-06-500x500.webp"],"product_seo_title":"Sony PlayStation PULSE Explore Wireless Earbuds Price in Bangladesh","product_seo_description":"Buy Sony PlayStation PULSE Explore Wireless Earbuds at best price in Bangladesh. Order latest Sony PlayStation PULSE Explore Earbuds from Star Tech Shop for delivery in BD.","product_seo_keywords":"Sony PlayStation PULSE Explore Wireless Earbuds"},{"url":"https://www.startech.com.bd/sony-ps4-pro-jet-gaming-console","img":"https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-pro-jet/ps4-pro-jet-1-228x228.jpg","title":"Sony PS4 Pro Jet Black Gaming Console","product_list_short_description":["4.20 TFLOPS, AMD Radeon based graphics engine","Processor: x86-64 AMD Jaguar","8GB GDDR5 RAM+ 1TB storage","1x Wireless Controller"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Out Of Stock","code":"11900","brand":"Sony","product_page_short_description":["Model: Sony PS4 Pro Jet","4.20 TFLOPS, AMD Radeon based graphics engine","Processor: x86-64 AMD Jaguar","8GB GDDR5 RAM+ 1TB storage","1x Wireless Controller"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">Sony PS4 Pro Jet Black Gaming Console</h2><p style=\"text-align: justify;\">Sony PS4 Pro Jet Black Gaming Console is comes with x86-64 AMD Jaguar, 8 cores Processor, 8GB GDDR5 RAM, 1TB storage with 4.20 TFLOPS, AMD Radeon based graphics engine. This PS4 is features with BD x 6 CAV, DVD x 8 CAV Disk,  3 x Super-Speed USB3.1 Gen 1, 1 x AUX input/ output port. This Play Station also has LAN, WiFi, Bluetooth, AC 100-240V, 50/60Hz power, Max. 310W Power consumption, 5degree C - 35degree C operating temparator, HDMI, Digital out AV Output. In this PS4, it is also has CUH-7000 series, Gaming Console with 1x Wireless Controller with 1 x Wireless Controller. This PS4 has 07 days Replacement Warranty and 01 year service warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PS4 Pro Jet Black Gaming Console in Bangladesh?","paragraph":"The latest price of Sony PS4 Pro Jet Black Gaming Console in Bangladesh is 35,500৳. You can buy the Sony PS4 Pro Jet Black Gaming Console at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-pro-jet/ps4-pro-jet-1-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-pro-jet/ps4-pro-jet-2-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gadget/gaming-console/play-station/sony/ps4-pro-jet/ps4-pro-jet-3-500x500.jpg"],"product_seo_title":"Sony PS4 Pro Jet Black Gaming Console Price in Bangladesh","product_seo_description":"Buy Sony PS4 Pro Jet Black Gaming Console at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","product_seo_keywords":"Sony PS4 Pro Jet Black Gaming Console"},{"url":"https://www.startech.com.bd/sony-playstation-5-digital-edition-gaming-console","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-digital-edition/sony-playstation-5-digital-edition-01-228x228.jpg","title":"Sony PlayStation 5 Digital Edition Gaming Console","product_list_short_description":["AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","GPU: 10.28 TFLOPs, 36CUs at 2.23GHz","Backward Compatibility & Game Boost","4K UltraHD TV Gaming, 8K support"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Out Of Stock","code":"22673","brand":"Sony","product_page_short_description":["MPN: CFI 1000B / CFI-1200B","Model: PlayStation 5 Digital Edition","AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","GPU: 10.28 TFLOPs, 36CUs at 2.23GHz","Backward Compatibility & Game Boost","4K UltraHD TV Gaming, 8K support"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify;\">Sony PlayStation 5 Digital Edition Gaming Console</h2><p style=\"text-align: justify;\">Sony PlayStation 5 Digital Edition is another iteration of the classic Sony PlayStation 5 Gaming Console. The PS5 Digital Edition unleashes new gaming possibilities that you never anticipated. You can experience lightning-fast loading with an ultra-high-speed SSD, deeper immersion with haptic feedback support, adaptive triggers, 3D Audio, and an all-new generation of incredible PlayStation games. Play Station 5 Digital Edition is an all-digital version of the PS5 console with no disc drive. You can sign in to your account for PlayStation Network and go to PlayStation Store to buy and download games. It has 3D audio via built-in TV speakers or analog/USB stereo headphones. This console has Ultra-High Speed SSD&nbsp; letting you maximize your play sessions with near-instant load times for installed PS5 compatible games. The Integrated I/O ports of the Play Station 5 The custom integration of the PS5 Digital Editionâ€™s systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible. This console supports advanced Ray Tracing which allows you to Immerse yourself in worlds with a new level of realism as rays of light are individually simulated, creating true-to-life shadows and reflections in supported PS5 games. This Console comes with 4K-TV Gaming support. You can play your favorite PS5 games on your stunning 4K TV with up to 120FPS with 120Hz output. It lets you enjoy smooth and fluid high frame rate gameplay at up to 120fps for compatible games, with support for 120Hz output on 4K displays. Playstation 5 digital edition also comes with HDR Technology which makes it compatible with an HDR TV. The supported PS5 games display an unbelievably vibrant and lifelike range of colors. For a better audio experience city has Tempest 3D AudioTech. Immerse yourself in soundscapes where it feels like the sound comes from every direction. Your surroundings truly come alive with Tempest 3D AudioTech1 in supported games. It lets you experience haptic feedback via the DualSense wireless controller in select PS5 titles and feel the effects and impact of your in-game actions through dynamic sensory feedback. It has immersive adaptive triggers, featuring dynamic resistance levels which simulate the physical impact of in-game activities in select PS5 games. This console also includes ASTROâ€™S Playroom which lets you explore four worlds, each one showcasing innovative gameplay using the versatile features of the DualSense wireless controller, this game is included for all PS5 console users. This console also has backward Compatibility &amp; Game Boost support. The PS5 console can play over 4,000 PS4 games. With the Game Boost feature, you can even enjoy faster and smoother frame rates in some of the PS4 consoleâ€™s greatest games. This PlayStation has VR integration. You will enjoy faster and smoother frame rates in select PS4 and PS VR games. This new exclusive PS5 featured 4K Ultra HD Blu-ray and 4K entertainment streaming. The exclusive features of the PS5 are its SSD, which significantly reduces the time it takes for games to start up, and its cutting-edge GPU, which enables ray-traced graphics and resolutions up to 4K at 120fps. The new PS5 controller is revolutionary, and the whole experience feels fresh, fast, and satisfying to use. Sony PlayStation 5 Digital Edition Gaming Console offers No Warranty.<br></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PlayStation 5 Digital Edition Console in Bangladesh?","paragraph":"The latest price of Sony PlayStation 5 Digital Edition Console in Bangladesh is 61,990৳. You can buy the Sony PlayStation 5 Digital Edition Console at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-digital-edition/sony-playstation-5-digital-edition-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-digital-edition/sony-playstation-5-digital-edition-02-500x500.jpeg"],"product_seo_title":"Sony PlayStation 5 Digital Edition Gaming Console Price in Bangladesh","product_seo_description":"Buy Sony PlayStation 5 Digital Edition Gaming Console at best price in Bangladesh. Latest Sony PS5 Gaming Console available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Sony PlayStation 5 Digital Edition Gaming Console"},{"url":"https://www.startech.com.bd/sony-playstation-5-gaming-console-japan-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-gaming-console-04-228x228.webp","title":"Sony PlayStation 5 Gaming Console Analog Edition (Japan Edition)","product_list_short_description":["AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","GPU: 10.28 TFLOPs, 36CUs at 2.23GHz","16GB GDDR6 + 825GB SSD","4K UltraHD Blu-ray, 8K support"],"price_new":0,"price_old":0,"price_single":75000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"In Stock","code":"32175","brand":"Sony","product_page_short_description":["MPN: CFI-1200A","Model: PlayStation 5","AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","GPU: 10.28 TFLOPs, 36CUs at 2.23GHz","16GB GDDR6 + 825GB SSD","4K UltraHD Blu-ray, 8K support"],"emi_price":6875,"full_description":"<h2 style=\"text-align: justify; \"><span style=\"font-weight: 700;\">Sony PlayStation 5 Gaming Console Analog Edition (Japan Edition)</span><br></h2><p style=\"text-align: justify;\">Sony <span style=\"font-weight: bold;\">PlayStation 5 Gaming Console</span> comes with an ultra-high-speed SSD and deeper immersion which supports haptic feedback, adaptive triggers, 3D Audio, and an all-new generation of incredible PlayStation games. The exclusive PS5 is a technically impressive piece of hardware. There are the new, 10.28 TFLOPs, 36 CUs at 2.23GHz GPU, Custom RDNA 2 GPU architecture that can push 4K resolution at 120 frames per second, and the octa-core AMD Zen 2-based CPU with a 3.5GHz clock speed. It is also featured with 16GB of GDDR6 / 256-bit memory and Custom 825GB SSD. Here,  The custom integration of the PS5 console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible. The PS 5 Marvel at incredible graphics and experiences new PS5 features, these are - Ray tracing, which provides you a new level of realism as rays of light are individually simulated, creating true-to-life shadows and reflections in supported PS5 games; 4K-TV gaming and also PS5 console is compatible with 8K displays through HDMI 2.1 support. The <a href=\"https://www.startech.com.bd/play-station\" target=\"\" style=\"color: rgb(0, 0, 0);\">PlayStation</a> 5 comes with smooth and fluid high frame rate gameplay at up to 120fps for compatible games, that support for 120Hz output on 4K displays. Here, the HDR technology-supported PS5 games display an unbelievably vibrant and lifelike range of colors. You will enjoy faster and smoother frame rates in select PS4 and PS VR games. This latest PlayStation 5 gives gamers the ability to let players upgrade their disc and digital PS4 games to digital PS5 games. This PlayStation has VR integration. It will provide you with Breathtaking immersion to Discover a deeper gaming experience with support for haptic feedback, adaptive triggers, and 3D Audio technology, and also you will enjoy life and truly experience with Tempest 3D AudioTech. In this, Sony PlayStation 5 The DualSense wireless controller for PS5 offers immersive haptic feedback, dynamic adaptive triggers, and a built-in microphone, all integrated into an iconic design. This new exclusive PS5 featured 4K Ultra HD Blu-ray and 4K entertainment streaming also. One of the best things about the PlayStation 5 is that it acts as a bridge between generations. Your entire library of digital PS4 games is there from the moment you log into your PSN account, and any great games you missed will likely be part of the PlayStation Plus Collection. The exclusive features of the PS5 are its SSD, which significantly reduces the time it takes for games to start up, and its cutting-edge GPU, which enables ray-traced graphics and resolutions up to 4K at 120fps. The new PS5 controller is revolutionary, and the whole experience feels fresh, fast, and satisfying to use.&nbsp;</p><h2 style=\"\">Buy Sony PlayStation 5 Gaming Console Analog Edition (Japan Edition) from Star Tech</h2><p>In Bangladesh, you can get original&nbsp;<span style=\"font-weight: 700;\">Sony PlayStation 5 Gaming Console Analog Edition (Japan Edition)</span>&nbsp;From Star Tech. We have a large collection of latest&nbsp;<a href=\"https://www.startech.com.bd/play-station\" target=\"\">Sony Gaming Console</a>&nbsp;to purchase. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a>&nbsp;Shop to get yours at lowest price. The Sony PlayStation 5 Gaming Console Analog Edition (Japan Edition) comes with no warranty.</p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-gaming-console-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-gaming-console-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-gaming-console-03-500x500.webp"],"product_seo_title":"Sony PlayStation 5 Gaming Console Analog Japan Edition Price in Bangladesh","product_seo_description":"Buy Sony PlayStation 5 Gaming Console Analog Japan Edition at best price in Bangladesh. Latest Sony PlayStation 5 Gaming Console Analog Edition available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"Sony PlayStation 5 Gaming Console Analog Edition (Japan Edition)"},{"url":"https://www.startech.com.bd/sony-playstation-5-gaming-console","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-02-228x228.jpg","title":"Sony PlayStation 5 Gaming Console (UK Edition)","product_list_short_description":["AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","GPU: 10.28 TFLOPs, 36CUs at 2.23GHz","16GB GDDR6 + 825GB SSD","4K UltraHD Blu-ray, 8K support"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Out Of Stock","code":"14931","brand":"Sony","product_page_short_description":["MPN: CFI-1116A","Model: PlayStation 5","AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","GPU: 10.28 TFLOPs, 36CUs at 2.23GHz","16GB GDDR6 + 825GB SSD","4K UltraHD Blu-ray, 8K support"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \"><span style=\"font-weight: bold;\">Sony PlayStation 5 Gaming Console</span></h2><p style=\"text-align: justify;\">Sony PlayStation 5 Gaming Console comes with an ultra-high-speed SSD, deeper immersion which is support for haptic feedback, adaptive triggers, 3D Audio, and an all-new generation of incredible PlayStation games. The exclusive PS5 is a technically impressive piece of hardware. There are the new, 10.28 TFLOPs, 36 CUs at 2.23GHz GPU, Custom RDNA 2 GPU architecture that can push 4K resolution at 120 frames per second, and the octa-core AMD Zen 2-based CPU with a 3.5GHz clock speed. It is also featured with 16GB of GDDR6 / 256-bit memory and Custom 825GB SSD. Here,  The custom integration of the PS5 console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible. The PS 5 Marvel at incredible graphics and experience new PS5 features, these are - Ray tracing, that provides you a new level of realism as rays of light are individually simulated, creating true-to-life shadows and reflections in supported PS5 games; 4K-TV gaming and also PS5 console is compatible with 8K displays through HDMI 2.1 support. . The PlayStation 5 comes with smooth and fluid high frame rate gameplay at up to 120fps for compatible games, that support for 120Hz output on 4K displays. Here, the HDR technology supported PS5 games display an unbelievably vibrant and lifelike range of colors. You will enjoy faster and smoother frame rates in select PS4 and PS VR games. This latest PlayStation 5 gives gamers the ability to let players upgrade their disc and digital PS4 games to digital PS5 games. This PlayStation has VR integration. It will provide you with Breathtaking immersion to Discover a deeper gaming experience with support for haptic feedback, adaptive triggers, and 3D Audio technology, and also you will enjoy life and truly experience with Tempest 3D AudioTech. In this, Sony PlayStation 5 The DualSense wireless controller for PS5 offers immersive haptic feedback, dynamic adaptive triggers, and a built-in microphone, all integrated into an iconic design. This new exclusive PS5 featured 4K Ultra HD Blu-ray and 4K entertainment streaming also. One of the best things about the PlayStation 5 is that it acts as a bridge between generations. Your entire library of digital PS4 games is there from the moment you log into your PSN account, and any great games you missed will likely be part of the PlayStation Plus Collection. The exclusive features of the PS5 are its SSD, which significantly reduces the time it takes for games to start up, and its cutting-edge GPU, which enables ray-traced graphics and resolutions up to 4K at 120fps. The new PS5 controller is revolutionary, and the whole experience feels fresh, fast, and satisfying to use. This latest  Sony PlayStation 5 Gaming Console has No Parts Warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PlayStation 5 Gaming Console in Bangladesh?","paragraph":"The latest price of Sony PlayStation 5 Gaming Console in Bangladesh is 72,500৳. You can buy the Sony PlayStation 5 Gaming Console at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5/playstation-5-03-500x500.jpg"],"product_seo_title":"Sony PlayStation 5 Gaming Console Price in Bangladesh","product_seo_description":"Buy Sony PlayStation 5 Gaming Console at best price in Bangladesh, Order online or visit your nearest Star Tech branch.","product_seo_keywords":"Sony PlayStation 5 Gaming Console (UK Edition)"},{"url":"https://www.startech.com.bd/sony-playstation-5-analog-console-marvel-s-spider-man-2-bundle-slim-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-marvel-s-spider-man-2-bundle-slim-edition/playstation-5-analog-console-marvel-s-spider-man-2-bundle-slim-edition-01-228x228.webp","title":"Sony PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition","product_list_short_description":["Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Out Of Stock","code":"32755","brand":"Sony","product_page_short_description":["Model: PlayStation 5","Up to 120fps with 120Hz Output","Ray Tracking - 4K TV Gaming","1TB Ultra-High Speed SSD","3D AudioTech, Disc Drive"],"emi_price":0,"full_description":"<h2>Sony PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition</h2><p>The Sony <strong>PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition</strong> open up hitherto unimagined gaming possibilities. Rewrite the limits of what a PlayStation console can accomplish by utilizing the capabilities of an integrated CPU, GPU, and SSD. Admire the astounding visuals and explore the latest features of the PS5. Play the PS4 games that are back catalog compatible. With support for 3D audio technologies, adjustable triggers, and haptic feedback, you can dive deeper into the game experience. With the support of haptic feedback, adaptive triggers, 3D audio, and an ultra-high-speed SSD, enjoy lightning-fast loading times as well as deeper immersion. Plus, enjoy an outstanding selection of new PlayStation titles. </p><h3>Ultra-High-Speed 1TB SSD Storage</h3><p>With 1TB of SSD storage built in, you can have your favorite games ready and waiting for you to pick them up and play. Get the most out of your play sessions with almost instantaneous PS5 game loads. Over 4,000 PS4 titles are compatible with the PS5 system. You may even experience quicker and more fluid frame rates in some of the best PS4 with the Game Boost function.</p><h3>Slim Design</h3><p>Get modern gaming technology housed in a stylish, small console with the PS5 Digital Edition Slim. Because of the PS5 console's unique system integration, developers can now instantly retrieve data from the SSD and construct games in a way that was before unattainable.</p><h3>Up to 120fps with 120Hz Output</h3><p>With compatibility for 120Hz output on 4K TVs, experience fluid and smooth high-frame rate gaming at up to 120 frames per second. With individually simulated light beams producing lifelike shadows and reflections in compatible PS5 games, you can fully immerse yourself in settings with incredible realism. Enjoy your favorite PS5 Digital Edition Slim on your gorgeous 4K television. Playing PS5 games on an HDR TV brings the games' incredibly vivid and realistic color palette to life.</p><h3>3D AudioTech</h3><p>Enter environments where noises seem to be coming from all directions. Games that support Tempest 3D AudioTech make your environment seem very real. With individually simulated light beams producing lifelike shadows and reflections in compatible PS5 games, you can fully immerse yourself in settings with incredible realism.</p><h2>Buy Sony PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition From Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/play-station\" target=\"\">Sony Gaming Console</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition comes with no warranty.</p><p><span style=\"font-size: 12px; background-color: yellow; font-weight: bold;\">*** Bundle includes Marvel’s Spider-Man 2 full-game digital voucher</span></p><p><span style=\"font-size: 12px; background-color: yellow; font-weight: bold;\">*** Vertical stand sold separately</span></p>","specifications":[],"latest_price":{"heading":"What is the price of Sony PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition in Bangladesh?","paragraph":"The latest price of Sony PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition in Bangladesh is 75,000৳. You can buy the Sony PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-marvel-s-spider-man-2-bundle-slim-edition/playstation-5-analog-console-marvel-s-spider-man-2-bundle-slim-edition-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-slim-edition/playstation-5-analog-console-slim-edition-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-console-marvel-s-spider-man-2-bundle-slim-edition/playstation-5-analog-console-marvel-s-spider-man-2-bundle-slim-edition-02-500x500.webp"],"product_seo_title":"PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition Price in BD","product_seo_description":"Buy PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition at best price in Bangladesh. Order PlayStation 5 Analog Console Marvel’s Spider-Man 2 Slim Edition from Star Tech Online Shop in BD.\n","product_seo_keywords":"Sony PlayStation 5 Analog Console Marvel’s Spider-Man 2 Bundle Slim Edition"},{"url":"https://www.startech.com.bd/sony-playstation-5-analog-version-fifa-2023-edition","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-version-fifa-2023-bundle/playstation-5-analog-version-fifa-2023-bundle-04-228x228.webp","title":"Sony PlayStation 5 Analog Version FIFA 2023 Edition","product_list_short_description":["AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","16GB GDDR6 + 825GB SSD","HDR technology and 8K output","4K-TV gaming, with up to 120fps with 120Hz output"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Out Of Stock","code":"25251","brand":"Sony","product_page_short_description":["Model: PlayStation 5","AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","16GB GDDR6 + 825GB SSD","HDR technology and 8K output","4K-TV gaming, with up to 120fps with 120Hz output"],"emi_price":0,"full_description":"<h2>Sony PlayStation 5 Analog Version FIFA 2023 Edition</h2><p></p><div style=\"text-align: justify;\">The<a href=\"https://www.startech.com.bd/play-station\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\"> PlayStation 5 </a>Console EA SPORTS FIFA 23 Edition brings The World's Game to the pitch, complete with HyperMotion2 Technology, both the men's and women's FIFA World Cups, the addition of women's club teams, and dedicated support for PS5 exclusive features such as Haptic Feedback, Adaptive Tiggers, and 3D Audio. SSD with Ultra-High Speed Increase the length of your gaming sessions by having loaded PS5 games load virtually instantly. Custom integration enables producers to retrieve data from SSDs faster than ever before, opening up new options for game designers. Tracing Rays As beams of light are individually replicated, you will be immersed in a new degree of realism. The PlayStation 5 system enables realistic shadows and reflections in PS5TM games. Gaming on 4K TV With compatibility for 120Hz output on 4K TVs, you can enjoy smooth and fluid high frame rate gameplay at up to 120fps for compatible games. 8K and HDR output Supported PS5 games offer a more brilliant spectrum of colors when viewed on an HDR TV. PS5 consoles offer 8K output, allowing you to play games on your 4320p monitor. Audio in 3D Immerses yourself in soundscapes where the sound seems to emanate from every direction. Tempest 3D AudioTech brings in-game environments to life through your headphones or TV speakers in approved titles.</div>","specifications":[],"latest_price":{"heading":"What is the price of Sony PlayStation 5 Analog Version FIFA 2023 Edition in Bangladesh?","paragraph":"The latest price of Sony PlayStation 5 Analog Version FIFA 2023 Edition in Bangladesh is 87,000৳. You can buy the Sony PlayStation 5 Analog Version FIFA 2023 Edition at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-version-fifa-2023-bundle/playstation-5-analog-version-fifa-2023-bundle-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-analog-version-fifa-2023-bundle/playstation-5-analog-version-fifa-2023-bundle-01-500x500.webp"],"product_seo_title":"Sony PlayStation 5 Analog Version FIFA 2023 Edition Price in Bangladesh","product_seo_description":"Buy Sony PlayStation 5 Analog Version FIFA 2023 Edition at the best price in Bangladesh. Latest Sony PlayStation 5 available at Star Tech Shop. Order online to get delivery anywhere in BD.","product_seo_keywords":"Sony PlayStation 5 Analog Version FIFA 2023 Edition"},{"url":"https://www.startech.com.bd/sony-playstation-5-gaming-console-and-playstation-vr2-combo","img":"https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-gaming-console-and-playstation-vr2-combo/playstation-5-gaming-console-and-playstation-vr2-combo-01-228x228.webp","title":"Sony PlayStation 5 Gaming Console Analog Edition & PlayStation VR2 Combo","product_list_short_description":["AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","GPU: 10.28 TFLOPs, 36CUs at 2.23GHz","Display Method: OLED","Panel resolution​: 2000 x 2040 per eye"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Out Of Stock","code":"32095","brand":"Sony","product_page_short_description":["Model: PlayStation 5 Gaming Console & PlayStation VR2","AMD Zen 2-based CPU with 8 cores at 3.5GHz (variable frequency)","GPU: 10.28 TFLOPs, 36CUs at 2.23GHz","Display Method: OLED","Panel resolution​: 2000 x 2040 per eye"],"emi_price":0,"full_description":"<h2>Sony PlayStation 5 Gaming Console Analog Edition &amp; PlayStation VR2 Combo</h2><p>The Sony PlayStation 5 Gaming Console Analog Edition is a gaming powerhouse with an AMD Zen 2-based CPU clocked at 3.5GHz, a 10.28 TFLOP GPU with 36 compute units clocked at 2.23GHz, 16GB of GDDR6 RAM, and an 825GB SSD for lightning-fast loading times. It also supports 4K Ultra HD Blu-ray and 8K movies, providing breathtaking images and realistic graphics for an immersive gaming experience. When combined with the Sony PlayStation VR2, the gaming experience soars to new heights. The VR2 headgear employs OLED technology, with a screen resolution of 2000 x 2040 per eye and a range of vision of about 110 degrees, to provide vibrant and immersive graphics. A USB Type-C connector ensures low-latency connectivity with the PS5. The headgear also includes a built-in microphone for in-game communication and a stereo headphone port for realistic audio. This combination provides players with a great balance of high-performance gaming and immersive virtual reality, guaranteeing a next-level gaming experience.<br></p><p><span style=\"font-weight: bold;\">To learn more please visit:<br></span></p><p><a href=\"https://www.startech.com.bd/sony-playstation-5-gaming-console\" target=\"\" style=\"\">Sony PlayStation 5 Gaming Console Analog Edition</a></p><p><a href=\"https://www.startech.com.bd/sony-playstation-vr2\" target=\"\" style=\"\">Sony PlayStation VR2</a></p>","specifications":[],"latest_price":{},"images":["https://www.startech.com.bd/image/cache/catalog/gaming-console/playstation/playstation-5-gaming-console-and-playstation-vr2-combo/playstation-5-gaming-console-and-playstation-vr2-combo-01-500x500.webp"],"product_seo_title":"Sony PlayStation 5 Gaming Console & PlayStation VR2 Combo Price in Bangladesh","product_seo_description":"Buy Sony PlayStation 5 Gaming Console & PlayStation VR2 Combo at best price in Bangladesh. Latest Sony PlayStation 5 Gaming Console & PlayStation VR2 Combo available at Star Tech Shop. Order online & get delivery in BD.","product_seo_keywords":"Sony PlayStation 5 Gaming Console Analog Edition & PlayStation VR2 Combo"},{"url":"https://www.startech.com.bd/sony-playstation-pulse-elite-headset","img":"https://www.startech.com.bd/image/cache/catalog/headphone/sony/pulse-elite/pulse-elite-01-228x228.webp","title":"Sony PlayStation PULSE Elite Wireless Headset","product_list_short_description":["Planar Magnetic Drivers","Retractable Microphone","Multi-Device Bluetooth Connectivity","AI-Enhanced Noise Rejection"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"PlayStation Price in Bangladesh | Star Tech","cat_seo_description":"Buy PlayStation at best price in Bangladesh. Find your favorite Play Station at lowest price. Order online or visit your nearest Star Tech branch.","cat_seo_keywords":"PlayStation","status":"Up Coming","code":"32528","brand":"Sony","product_page_short_description":["Model: PULSE Elite","Planar Magnetic Drivers","Retractable Microphone","Multi-Device Bluetooth Connectivity","AI-Enhanced Noise Rejection"],"emi_price":0,"full_description":"<h2>Sony PlayStation PULSE Elite Wireless Headset</h2><p>The Sony PlayStation <strong>PULSE Elite</strong> Wireless Headset With lifelike sound and lightning-fast networking, enter a new era in gaming audio. Hear every detail with a lossless and lightning-fast PlayStation Link wireless connection. Allow your squad to hear you clearly and loudly thanks to a fully retractable microphone with AI-enhanced noise rejection. Furthermore, with up to 30 hours of battery life and rapid charging, you can stay with your colleagues during long gaming sessions. Studio-inspired drivers replicate soundscapes with ultra-low distortion, delivering rich details and deep, clean bass, so you can hear what the game developers intended. With the Sony PlayStation PULSE Elite Wireless Headset, enjoy a lossless and ultra-low-latency wireless connection to your PS5, PC, Mac, and PlayStation Portal remote player. With artificial intelligence-powered microphone noise-rejection technology, you can be heard clearly and loudly. The PlayStation PULSE Elite Headset wirelessly connects to a variety of devices, so you may go wherever your adventure leads you. Connect your earbuds directly to your phone or tablet to go mobile. Listen to audio from a PlayStation Link&nbsp;and a Bluetooth&nbsp;device at the same time to stay in play while answering calls or listening to music from a mobile device. With their crystal-clear voice capture and simple controls, you can lead your squad to victory. When not in use, fully retract the in-built microphone. With easy-access volume and mic mute buttons, you can keep your focus on the game.</p> <h3>Next-Generation Gaming Audio with Planar Magnetic Drivers</h3><p>You can hear games just as the creators intended thanks to these drivers that are modeled after recording studios. The Sony PlayStation PULSE Elite Wireless Headset recreates sound across the whole frequency range with almost perfect precision. Take in soundscapes brimming with nuanced, rich details, and feel every moment of every epic in-game encounter with the help of the deep bass. Play PS5 games with 3D audio support and improve your perception. The audio cues are positioned incredibly accurately in all three dimensions.</p><h3>AI-Assisted Noise Rejection</h3><p>With microphone noise-rejection technology, you can be heard clearly and loudly. This Sony PlayStation<strong> PULSE Elite</strong> Headphone has new technology, which is powered by artificial intelligence and has been trained to identify, isolate, and remove undesired noises when capturing your voice.</p><h3>Easy Connect with PlayStation</h3><p>Never miss a beat again with revolutionary ultra-low latency and lossless PlayStation Link wireless technology that delivers sound at lightning-fast speed without sacrificing a single audio nuance. The PlayStation PULSE Elite Wireless Headset connects and switches between PlayStation Link devices, such as your PS5 console, PC, Mac, and PlayStation Portal remote player, with ease.</p><h2>Buy Sony PlayStation PULSE Elite Wireless Headset From Star Tech</h2><p>In Bangladesh, you can get original <strong>Sony PlayStation PULSE Elite Wireless Headset</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/sony-headphone\" target=\"\">Sony Headphone</a> to purchase for your <a href=\"https://www.startech.com.bd/play-station\" target=\"\">PlayStation</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Sony PlayStation PULSE Elite Wireless Headset comes no warranty.</p>","specifications":[{"heading":"Technical Specification","values":[{"key":"Driver Magnet","value":"Planar Magnetic Drivers"},{"key":"Connectivity","value":"Bluetooth"},{"key":"Battery Life","value":"Up to 30 hours"}]},{"heading":"Physical Specification","values":[{"key":"Color","value":"White"}]},{"heading":"Other Features","values":[{"key":"System Requirements","value":"PlayStation Link compatible devices, including your PS5 console, PC, Mac and PlayStation Portal remote player"}]},{"heading":"Microphone","values":[{"key":"Microphone Size","value":"Retractable microphone"}]},{"heading":"Warranty Information","values":[{"key":"Manufacturing Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of Sony PlayStation PULSE Elite Headset in Bangladesh?","paragraph":"The latest price of Sony PlayStation PULSE Elite Headset in Bangladesh is 0৳. You can buy the Sony PlayStation PULSE Elite Headset at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/headphone/sony/pulse-elite/pulse-elite-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/headphone/sony/pulse-elite/pulse-elite-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/headphone/sony/pulse-elite/pulse-elite-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/headphone/sony/pulse-elite/pulse-elite-04-500x500.webp"],"product_seo_title":"Sony PlayStation PULSE Elite Wireless Headset Price in Bangladesh","product_seo_description":"Buy Sony PlayStation PULSE Elite Wireless Headset at best price in Bangladesh. Order latest Sony PlayStation PULSE Elite Headset from Star Tech Shop for delivery in BD.","product_seo_keywords":"Sony PlayStation PULSE Elite Wireless Headset"}]