[{"url":"https://www.startech.com.bd/xiaomi-mijia-induction-cooker-youth-edition","img":"https://www.startech.com.bd/image/cache/catalog/appliance/induction-cooker/xiaomi/mijia-induction-cooker-youth-edition/mijia-induction-cooker-youth-edition-01-228x228.webp","title":"Xiaomi Mijia Induction Cooker Youth Edition","product_list_short_description":["2100W Power, Thickened Dense Coils","Hot and Cold Duct Insulation","Built-In Temperature Sensor Triggers","Grade 9 Small Firepower Adjustment"],"price_new":8000,"price_old":8490,"price_single":8000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"In Stock","code":"32471","brand":"XIAOMI","product_page_short_description":["Model: DCL002CM","2100W Power, Thickened Dense Coils","Hot and Cold Duct Insulation","Built-In Temperature Sensor Triggers","Grade 9 Small Firepower Adjustment"],"emi_price":778,"full_description":"<h2>Xiaomi Mijia Induction Cooker Youth Edition</h2><p>The <strong>Xiaomi Mijia Induction Cooker Youth Edition</strong> has 2100W power and provides fast and even heating. It has thickened, dense coils, which reduce heat loss and maintain low continuous heating power. This saves energy and prevents overheating. The Xiaomi Mijia Induction Cooker has a double anti-skid design, which makes it stable and durable. It has a silicone pad on the bottom and a metal ring on the top, which prevents the device from sliding or scratching the countertop. The Xiaomi Induction Cooker also has hot and cold duct insulation, which separates the hot and cold air flows and prevents the device from getting too hot or too cold. The Xiaomi Mijia Induction Cooker has a high-temperature protection system, which monitors the temperature and adjusts the power accordingly. It also has a grade 9 small firepower adjustment, which allows you to control the heat level with precision. You can choose from different cooking modes, such as frying, boiling, steaming, and stewing. When the temperature reaches the predetermined protective temperature, an integrated temperature sensor stops heating and activates the overheating prevention system. The induction cooker will emit a tone, cease heating automatically, and flash its LED light if the pot is removed. The induction cooker will automatically resume heating after a minute if it identifies the matching pot again. The Mijia Induction Cooker Youth Version employs dual-frequency fire heating technology to address the issue of indirect heating. High-temperature high-frequency is used to produce the stir-fry's firepower, while low-temperature low-frequency can keep the food warm.</p><h2>Buy Xiaomi Mijia Induction Cooker Youth Edition From Star Tech</h2><p>In Bangladesh, you can get original <strong>Xiaomi Mijia Induction Cooker Youth Edition</strong> From Star Tech. We have a large collection of latest Induction Cooker to purchase. Order Online Or Visit your Nearest Star Tech Shop to get yours at lowest price. The Xiaomi Mijia Induction Cooker Youth Edition comes with 06-month warranty. <span style=\"font-weight: bold; background-color: yellow;\">(Xiaomi Warranty Card must be kept for warranty claims.)</span></p>","specifications":[],"latest_price":{"heading":"What is the price of Xiaomi Mijia Induction Cooker in Bangladesh?","paragraph":"The latest price of Xiaomi Mijia Induction Cooker in Bangladesh is 8,000৳. You can buy the Xiaomi Mijia Induction Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/induction-cooker/xiaomi/mijia-induction-cooker-youth-edition/mijia-induction-cooker-youth-edition-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/appliance/induction-cooker/xiaomi/mijia-induction-cooker-youth-edition/mijia-induction-cooker-youth-edition-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/appliance/induction-cooker/xiaomi/mijia-induction-cooker-youth-edition/mijia-induction-cooker-youth-edition-03-500x500.webp"],"product_seo_title":"Xiaomi Mijia Induction Cooker Youth Edition Price in Bangladesh","product_seo_description":"Buy Xiaomi Mijia Induction Cooker Youth Edition at best price in Bangladesh. Order latest Xiaomi Mijia Induction Cooker Youth Edition from Star Tech for delivery in BD.","product_seo_keywords":"Xiaomi Mijia Induction Cooker Youth Edition"},{"url":"https://www.startech.com.bd/panasonic-nf-n51awtz-slow-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/nf-n51awtz/nf-n51awtz-01-228x228.webp","title":"Panasonic NF-N51AWTZ Slow Cooker","product_list_short_description":["Prepare Dishes Without Hassle","Manual Heat Control","Constant Monitoring","Allowing Safe Cooking for Up to 8 Hours"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34312","brand":"Panasonic","product_page_short_description":["Model: NF-N51AWTZ","Prepare Dishes Without Hassle","Manual Heat Control","Constant Monitoring","Allowing Safe Cooking for Up to 8 Hours"],"emi_price":0,"full_description":"<h2>Panasonic NF-N51AWTZ Slow Cooker</h2><p>The Panasonic <strong>NF-N51AWTZ</strong> Slow Cooker is a multipurpose kitchen staple that simplifies meal preparation while producing excellent results. This unique gadget includes three handy pre-set cooking choices - Low, High, and Auto - that allow users to easily adjust their cooking experience to a wide range of dishes, from savory stews to scrumptious desserts. With the ability to alter cooking durations and settings, attaining the best results has never been easier. With its intelligent side heater design, this slow cooker provides complete and uniform cooking, ensuring that every mouthful is properly cooked. The pot is made of thick, durable ceramic, which is known for its great heat resistance and nonstick qualities, allowing for easy food release and cleaning. Its particular design is focused on heat retention. The slow cooker has a heat-resistant glass cover that resists stains and allows for easy cleaning. A protective silicone rubber handle prevents direct contact with the heated glass surface, assuring safe handling while in use. The ceramic pot's smooth surface makes it even easier to use, since food slips off without clinging or leaving any residue. The Panasonic NF-N51AWTZ Slow Cooker is ideal for both busy people and families, since it streamlines the cooking process and allows users to produce nourishing, home-cooked meals with less effort. </p><h3>Slow-Cooked Dishes Are Efficiently Prepared</h3><p>With the NF-N51AWTZ slow cooker, you may prepare foods without having to manually manage the heat or check them constantly. Spillage is reduced by using steady, mild, and uniform heating, which allows for safe cooking for up to 8 hours with minimum supervision.</p><h3>Maximises Flavour and Nutrition</h3><p>Slow cooking allows the flavors to seep in. Gradual cooking at moderate temperatures reduces nutritional loss and gradually enhances the taste of the components. This facilitates the creation of delectable, delicate, and flavorful dishes.</p><h3>3 Heat Settings for Various Recipes</h3><p>Cook a selection of healthful meals, including soups, stews, and desserts, using three easy pre-sets: low, high, and auto. To achieve the best results, adjust the cooking time and setting accordingly.Low power For stewing and keeping warm. High power For cooking and boiling. Auto system For mild cooking during the day or overnight.</p><h2>Buy Panasonic NF-N51AWTZ Slow Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NF-N51AWTZ Slow Cooker </strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic NF-N51AWTZ Slow Cooker comes with 3 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic NF-N51AWTZ Slow Cooker in Bangladesh?","paragraph":"The latest price of Panasonic NF-N51AWTZ Slow Cooker in Bangladesh is 0৳. You can buy the Panasonic NF-N51AWTZ Slow Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/nf-n51awtz/nf-n51awtz-01-500x500.webp"],"product_seo_title":"Panasonic NF-N51AWTZ Slow Cooker Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic NF-N51AWTZ Slow Cooker at best price in Bangladesh. Latest Panasonic NF-N51AWTZ Slow Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic NF-N51AWTZ Slow Cooker"},{"url":"https://www.startech.com.bd/panasonic-sr-jq185-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-jq185/sr-jq185-01-228x228.webp","title":"Panasonic SR-JQ185 Rice Cooker","product_list_short_description":["2-in-1: Quick cook & Steaming","Quick-cook (18 minutes/3 cups)","5-layer inner pan","Detachable inner lid"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34314","brand":"Panasonic","product_page_short_description":["Model: SR-JQ185","2-in-1: Quick cook & Steaming","Quick-cook (18 minutes/3 cups)","5-layer inner pan","Detachable inner lid"],"emi_price":0,"full_description":"<h2>Panasonic SR-JQ185 Rice Cooker</h2><p>The Panasonic <strong>SR-JQ185</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a cutting-edge kitchen device that will transform the way you cook rice and steam foods. This rice cooker is perfect for families, gatherings, and meal preparation, with a big 1.8-liter capacity that can hold 10 cups of cooked rice. Whether you're preparing a modest family supper or throwing a big party, this rice cooker has you covered. The SR-JQ185's 2-in-1 capability provides a variety of cooking options, including rapid cook and steaming modes. The rapid cook function is especially outstanding, producing freshly cooked rice in only 18 minutes for up to 3 cups, making it an ideal choice for hectic weeknights or when you need rice quickly. This rice cooker is designed with a sturdy 5-layer inner pan with a black Flon coating to provide equal heat distribution and reliably great results every time. Cleaning is also made easier by the Flon coating, which allows rice and other contents to slip right off. The detachable inner lid facilitates cleaning and maintenance by enabling easy access to all parts of the stove. Furthermore, the keep warm feature preserves your rice at the ideal serving temperature for up to 5 hours, ensuring that your meals are always ready for consumption. This rice cooker has an 800 watt power rating and is compatible with 220-240 volts, allowing it to function efficiently while spending minimum energy. In addition, the cooker includes important accessories such as a measuring cup, rice scoop, and steam basket, allowing you to easily prepare tasty meals. The Panasonic SR-JQ185 Rice Cooker combines modern technology, variety, and convenience to make cooking easier and produce great results every time. Whether you're a seasoned chef or a rookie cook, this rice cooker will quickly become a must-have item in your kitchen. </p><h2>Buy Panasonic SR-JQ185 Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-JQ185 Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-JQ185 Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-JQ185 Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-JQ185 Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-JQ185 Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-jq185/sr-jq185-01-500x500.webp"],"product_seo_title":"Panasonic SR-JQ185 Rice Cooker Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-JQ185 Rice Cooker at best price in Bangladesh. Latest Panasonic SR-JQ185 Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-JQ185 Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-jp185-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-jp185/sr-jp185-01-228x228.webp","title":"Panasonic SR-JP185 Rice Cooker","product_list_short_description":["3 in 1: White Rice, Steaming, Porridge","5 Hour Keep Warm Function","Detachable Inner Lid","5-Layer Inner Pan"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34315","brand":"Panasonic","product_page_short_description":["Model: SR-JP185","3 in 1: White Rice, Steaming, Porridge","5 Hour Keep Warm Function","Detachable Inner Lid","5-Layer Inner Pan"],"emi_price":0,"full_description":"<h2>Panasonic SR-JP185 Rice Cooker</h2><p>The Panasonic <strong>SR-JP185</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a versatile kitchen companion intended to make meal preparation easier with its simple features and large capacity. With a huge 1.8-liter capacity, this rice cooker is ideal for making wonderful amounts of fluffy rice for the entire family. Its 3-in-1 capability allows users to easily produce white rice, steam ingredients, and cook creamy porridge to perfection. With a 5-hour keep warm feature, this rice cooker keeps your cooked rice at the perfect serving temperature, making it great for busy homes or dinner parties. The detachable inner cover makes cleaning simple, while the revolutionary 5-layer inner pan with a 1.5mm black Flon coating assures uniform heat distribution and properly cooked rice every time. The non-stick coating of the inner pan facilitates easy cleaning and maintenance, saving you time and effort in the kitchen. The rice cooker includes essential attachments such as a measuring cup, rice scoop, porridge scoop, and steam basket, enhancing ease and versatility for a wide range of culinary demands. Furthermore, the detachable power cord expands the kitchen appliance's usage and storage options. Whether you're cooking for a family or entertaining guests, the Panasonic SR-JP185 Rice Cooker delivers consistent performance and outstanding results, making it an essential addition to any kitchen.</p><h2>Buy Panasonic SR-JP185 Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-JP185 Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-JP185 Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-JP185 Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-JP185 Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-JP185 Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-jp185/sr-jp185-01-500x500.webp"],"product_seo_title":"Panasonic SR-JP185 Rice Cooker Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-JP185 Rice Cooker at best price in Bangladesh. Latest Panasonic SR-JP185 Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-JP185 Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-jn185-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-jn185/sr-jn185-01-228x228.webp","title":"Panasonic SR-JN185 Rice Cooker","product_list_short_description":["Automatic Rice Cooker.","Energy Savings : 650 watts.","Rice Cooker Capacity : 1.8 Liters.","Keep Warm up to 5 hours."],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34317","brand":"Panasonic","product_page_short_description":["Model: SR-JN185","Automatic Rice Cooker.","Energy Savings : 650 watts.","Rice Cooker Capacity : 1.8 Liters.","Keep Warm up to 5 hours."],"emi_price":0,"full_description":"<h2>Panasonic SR-JN185 Rice Cooker</h2><p>The Panasonic <strong>SR-JN185</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a flexible and feature-rich kitchen device that will enhance your cooking experience. This automatic rice cooker has several preset menu options, including settings for white rice, steaming, and porridge, allowing it to satisfy a variety of culinary tastes. It has a substantial capacity of 1.8 liters, which is comparable to about 10 cups of cooked rice, making it ideal for serving families, parties, and meal prep sessions. One of the SR-JN185's distinguishing qualities is its energy-efficient design, which operates at only 650 watts while maintaining performance. This not only saves money on power but also has a lower environmental effect, making it a viable option for environmentally concerned homes. Furthermore, the cooker has a keep warm option, which can keep rice at an optimal serving temperature for up to 5 hours, ensuring your meals are ready to enjoy whenever you're ready to dine. The rice cooker comes with a handy steaming basket, allowing you to create nutritious and fragrant steamed foods in addition to rice. Whether it's veggies, fish, or dumplings, this flexible attachment increases the SR-JN185's culinary capabilities, allowing you to easily prepare a range of healthful meals. The cooker's architecture includes a bottom edge dimple pan and a 5-layer black fluorine inner pan, which ensures even heat distribution and reliably wonderful results with each batch of rice. Cleaning and maintenance are made simple owing to the removable power cord and inner lid, which provide easy access to all regions of the stove. The SR-JN185 was designed with user convenience in mind, and it includes a swing handle for convenient transfer from the kitchen to the dining table or service area. With a power rating of 220V and 50Hz, this rice cooker may be used in a variety of settings and provide dependable performance wherever you travel. The Panasonic SR-JN185 Rice Cooker combines innovative functionality, energy efficiency, and a user-friendly design to provide outstanding cooking results and convenience to homes of all sizes. Whether you're making a fast weekday supper or entertaining a major occasion, this multifunctional device will quickly become a staple in your kitchen.</p><h2>Buy Panasonic SR-JN185 Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-JN185 Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-JN185 Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-JN185 Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-JN185 Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-JN185 Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-jn185/sr-jn185-01-500x500.webp"],"product_seo_title":"Panasonic SR-JN185 Rice Cooker Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-JN185 Rice Cooker at best price in Bangladesh. Latest Panasonic SR-JN185 Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-JN185 Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-3na-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-3na/sr-3na-01-228x228.webp","title":"Panasonic SR-3NA Rice Cooker","product_list_short_description":["Automatic Cooking","Small Quantity Cooking","Saves Time and Energy","Light Weight and Easy to Carry"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34318","brand":"Panasonic","product_page_short_description":["Model: SR-3NA","Automatic Cooking","Small Quantity Cooking","Saves Time and Energy","Light Weight and Easy to Carry"],"emi_price":0,"full_description":"<h2>Panasonic SR-3NA Rice Cooker</h2><p>The Panasonic <strong>SR-3NA</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a little but powerful kitchen appliance designed to make it easier to cook small amounts of rice. This rice cooker has a capacity of 300ml, which is comparable to cooking 0.16kg of rice. It is ideal for individuals, small homes, and making baby food. Operating at 200 watts, it provides efficient performance while conserving energy. The clear glass top enables for easy observation of the cooking process, resulting in properly cooked rice each time. With autonomous cooking features, the SR-3NA eliminates the guesswork from meal preparation, offering consistent results with less effort. Its small cooking capacity makes it excellent for making infant food, giving a sanitary and easy alternative for parents. Furthermore, this rice cooker saves time and energy, making it an environmentally beneficial option for modern kitchens. Its lightweight and compact form makes it easy to transport and store, making it ideal for tiny flats, dorm rooms, and travel. Whether you're cooking for yourself or your child, the Panasonic SR-3NA Rice Cooker provides simplicity, efficiency, and dependability in a compact size.</p><h2>Buy Panasonic SR-3NA Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-3NA Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-3NA Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-3NA Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-3NA Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-3NA Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-3na/sr-3na-01-500x500.webp"],"product_seo_title":"Panasonic SR-3NA Rice Cooker Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-3NA Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-3NA Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-3NA Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-g06-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-g06/sr-g06-01-228x228.webp","title":"Panasonic SR-G06 Rice Cooker","product_list_short_description":["Easy to operate","Convenient side plug","Keep-warm function","keeps rice warm up to 5 hours"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34319","brand":"Panasonic","product_page_short_description":["Model: SR-G06","Easy to operate","Convenient side plug","Keep-warm function","keeps rice warm up to 5 hours"],"emi_price":0,"full_description":"<h2>Panasonic SR-G06 Rice Cooker</h2><p>The Panasonic <strong>SR-G06</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a flexible and dependable kitchen device that simplifies the rice cooking process while providing precise control and efficient performance. This tiny 3-cup rice cooker is ideal for small families or for 2-3 people, since it provides convenience without sacrificing quality. The SR-G06 features a thermostat for precise temperature control throughout the cooking cycle, ensuring precisely cooked rice every time. Additionally, a thermal fuse is included to prevent the device from burnout, assuring long-term endurance and safety. The rice cooker has a cast heater with a big and flat surface area, which optimizes heat dispersion for even cooking outcomes. This effective heat conduction not only assures consistent cooking but also shortens cooking time, making meal preparation quick and easy. The SR-G06, made with an aluminum frying pan, encourages speedier cooking while using less oil, making it an excellent choice for health-conscious folks. The nonstick surface of the frying pan makes it even easier to release and clean food. The SR-G06 is simple to operate because of its one-touch selection button, which allows users to quickly pick from a variety of cooking settings. The simple side plug improves usage and storage possibilities, resulting in a clutter-free countertop. The rice cooker includes a keep-warm mode that keeps the rice at an ideal serving temperature for up to 5 hours, allowing you to eat freshly cooked rice whenever you want without worrying about it going cold. The Panasonic SR-G06 Rice Cooker operates at 220/240 volts and 50 Hz, making it suited for a wide range of kitchen situations. With its mix of precise control, efficient performance, and user-friendly features, it's a must-have for any modern kitchen, easing meal preparation and delivering delicious results every time.</p><h2>Buy Panasonic SR-G06 Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-G06 Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-G06 Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-G06 Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-G06 Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-G06 Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-g06/sr-g06-01-500x500.webp"],"product_seo_title":"Panasonic SR-G06 Rice Cooker Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-G06 Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-G06 Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-G06 Rice Cooker"},{"url":"https://www.startech.com.bd/panasonic-sr-w18g-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-w18g/sr-w18g-01-228x228.webp","title":"Panasonic SR-W18G Rice Cooker","product_list_short_description":["Easy to Operate","Keep-warm Function Keeps Rice Warm up to 5 Hours","Thermostat Prevents Overcooking and Boil Over","One Touch Selector Button"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34321","brand":"Panasonic","product_page_short_description":["Model: SR-W18G","Easy to Operate","Keep-warm Function Keeps Rice Warm up to 5 Hours","Thermostat Prevents Overcooking and Boil Over","One Touch Selector Button"],"emi_price":0,"full_description":"<h2>Panasonic SR-W18G Rice Cooker</h2><p>The Panasonic <strong>SR-W18G</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a flexible and dependable kitchen companion that simplifies rice cooking while providing a variety of useful functions. This rice cooker's large 1.8-liter capacity, which is comparable to around 10 cups of cooked rice, makes it great for families, dinner parties, and meal prep sessions. The built-in keep-warm function is a noteworthy feature, guaranteeing that your rice stays at the ideal serving temperature for up to 5 hours, giving flexibility and convenience for meal planning. The SR-W18G features a thermostat to avoid overcooking and boil over, ensuring consistently great results with each batch of rice. This precise control guarantees that your rice is cooked perfectly, whether you want it fluffy or slightly sticky. The SR-W18G is intended for simplicity of use and convenience, with a handy side plug that improves accessibility and simplifies storage alternatives. This rice cooker, which operates at 220 volts and 50Hz, provides dependable performance in a range of kitchen settings, assuring consistent results every time you cook. With a cooking capacity of 900 grams and a power rating of 600 watts, it operates efficiently while using little energy. The SR-W18G, made with a stainless steel top and an aluminum inner pot, stresses durability, assuring long-lasting performance even with regular usage. The stainless steel top gives the cooker a clean and modern appearance, while the aluminum inner pot promotes effective heat conduction for even cooking outcomes. Also, both the cover and inside pot are easy to clean, further enhancing the cooker's user-friendly design and maintenance. The Panasonic SR-W18G Rice Cooker combines adaptability, dependability, and convenience to make rice cooking easier and improve your culinary experience. Whether you're making a fast weekday supper or hosting a spectacular event, this versatile gadget will undoubtedly become a vital weapon in your culinary arsenal. </p><h2>Buy Panasonic SR-W18G Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-W18G Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-W18G Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-W18G Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-W18G Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-W18G Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-w18g/sr-w18g-01-500x500.webp"],"product_seo_title":"Panasonic SR-W18G Rice Cooker Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-W18G Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-W18G Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-W18G Rice Cooker"},{"url":"https://www.startech.com.bd/panasonic-sr-w22gs-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-w22gs/sr-w22gs-01-228x228.webp","title":"Panasonic SR-W22GS Rice Cooker","product_list_short_description":["Automatic Rice Cooker / Steamer","2.2 Liter Capacity","730 Watt Power","Keep Warm Up to 5 hrs"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34333","brand":"Panasonic","product_page_short_description":["Model: SR-W22GS","Automatic Rice Cooker / Steamer","2.2 Liter Capacity","730 Watt Power","Keep Warm Up to 5 hrs"],"emi_price":0,"full_description":"<h2>Panasonic SR-W22GS Rice Cooker</h2><p>The Panasonic <strong>SR-W22GS</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a gadget that can help you prepare meals more efficiently. This automated rice cooker and steamer easily meets your culinary demands, with a large 2.2-liter capacity and a power output of 730 watts. Whether you're preparing a family meal or entertaining guests, this appliance provides effective performance with each usage. The Panasonic SR-W22GS, designed with painstaking attention to detail, has a sleek stainless steel lid that not only adds elegance to your kitchen, but also provides durability and lifespan. Inside, an aluminum inner pot with a nonstick surface makes cleaning and maintenance easier, while also improving the cooking process by preventing rice from sticking. This rice cooker, made in Japan with renowned workmanship and assembled in India, exemplifies the marriage of precision engineering and worldwide quality standards. Its one-touch rice cooking feature makes the procedure easier, allowing you to get precisely cooked rice with little effort. In addition, the glass steaming basket allows you to steam vegetables at the same time, increasing efficiency and nutritional content in your meals. The Panasonic SR-W22GS features a simple keep warm mode that keeps your rice warm for up to 5 hours, ensuring that your meals stay fresh and ready to serve even during lengthy meal times or parties. Whether you want fluffy white rice or delicious steamed veggies, this multifunctional device produces consistent results every time, offering culinary perfection with unrivaled simplicity and convenience. Experience the pinnacle of modern cooking technology with the Panasonic SR-W22GS Rice Cooker, where innovation meets dependability to provide amazing culinary results.</p><h2>Buy Panasonic SR-W22GS Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-W22GS Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-W22GS Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-W22GS Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-W22GS Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-W22GS Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-w22gs/sr-w22gs-01-500x500.webp"],"product_seo_title":"Panasonic SR-W22GS Rice Cooker Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-W22GS Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-W22GS Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-W22GS Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-wm36-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-wm36/sr-wm36-01-228x228.webp","title":"Panasonic SR-WM36 Rice Cooker","product_list_short_description":["3.6 Liter Capacity","1200 Watt Power","Keep Warm Up to 5 hrs","Built-in Thermal Safety Fuse"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34334","brand":"Panasonic","product_page_short_description":["Model: SR-WM36","3.6 Liter Capacity","1200 Watt Power","Keep Warm Up to 5 hrs","Built-in Thermal Safety Fuse"],"emi_price":0,"full_description":"<h2>Panasonic SR-WM36 Rice Cooker</h2><p>The Panasonic <strong>SR-WM36</strong> Rice <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a culinary marvel that combines large capacity with high performance to make meal preparation easier. With a generous 3.6-liter capacity and a powerful 1200 watts of power, this rice cooker is designed to easily meet the demands of big families, dinner parties, or any event requiring delicious, precisely cooked rice. The Panasonic SR-WM36 is designed with both style and durability in mind, with a sleek stainless steel lid that not only adds elegance to your kitchen, but also assures lifespan and dependability. Inside, the anodized aluminum inner pan provides excellent heat distribution, minimizing hot spots and guaranteeing that every grain of rice is cooked evenly. The inner pan's non-stick surface simplifies cleaning and post-cooking. Safety is vital, and the Panasonic SR-WM36 includes a built-in thermal safety fuse for added piece of mind when operating. Furthermore, its power usage is tailored for efficiency, with 1200 watts used for cooking and only 53 watts dedicated to keeping your rice warm for up to 5 hours. This guarantees that your meals remain fresh and at the ideal serving temperature until you are ready to eat them. Versatility is essential, and the cooking capacity of 5 to 20 cups allows for a wide range of serving sizes, easily fitting everything from a modest family supper to a crowded group. Whether you're cooking a basic quantity of white rice or experimenting with more complicated meals, the Panasonic SR-WM36 rice cooker produces reliable results every time. The Panasonic SR-WM36 Rice Cooker offers the finest in convenience, performance, and design. Whether you're a seasoned chef or a beginner cook, this equipment will transform the way you cook rice, making every meal a gastronomic joy.</p><h2>Buy Panasonic SR-WM36 Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-WM36 Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-WM36 Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-WM36 Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-WM36 Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-WM36 Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-wm36/sr-wm36-01-500x500.webp"],"product_seo_title":"Panasonic SR-WM36 Rice Cooker in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-WM36 Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-WM36 Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-WM36 Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-y18j-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-y18j/sr-y18j-01-228x228.webp","title":"Panasonic SR-Y18J Rice Cooker","product_list_short_description":["Switches off automatically once cooked","Saves power","Lime safe anodized aluminum plane.","Designed for safety with Microswitch & Thermal fuse."],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34335","brand":"Panasonic","product_page_short_description":["Model: SR-Y18J","Switches off automatically once cooked","Saves power","Lime safe anodized aluminum plane.","Designed for safety with Microswitch & Thermal fuse."],"emi_price":0,"full_description":"<h2>Panasonic SR-Y18J Rice Cooker</h2><p>The Panasonic <strong>SR-Y18J</strong> rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">cooker </a>is a multipurpose device that may improve your cooking experience. Learn about its efficiency and simplicity. This little cooker is ideal for single people or small homes since it has a 1.8-liter rice capacity, which lets you cook the exact quantity of rice you need without wasting any. The automated cooking feature assures consistent results with the least amount of work, whether you're preparing fluffy white rice, brown rice, or any other variation. This 230V rice cooker uses 600W of electricity to operate with consistent performance and low energy consumption, making it an economical and eco-friendly choice. The SR-Y18J is perfect for kitchens with little counter space since it is lightweight and portable, weighing only 2.0 kg despite its potent capabilities. This rice cooker is ideal for both novice and experienced cooks because to its easy-to-use settings and straightforward operation. With the transparent glass cover on, you can see how the food is cooking without having to open the lid, and the non-stick inner pot makes cleanup and serving simple. A useful addition to any kitchen, the Panasonic SR-Y18J Rice Cooker ensures delicious, properly cooked rice every time, whether you're cooking for company or just yourself. </p><h2>Buy Panasonic SR-Y18J Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-Y18J Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-Y18J Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-Y18J Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-Y18J Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-Y18J Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-y18j/sr-y18j-01-500x500.webp"],"product_seo_title":"Panasonic SR-Y18J Rice Cooker in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-Y18J Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-Y18J Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-Y18J Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-y22-j-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-y22-j/sr-y22-j-01-228x228.webp","title":"Panasonic SR-Y22-J Rice Cooker","product_list_short_description":["Switches off automatically once cooked","Saves power","Lime safe anodized aluminum plane.","Designed for safety with Microswitch & Thermal fuse."],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34337","brand":"Panasonic","product_page_short_description":["Model: SR-Y22-J","Switches off automatically once cooked","Saves power","Lime safe anodized aluminum plane.","Designed for safety with Microswitch & Thermal fuse."],"emi_price":0,"full_description":"<h2>Panasonic SR-Y22-J Rice Cooker</h2><p>The Panasonic <strong>SR-Y22-J</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a high-tech device designed to provide outstanding performance, safety, and ease of use. It will elevate your culinary adventures. This cooker is perfect for feeding large families and groups since it has a large 2.2 liter (about 12 cup) capacity for rice. Its design simplifies meal preparation. Its design places a high priority on efficiency and safety. With its automatic shut-off feature, the cooker will turn off on its own as soon as your rice is cooked to perfection, saving you energy and giving you peace of mind. The inner pot is made of anodized aluminum that is safe for limes, which guarantees longevity and makes cleaning simple. This means that maintenance will be hassle-free. The SR-Y22-J Rice Cooker incorporates several safety measures. It has a microswitch and a thermal fuse to provide additional safety during operation. Furthermore, the addition of a G plug type safety fuse improves safety requirements, assuring worry-free operation for you and your family. This rice cooker operates at 230V and has a power output of 730W, providing dependable performance while consuming the least amount of energy. Whether you're cooking a basic batch of white rice or experimenting with more complicated recipes, the Panasonic SR-Y22-J delivers consistent results every time. The Panasonic SR-Y22-J Rice Cooker is the pinnacle of current cooking technology, bringing safety, efficiency, and performance together to simplify your cooking experience and improve your culinary creations. </p><h2>Buy Panasonic SR-Y22-J Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-Y22-J Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-Y22-J Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-Y22-J Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-Y22-J Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-Y22-J Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-y22-j/sr-y22-j-01-500x500.webp"],"product_seo_title":"Panasonic SR-Y22-J Rice Cooker in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-Y22-J Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-Y22-J Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-Y22-J Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-g28-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-g28/sr-g28-01-228x228.webp","title":"Panasonic SR-G28 Rice Cooker","product_list_short_description":["Switches off automatically once cooked","Saves power","Lime safe anodized aluminum plane.","Designed for safety with Microswitch & Thermal fuse."],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34338","brand":"Panasonic","product_page_short_description":["Model: SR-G28","Switches off automatically once cooked","Saves power","Lime safe anodized aluminum plane.","Designed for safety with Microswitch & Thermal fuse."],"emi_price":0,"full_description":"<h2>Panasonic SR-G28 Rice Cooker</h2><p>The Panasonic <strong>SR-G28</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a multipurpose device that simplifies meal preparation while providing high-quality performance. With a spacious 2.8-liter capacity and a cooking capacity of 1.4 kilos, this cooker easily meets the demands of families and groups of any size. Its 790 watts of power provide effective and even heating, due to its single heating coil inner pot, resulting in perfectly cooked rice every time. The Panasonic SR-G28 Rice Cooker's automated cooking feature eliminates the guesswork from meal preparation, allowing you to obtain consistent results with less effort. Its 5-hour keep warm feature guarantees that your rice stays at the proper temperature until you're ready to serve. This rice cooker has novel features for improved usage and safety, including a smart cook with a PCB switch panel, which allows for straightforward operation and exact control over the cooking process. The contemporary G series switch panel and body offer refinement to your kitchen, while the new streamlined handle with stainless steel lid improves both appearance and practicality. Safety is of the highest importance, and the Panasonic SR-G28 Rice Cooker is fitted with two thermal fuses, offering an extra layer of protection and assuring maximum safety throughout operation. Whether you're a newbie cook or a seasoned chef, this rice cooker offers unrivaled convenience, performance, and safety, making it an essential equipment in modern kitchens.</p><h2>Buy Panasonic SR-G28 Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-G28 Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-G28 Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-G28 Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-G28 Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-G28 Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-g28/sr-g28-01-500x500.webp"],"product_seo_title":"Panasonic SR-G28 Rice Cooker in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-G28 Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-G28 Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-G28 Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-ga421-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-ga421/sr-ga421-01-228x228.webp","title":"Panasonic SR-GA421 Rice Cooker","product_list_short_description":["5 to 23 Cup/4.2L Capacity","Automatic Cooking of Rice","Ideal for Restaurants and Large Families","Keep Warm Function up to 5 Hours"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34339","brand":"Panasonic","product_page_short_description":["Model: SR-GA421","5 to 23 Cup/4.2L Capacity","Automatic Cooking of Rice","Ideal for Restaurants and Large Families","Keep Warm Function up to 5 Hours"],"emi_price":0,"full_description":"<h2>Panasonic SR-GA421 Rice Cooker</h2><p>The Panasonic <strong>SR-GA421</strong> Rice <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is the ideal choice for restaurants and large households looking to prepare meals quickly without sacrificing quality. This cooker has a large capacity ranging from 5 to 23 cups (4.2 liters), so you'll have plenty of rice to satisfy even the most voracious appetites. Its automated cooking mechanism makes the procedure easier, resulting in dependably excellent rice with each usage. Plus, with a keep warm function that lasts up to 5 hours, your rice will be ready to eat whenever you are. The SR-GA421 is designed for durability and performance, with an anodized aluminum frying pan that not only offers consistent heat distribution but is also easy to clean. The large and flat surface of the cast heater efficiently transmits heat, reducing cooking time and energy usage. The built-in thermostat provides precise control, letting you to adjust your food to perfection. Safety is vital, and the SR-GA421 has a thermal fuse to prevent the device from burnout, assuring long-term reliability. The included accessories, such as the rice scoop and measuring cup, improve the culinary experience by offering everything needed for a smooth meal preparation procedure. Whether you're operating a busy restaurant kitchen or feeding a large family at home, the Panasonic SR-GA421 Rice Cooker provides unparalleled convenience, efficiency, and dependability, making it an essential tool for any culinary lover.</p><h2>Buy Panasonic SR-GA421 Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-GA421 Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-GA421 Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-GA421 Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-GA421 Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-GA421 Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-ga421/sr-ga421-01-500x500.webp"],"product_seo_title":"Panasonic SR-GA421 Rice Cooker in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-GA421 Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-GA421 Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-GA421 Rice Cooker\n"},{"url":"https://www.startech.com.bd/panasonic-sr-ga721-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-ga721/sr-ga721-01-228x228.webp","title":"Panasonic SR-GA721 Rice Cooker","product_list_short_description":["7.2 Liter Capacity Big Size","2500 Watt Power","Keep Warm Up to 5 hrs","Built-in Thermal Safety Fuse"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34340","brand":"Panasonic","product_page_short_description":["Model: SR-GA721","7.2 Liter Capacity Big Size","2500 Watt Power","Keep Warm Up to 5 hrs","Built-in Thermal Safety Fuse"],"emi_price":0,"full_description":"<h2>Panasonic SR-GA721 Rice Cooker</h2><p>The Panasonic <strong>SR-GA721</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>is a powerful device intended to easily handle large-scale cooking requirements. With a capacity of 7.2 liters, this rice cooker is ideal for catering events, industrial kitchens, and large families. With its strong 2500-watt output, it cooks quickly and efficiently, allowing you to create big servings of rice in no time. The SR-GA721 has a keep warm mode that keeps your rice at the correct temperature for up to 5 hours, ensuring that your dishes stay fresh and ready to serve, making it great for longer meal times or celebrations. The stainless steel top not only increases longevity but also provides a sleek and attractive touch to the appliance's design, while the aluminum inner pan ensures equal heat distribution for dependably excellent rice. Safety is a key issue, and the SR-GA721 includes a built-in thermal safety fuse to provide piece of mind throughout operation. This safety mechanism prevents the cooker from overheating, resulting in consistent performance and lifetime. Whether you're preparing meals for a big group or cooking for your family, the Panasonic SR-GA721 Rice Cooker provides unparalleled convenience, efficiency, and safety, making it an indispensable asset to any kitchen. </p><h2>Buy Panasonic SR-GA721 Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-GA721 Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-GA721 Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-GA721 Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-GA721 Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-GA721 Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-ga721/sr-ga721-01-500x500.webp"],"product_seo_title":"Panasonic SR-GA721 Rice Cooker in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-GA721 Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-GA721 Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-GA721 Rice Cooker"},{"url":"https://www.startech.com.bd/panasonic-sr-e28-rice-cooker","img":"https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-e28/sr-e28-02-228x228.webp","title":"Panasonic SR-E28 Rice Cooker","product_list_short_description":["2.8 Liter Capacity Bowl (15 Cup Rice Cooker)","Side grips for easy pick up","Detachable cord","One touch button for rice cooking"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Cooker Price in Bangladesh | Star Tech","cat_seo_description":"Buy Cooker at best price in Bangladesh. Latest Rice Cooker, Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker available at Star Tech Shop. Order online to get delivery in BD.","cat_seo_keywords":"Rice Cooker,  Pressure Cooker, Induction Cooker, Infrared Cooker, & Multi Cooker","status":"Up Coming","code":"34341","brand":"Panasonic","product_page_short_description":["Model: SR-E28","2.8 Liter Capacity Bowl (15 Cup Rice Cooker)","Side grips for easy pick up","Detachable cord","One touch button for rice cooking"],"emi_price":0,"full_description":"<h2>Panasonic SR-E28 Rice Cooker</h2><p>The Panasonic <strong>SR-E28</strong> Rice <a href=\"https://www.startech.com.bd/cooker\" target=\"\" style=\"color: rgb(0, 0, 0);\">Cooker </a>offers the ideal balance of convenience and practicality. This cooker, with its sleek stainless steel top, not only gives a touch of modern beauty to your kitchen, but it is also durable and long-lasting. With a spacious 2.8-liter capacity bowl, which can cook 15 cups of rice, it easily accommodates large families or groups. The cooker is equipped with side handles for easier handling and transit, and the detachable cable adds to its user-friendliness by allowing for convenient storage. The rice cooker's one-touch button streamlines the procedure, ensuring easy operation for users of various skill levels. Furthermore, the installation of a thermal fuse protects the device against burnout, increasing safety and dependability. With a keep warm option that keeps your rice warm for up to 5 hours, the Panasonic SR-E28 Rice Cooker ensures that your meals are fresh and ready to serve wherever you are, making it an invaluable kitchen partner for busy families.</p><h3>Simple and Durable Design</h3><p>Panasonic SR-E28 has a stainless steel lid with a scald prevention handle and a thermal fuse that instantly shuts off for further safety in the event of overheating or overcurrent.</p><h3>Conveniently Cook</h3><p>You may cook up to 15 cups of rice grains at one time. Panasonic <strong>SR-E28</strong> can keep a significant amount of rice hot even during busy lunch hours.</p><h3>Large Volumes of Delicious</h3><p>The overlapping heater on the bottom and precise temperature control with a thermostat provide even heating and excellent cooking results, especially when cooking big quantities in SR-E28 Cooker.</p><h2>Buy Panasonic SR-E28 Rice Cooker from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic SR-E28 Rice Cooker</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/rice-cooker\" target=\"\">Rice Cooker</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Panasonic SR-E28 Rice Cooker comes with 2 Years (1 Year Electrical Spare Parts &amp; 2 Years Service) warranty.</p>","specifications":[],"latest_price":{"heading":"What is the price of Panasonic SR-E28 Rice Cooker in Bangladesh?","paragraph":"The latest price of Panasonic SR-E28 Rice Cooker in Bangladesh is 0৳. You can buy the Panasonic SR-E28 Rice Cooker at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/appliance/cooker/sr-e28/sr-e28-02-500x500.webp"],"product_seo_title":"Panasonic SR-E28 Rice Cooker in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic SR-E28 Rice Cooker at the best price in Bangladesh. Latest Panasonic SR-E28 Rice Cooker available at Star Tech. Order online and get delivery in BD.","product_seo_keywords":"Panasonic SR-E28 Rice Cooker"}]