[{"url":"https://www.startech.com.bd/midea-1-5-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msa-12crn/msa-12crn-01-228x228.webp","title":"Midea 1.5 Ton Non-Inverter AC (Split Type MSA-18CRN)","product_list_short_description":["Air Conditioner Type: Non Inverter","Cooling Capacity: 18000 BTU/hr","Compressor: Rotary","Coverage: 150-180 sqft"],"price_new":50000,"price_old":53000,"price_single":50000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Midea AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Midea AC at the best price in Bangladesh. Latest Midea Air Conditioner (AC) available at Star Tech online shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Midea AC, Midea Air Conditioner","status":"In Stock","code":"9917","brand":"Midea","product_page_short_description":["Model: MSA-18CRN","Air Conditioner Type: Non Inverter","Cooling Capacity: 18000 BTU/hr","Compressor: Rotary","Coverage: 150-180 sqft"],"emi_price":4542,"full_description":"<h2>Midea 1.5 Ton Non-Inverter AC (Split Type MSA-18CRN)</h2><p>The Midea 1.5 Ton Non-Inverter AC (Split Type MSA-18CRN) that delivers efficient and consistent cooling for spaces up to 150-180 square feet. With its incredible cooling capacity, this AC unit delivers fast cooling, resulting in a comfortable environment even on the hottest days. The air flow rates vary between its three fan speeds, with 609.3 cubic meters per hour on high, 480 cubic meters per hour on medium, and 364.9 cubic meters per hour on low, allowing you to customize the airflow to your specific needs. The Midea 1.5 Ton Non-Inverter AC (Split Type MSA-18CRN) has a rotary compressor and uses R-410A refrigerant to deliver efficient and ecologically friendly cooling. The rotary compressor operates smoothly and softly, decreasing noise levels both inside and out. The interior noise levels are 42.7 dB(A) on high, 37.4 dB(A) on medium, and 32.5 dB(A) on low, while the outside unit runs at 54 dB(A), providing a calm inside atmosphere. The Midea AC includes a remote control thermostat, allowing you to quickly adjust the temperature and settings from a distance. This remote control feature increases convenience and ease of use by allowing you to customize the cooling experience without physically modifying the unit's settings. The Midea 1.5 Ton Non-Inverter AC (Split Type MSA-18CRN) is intended to operate in temperatures ranging from 17 to 30 degrees Celsius, making it suitable for a wide range of climates and offering constant cooling performance even in colder conditions. Its adjustable working temperature ensures consistent performance throughout the year, making it a reliable solution. The Air Conditioner has a high cooling capacity, energy efficiency, and user-friendly features. This one-ton air conditioner, with its rotary compressor, eco-friendly refrigerant, remote control thermostat, and silent operation, is a versatile and dependable cooling solution for homes and small workplaces, delivering a pleasant atmosphere with changeable settings to match your unique needs. </p><h2>Buy Midea 1.5 Ton Non-Inverter AC (Split Type MSA-18CRN) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Midea 1.5 Ton Non-Inverter AC (Split Type MSA-18CRN)</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/midea-ac\" target=\"\">Media AC</a> to purchase for your home and office. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Midea 1.5 Ton Non-Inverter AC (Split Type MSA-18CRN) comes with 05 Years Compressor &amp; 01 Year Spare Parts Warranty(The Midea warranty card must be kept for any warranty claim).</p><p><span style=\"background-color: yellow; font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non Inverter"},{"key":"Capacity","value":"1.5 Ton"},{"key":"Coverage","value":"150 - 180 sqft"},{"key":"Capacity of Cooling (BTU)","value":"18000"},{"key":"Noise Level","value":"Indoor: 46.9/39.4/34.3 dB"},{"key":"Compressor Type","value":"Rotary"},{"key":"Condenser Type","value":"Double Layer"},{"key":"Refrigerant Type","value":"R-410A"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"187-264V- 50Hz, 1Ph"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor: 965x215x319mm"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"05 Years Compressor & 01 Year Spare Parts Warranty"}]}],"latest_price":{"heading":"What is the price of Midea 1.5 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of Midea 1.5 Ton Non-Inverter AC in Bangladesh is 50,000৳. You can buy the Midea 1.5 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msa-12crn/msa-12crn-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msa-12crn/msa-12crn-02-500x500.webp"],"product_seo_title":"Midea 1.5 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Midea 1.5 Ton Non-Inverter AC at best price in Bangladesh. Latest Midea 1.5 Ton Non-Inverter Air Conditioner (MSA-18CRN) at Star Tech. Order online to get delivery in BD.\n","product_seo_keywords":"Midea 1.5 Ton Non-Inverter AC (Split Type MSA-18CRN)"},{"url":"https://www.startech.com.bd/midea-2-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msa-12crn/msa-12crn-01-228x228.webp","title":"Midea 2 Ton Non-Inverter AC (Split Type MSA-24CRN)","product_list_short_description":["Air Conditioner Type: Non Inverter","Cooling Capacity: 24000 BTU/hr","Compressor: Rotary","Coverage: 240-260 sqft"],"price_new":64000,"price_old":67000,"price_single":64000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Midea AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Midea AC at the best price in Bangladesh. Latest Midea Air Conditioner (AC) available at Star Tech online shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Midea AC, Midea Air Conditioner","status":"In Stock","code":"9918","brand":"Midea","product_page_short_description":["Model: MSA-24CRN","Air Conditioner Type: Non Inverter","Cooling Capacity: 24000 BTU/hr","Compressor: Rotary","Coverage: 240-260 sqft"],"emi_price":5917,"full_description":"<h2>Midea 2 Ton Non-Inverter AC (Split Type MSA-24CRN)</h2><p>The Midea 2 Ton Non-Inverter AC (Split Type MSA-24CRN) provides effective and consistent cooling for areas up to 240-260 square feet. With its impressive cooling capability, this AC unit provides quick cooling, resulting in a pleasant atmosphere even on the warmest days. The airflow rates vary between the three fan speeds, with 609.3 cubic meters per hour on high, 480 cubic meters per hour on medium, and 364.9 cubic meters per hour on low, allowing you to tailor the airflow to your requirements. The Midea 2-Ton Non-Inverter AC (Split Type MSA-24CRN) has a rotary compressor and uses R-410A refrigerant to deliver efficient and ecologically friendly cooling. The rotary compressor runs smoothly and gently, reducing noise levels both inside and outside. The interior noise levels are 42.7 dB(A) on high, 37.4 dB(A) on medium, and 32.5 dB(A) on low, while the outside unit operates at 54 dB(A), resulting in a quiet inside environment. The Midea 2 Ton Non-Inverter AC (Split Type MSA-24CRN) has a remote control thermostat, which allows you to swiftly modify the temperature and settings from a distance. This remote control function improves convenience and usability by allowing you to personalize the cooling experience without physically changing the unit's settings. The Midea air conditioner is designed to run in temperatures ranging from 17 to 30 degrees Celsius, making it appropriate for a broad range of climates and providing consistent cooling performance regardless in colder conditions. Its adjustable working temperature ensures consistent performance throughout the year, making it a reliable solution. The Midea 2 Ton Non-Inverter AC (Split Type MSA-24CRN) has a high cooling capacity, energy efficiency, and user-friendly features. This one-ton air conditioner, with its rotary compressor, eco-friendly refrigerant, remote control thermostat, and silent operation, is a versatile and dependable cooling solution for homes and small workplaces, delivering a pleasant atmosphere with changeable settings to match your unique needs. </p><h2>Buy Midea 2 Ton Non-Inverter AC (Split Type MSA-24CRN) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Midea 2 Ton Non-Inverter AC (Split Type MSA-24CRN)</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/midea-ac\" target=\"\">Media AC</a> to purchase for your home and office. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Midea 2 Ton Non-Inverter AC (Split Type MSA-24CRN) comes with 05 Years Compressor &amp; 01 Year Spare Parts Warranty (The Midea warranty card must be kept for any warranty claim).</p><p><span style=\"background-color: yellow; font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non Inverter"},{"key":"Capacity","value":"2 Ton"},{"key":"Coverage","value":"240–260 Sqft"},{"key":"Capacity of Cooling (BTU)","value":"24000BTU"},{"key":"Noise Level","value":"Indoor: 47/44/41dB"},{"key":"Compressor Type","value":"ROTARY"},{"key":"Condenser Type","value":"Double Layer"},{"key":"Refrigerant Type","value":"R410A"}]},{"heading":"Power","values":[{"key":"Power Voltage","value":"187-264V,50Hz,1Ph"},{"key":"Power Consumption","value":"2670W"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Indoor: 1080x226x335mm"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"05 Years Compressor & 01 Year Spare Parts Warranty (The Midea warranty card must be kept for any warranty claim)."}]}],"latest_price":{"heading":"What is the price of Midea 2 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of Midea 2 Ton Non-Inverter AC in Bangladesh is 64,000৳. You can buy the Midea 2 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msa-12crn/msa-12crn-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msa-12crn/msa-12crn-02-500x500.webp"],"product_seo_title":"Midea 2 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Midea 2 Ton Non-Inverter AC at best price in Bangladesh. Latest Midea 2 Ton Non-Inverter Air Conditioner (MSA-24CRN) at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Midea 2 Ton Non-Inverter AC (Split Type MSA-24CRN)"},{"url":"https://www.startech.com.bd/midea-1-ton-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msi-12crn/msi-12crn-03-228x228.webp","title":"Midea 1 Ton Inverter AC (Split Type MSI-12CRN)","product_list_short_description":["Air Conditioner Type: Inverter","Cooling Capacity: 12000 BTU/hr","Compressor: Rotary","Coverage: 120 sqft"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Midea AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Midea AC at the best price in Bangladesh. Latest Midea Air Conditioner (AC) available at Star Tech online shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Midea AC, Midea Air Conditioner","status":"Up Coming","code":"35282","brand":"Midea","product_page_short_description":["Model: MSI-12CRN","Air Conditioner Type: Inverter","Cooling Capacity: 12000 BTU/hr","Compressor: Rotary","Coverage: 120 sqft"],"emi_price":0,"full_description":"<h2>Midea 1 Ton Inverter AC (Split Type MSI-12CRN)</h2><p>The Midea 1 Ton Inverter AC (Split Type MSI-12CRN) is a powerful cooling option made to improve your space's efficiency and comfort. With several advanced features, this air conditioning machine prioritizes energy efficiency and user comfort above maintaining a cool and pleasant atmosphere. With the Midea 1 Ton Inverter AC (Split Type MSI-12CRN) Auto Restart, Sleep Mode, Timer on/off, and Turbo Function features, you can adjust the cooling to fit your needs and schedule. With its Anti-bacterial Washable filter, you can wave goodbye to airborne pollutants and promote better indoor air quality. With the Super Quiet operation, you may experience peace of mind together with the cooling capability of Super Power and the effective air dispersion of Super Wave technology. By protecting against dust and corrosion, the heat exchanger and high-efficiency condenser provide extra durability, guaranteeing lifespan and dependability. The Auto Swing Louver allows you to enjoy the best possible air circulation by adjusting the auto shut and up/down swing flaps to provide even cooling throughout the room. With the wireless remote controller that comes with the device, you can easily operate it and have the power of comfort at your fingertips. With the integrated Dehumidification System, you can fight humidity and keep your environment dry and cool, even on the warmest days. This air conditioner uses 1.17 KW of electricity and has a power supply of 220-240V/1 Ph/50Hz, cooling capacity of 12,000 BTU/hour, and minimal power usage to save energy costs. With a greater Energy Efficiency Ratio (EER) of 3.01, the MSI-12CRN <a href=\"https://www.startech.com.bd/air-conditioner\" target=\"\" style=\"color: rgb(0, 0, 0);\">AC</a> ensures adequate cooling without using excessive amounts of electricity. With an airflow rate of IDU-610 m3/hour and ODU-1660 m3/hour, you can always count on steady airflow to provide cool comfort when you need it.</p><h2><span style=\"color: inherit; font-family: inherit;\">Buy </span>Midea 1 Ton Inverter AC (Split Type MSI-12CRN)<span style=\"color: inherit; font-family: inherit;\"> from Star Tech</span><br></h2><p>In Bangladesh, you can get original <span style=\"font-weight: 700;\">Midea 1 Ton Inverter AC (Split Type MSI-12CRN)</span> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/midea-ac\" target=\"\">Media AC</a> to purchase for your home and office. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at the lowest price. The Midea 1 Ton Inverter AC (Split Type MSI-12CRN) comes with 10 Years Compressor &amp; 01 Year Spare Parts Warranty (The Midea warranty card must be kept for any warranty claim.)</p><p><span style=\"background-color: yellow; font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Inverter"},{"key":"Capacity","value":"1 Ton"},{"key":"Coverage","value":"120 Sqft"},{"key":"Capacity of Cooling (BTU)","value":"12000 BTU/hr"},{"key":"Noise Level","value":"IDU-32.5 dB(A) / ODU-54 dB(A)"},{"key":"Compressor Type","value":"ROTARY"},{"key":"Condenser Type","value":"100% Copper"},{"key":"Refrigerant Type","value":"R-410A (CFC Free)"},{"key":"Others","value":"Auto Restart, Sleep Mode, Timer on/off, Turbo Function."}]},{"heading":"Power","values":[{"key":"Power Consumption","value":"1.17 KW"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"IDU-855×297.5×200 mm"},{"key":"Weight","value":"IDU-10.7 Kg"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"10 Years Compressor & 01 Year Spare Parts Warranty"}]}],"latest_price":{"heading":"What is the price of Midea 1 Ton Inverter AC in Bangladesh?","paragraph":"The latest price of Midea 1 Ton Inverter AC in Bangladesh is 47,500৳. You can buy the Midea 1 Ton Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msi-12crn/msi-12crn-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msi-12crn/msi-12crn-02-500x500.webp"],"product_seo_title":"Midea 1 Ton Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Midea 1 Ton Inverter AC at the best price in Bangladesh. Latest Midea 1 Ton Inverter Air Conditioner (MSI-12CRN) at Star Tech Shop. Order online for delivery in BD.\n","product_seo_keywords":"Midea 1 Ton Inverter AC (Split Type MSI-12CRN)"},{"url":"https://www.startech.com.bd/midea-1-ton-non-inverter-ac","img":"https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msa-12crn/msa-12crn-01-228x228.webp","title":"Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN)","product_list_short_description":["Air Conditioner Type: Non Inverter","Cooling Capacity: 12000 BTU/hr","Compressor: Rotary","Coverage: 120 sqft"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Midea AC Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Midea AC at the best price in Bangladesh. Latest Midea Air Conditioner (AC) available at Star Tech online shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"Midea AC, Midea Air Conditioner","status":"Up Coming","code":"9916","brand":"Midea","product_page_short_description":["Model: MSA-12CRN","Air Conditioner Type: Non Inverter","Cooling Capacity: 12000 BTU/hr","Compressor: Rotary","Coverage: 120 sqft"],"emi_price":0,"full_description":"<h2>Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN)</h2><p>The Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN) that provides effective and dependable cooling performance for rooms up to 120 square feet. With its tremendous cooling capability, this AC unit provides quick cooling, resulting in a pleasant atmosphere even on the warmest days. The air flow rates change between its three fan speeds, with 609.3 cubic meters per hour on high, 480 cubic meters per hour on medium, and 364.9 cubic meters per hour on low, enabling you to tailor the airflow to your needs. The Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN) is equipped with a rotary compressor and uses R-410A refrigerant to provide effective and environmentally friendly cooling. The rotary compressor runs smoothly and quietly, reducing noise levels both indoors and outside. The indoor noise levels are 42.7 dB(A) on high, 37.4 dB(A) on medium, and 32.5 dB(A) on low, while the outdoor unit operates at 54 dB(A), ensuring a peaceful indoor environment. The Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN) has a remote control thermostat, which allows you to easily modify the temperature and settings from a distance. This remote control capability improves convenience and simplicity of use by allowing you to tailor the cooling experience without physically adjusting the unit's settings. The Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN) is designed to function in a temperature range of 17-30°C, making it appropriate for a variety of climates and providing consistent cooling performance even in fairly cold situations. Its adjustable operating temperature assures constant performance all year, making it a dependable solution for both summer cooling and year-round comfort. The Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN) combines high cooling capacity, energy economy, and user-friendly features. This 1 ton AC comes with rotary compressor, eco-friendly refrigerant, remote control thermostat, and silent operation make it a versatile and dependable cooling option for homes and small offices, providing a comfortable climate with configurable settings to meet your specific requirements. </p><h2>Buy Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN) from Star Tech</h2><p>In Bangladesh, you can get original <strong>Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN)</strong> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/midea-ac\">Media AC</a> to purchase for your home and office. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\">Star Tech Shop</a> to get yours at the lowest price. The Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN) comes with 05 Years Compressor &amp; 01 Year Spare Parts Warranty (The Midea warranty card must be kept for any warranty claim).</p><p><span style=\"background-color: yellow; font-weight: bold;\">Installation and delivery charges must be paid by the customer. Delivery and installation charges may vary due to location and building height.</span></p>","specifications":[{"heading":"Basic Information","values":[{"key":"AC Type","value":"Split"},{"key":"Technology","value":"Non-Inverter"},{"key":"Capacity","value":"1 Ton"},{"key":"Coverage","value":"120 Sqft"},{"key":"Capacity of Cooling (BTU)","value":"12000 BTU/hr"},{"key":"Noise Level","value":"42.7/37.4/32.5 dB"},{"key":"Compressor Type","value":"ROTARY"},{"key":"Condenser Type","value":"Double Layer"},{"key":"Refrigerant Type","value":"R-410A"}]},{"heading":"Power","values":[{"key":"Power Consumption","value":"1400W"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"Input Unit: 802 x 189 x 297mm"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"05 Years Compressor & 01 Year Spare Parts Warranty (The Midea warranty card must be kept for any warranty claim)."}]}],"latest_price":{"heading":"What is the price of Midea 1 Ton Non-Inverter AC in Bangladesh?","paragraph":"The latest price of Midea 1 Ton Non-Inverter AC in Bangladesh is 41,000৳. You can buy the Midea 1 Ton Non-Inverter AC at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msa-12crn/msa-12crn-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/air-conditioner/midea/msa-12crn/msa-12crn-02-500x500.webp"],"product_seo_title":"Midea 1 Ton Non-Inverter AC Price in Bangladesh | Star Tech","product_seo_description":"Buy Midea 1 Ton Non-Inverter AC at best price in Bangladesh. Latest Midea 1 Ton Non-Inverter Air Conditioner (MSA-12CRN) at Star Tech. Order online to get delivery in BD.\n","product_seo_keywords":"Midea 1 Ton Non-Inverter AC (Split Type MSA-12CRN)"}]