[{"url":"https://www.startech.com.bd/thunderobot-black-warrior-waterproof-backpack","img":"https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/black-warrior/black-warrior-01-228x228.webp","title":"Thunderobot Black Warrior Waterproof Backpack for 15.6\" Laptop","product_list_short_description":["Capacity: 15L","Applicable: 15.6 inches and below laptop","Material: 900D film glue + 210D lining + PE cotton","Size: 44 x 30 x 11CM"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Thunderobot Backpack Price in Bangladesh | Star Tech","cat_seo_description":"Buy Thunderobot Backpack at the best price in Bangladesh. Order latest Thunderobot, Laptop Backpack from Star Tech online shop for delivery in BD.","cat_seo_keywords":"Thunderobot Backpack","status":"Out Of Stock","code":"29205","brand":"Thunderobot","product_page_short_description":["Model: Black Warrior","Capacity: 15L","Applicable: 15.6 inches and below laptop","Material: 900D film glue + 210D lining + PE cotton","Size: 44 x 30 x 11CM"],"emi_price":0,"full_description":"<h2>Thunderobot Black Warrior Waterproof Backpack for 15.6\" Laptop</h2><p style=\"text-align: justify; \">The Thunderobot Black Warrior Waterproof Backpack is a reliable and durable backpack designed specifically for 15.6\" laptops. It features a sleek and modern design with a focus on functionality and protection. Constructed with high-quality materials, the backpack is made of 900D film glue, providing excellent water resistance and durability. The 210D lining and PE cotton padding further enhance the protection of your laptop and other belongings. Carrying the backpack is comfortable and convenient, thanks to the soft handle located on the top. It allows for easy lifting and carrying, even when the backpack is fully loaded. Additionally, the backpack is equipped with double shoulder belts, offering extra support and stability while on the move. The Thunderobot Black Warrior Waterproof Backpack is specifically designed to accommodate laptops with screen sizes of 15.6 inches and below. With a capacity of 15 liters, it provides ample storage space for your laptop, charger, accessories, documents, and other personal belongings. Measuring 44 x 30 x 11 cm in size, the backpack strikes a balance between compactness and spaciousness. It is compact enough to be carried comfortably, yet it offers sufficient room for your essentials. Despite its sturdy construction and generous capacity, the backpack is surprisingly lightweight, weighing only 0.67 kg. The Thunderobot Black Warrior Waterproof Backpack is designed to meet your needs. Its waterproof design, sturdy construction, and thoughtful features make it a reliable companion for safely carrying your laptop and belongings in various environments.</p><h2 style=\"text-align: justify;\"><span style=\"color: inherit; font-family: inherit;\">Buy </span>Thunderobot Black Warrior Waterproof Backpack for 15.6\" Laptop<span style=\"color: inherit; font-family: inherit;\">&nbsp;from Star Tech</span><br></h2><p style=\"text-align: justify; \">In Bangladesh, you can get the original <a href=\"https://www.startech.com.bd/thunderobot-black-warrior-waterproof-backpack\" target=\"\">Thunderobot Black Warrior Waterproof Backpack for 15.6\" Laptop</a> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/thunderobot-backpack\" target=\"\">Thunderobot Backpack</a>&nbsp;to purchase for your <a href=\"https://www.startech.com.bd/laptop-notebook/laptop\" target=\"\">Laptop</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at the lowest price. The Lenovo B515 Laptop Backpack comes with no warranty.<br></p>","specifications":[],"latest_price":{"heading":"What is the price of Thunderobot Black Warrior Waterproof Backpack in Bangladesh?","paragraph":"The latest price of Thunderobot Black Warrior Waterproof Backpack in Bangladesh is 3,800৳. You can buy the Thunderobot Black Warrior Waterproof Backpack at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/black-warrior/black-warrior-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/black-warrior/black-warrior-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/black-warrior/black-warrior-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/black-warrior/black-warrior-04-500x500.webp"],"product_seo_title":"Thunderobot Black Warrior Backpack for 15.6\" Laptop Price in Bangladesh","product_seo_description":"Buy Thunderobot Black Warrior Waterproof Backpack for 15.6\" Laptop at best price in BD. Latest Thunderobot Black Warrior Backpack available at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Thunderobot Black Warrior Waterproof Backpack for 15.6\" Laptop"},{"url":"https://www.startech.com.bd/thunderobot-thor-zero-halo-waterproof-laptop-backpack","img":"https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/thor-zero-halo/thor-zero-halo-06-228x228.webp","title":"Thunderobot Thor ZERO Halo Waterproof Laptop Backpack","product_list_short_description":["Internal Structure: Sandwich Bag","Gross Weight of Goods: 1.8kg","Closed Mode: Zipper","Applicable Gender: Universal"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Thunderobot Backpack Price in Bangladesh | Star Tech","cat_seo_description":"Buy Thunderobot Backpack at the best price in Bangladesh. Order latest Thunderobot, Laptop Backpack from Star Tech online shop for delivery in BD.","cat_seo_keywords":"Thunderobot Backpack","status":"Out Of Stock","code":"29211","brand":"Thunderobot","product_page_short_description":["Model: Thor ZERO Halo","Internal Structure: Sandwich Bag","Gross Weight of Goods: 1.8kg","Closed Mode: Zipper","Applicable Gender: Universal"],"emi_price":0,"full_description":"<h2>Thunderobot Thor ZERO Halo Waterproof Laptop Backpack</h2><p style=\"text-align: justify; \">The Thunderobot Thor ZERO Halo Waterproof Laptop Backpack is a versatile and durable backpack designed to cater to the needs of individuals in various scenarios, primarily in workplace environments. With a gross weight of 1.8kg, this backpack strikes a balance between providing ample storage space and ensuring portability. This backpack is its waterproof strength, making it suitable for use in various weather conditions and protecting its contents from rain or spills. The waterproof capability adds to the backpack's durability and ensures that valuable electronics, such as laptops and tablets, remain safe and dry. The Thunderobot Thor ZERO Halo backpack is designed for universal use, appealing to both genders. Its neutral and practical design makes it suitable for teenagers and adults alike, making it a versatile choice for different age groups. The backpack is equipped with a zipper for the closed mode, ensuring secure and convenient access to the contents inside. This closure mechanism helps keep your belongings organized and prevents accidental spills or loss of items. The Thunderobot Thor ZERO Halo backpack falls into the commute style category. It embodies a sleek and professional design that aligns with business attire, making it suitable for professionals or individuals who prefer a more sophisticated look. This backpack is well-suited for commuting to work, meetings, or other workplace settings. The backpack features a sandwich bag structure, providing multiple compartments and pockets for efficient organization. This internal structure enables users to separate and store different items, such as laptops, documents, pens, and other accessories, ensuring easy access and preventing clutter. The Thunderobot Thor ZERO Halo Waterproof Laptop Backpack offers a combination of functionality, durability, and style. Its waterproof design, universal appeal, and ample storage capacity make it an ideal choice for teenagers and professionals seeking a reliable and fashionable backpack for their workplace needs.</p><h2><span style=\"color: inherit; font-family: inherit; text-align: justify;\">Buy&nbsp;</span><span style=\"text-align: justify;\">Thunderobot Thor ZERO Halo Waterproof Laptop Backpack<span style=\"color: inherit; font-family: inherit;\">&nbsp;from Star Tech</span></span><br></h2><p style=\"text-align: justify; \">In Bangladesh, you can get the original <a href=\"https://www.startech.com.bd/thunderobot-thor-zero-halo-waterproof-laptop-backpack\" target=\"\">Thunderobot Thor ZERO Halo Waterproof Laptop Backpack</a> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/thunderobot-backpack\" target=\"\">Thunderobot Backpack</a>&nbsp;to purchase for your <a href=\"https://www.startech.com.bd/laptop-notebook/laptop\" target=\"\">Laptop</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at the lowest price. The Thunderobot Thor ZERO Halo Waterproof Laptop Backpack comes with no warranty.<br></p>","specifications":[],"latest_price":{"heading":"What is the price of Thunderobot Thor ZERO Halo Waterproof Laptop Backpack in Bangladesh?","paragraph":"The latest price of Thunderobot Thor ZERO Halo Waterproof Laptop Backpack in Bangladesh is 8,200৳. You can buy the Thunderobot Thor ZERO Halo Waterproof Laptop Backpack at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/thor-zero-halo/thor-zero-halo-06-500x500.webp","https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/thor-zero-halo/thor-zero-halo-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/thor-zero-halo/thor-zero-halo-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/thor-zero-halo/thor-zero-halo-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/laptop-accessories/backpack/thunderobot/thor-zero-halo/thor-zero-halo-05-500x500.webp"],"product_seo_title":"Thunderobot Thor ZERO Halo Waterproof Laptop Backpack Price in Bangladesh","product_seo_description":"Buy Thunderobot Thor ZERO Halo Waterproof Laptop Backpack at best price in BD. Latest Thunderobot Thor ZERO Halo Laptop Backpack available at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Thunderobot Thor ZERO Halo Waterproof Laptop Backpack"}]