[{"url":"https://www.startech.com.bd/defy-gravity-turbo-tws-gaming-earbuds","img":"https://www.startech.com.bd/image/cache/catalog/earbuds/defy/gravity-turbo/gravity-turbo-01-228x228.webp","title":"DEFY Gravity Turbo Low Latency True Wireless Gaming Earbuds","product_list_short_description":["Bluetooth: Version 5.3","30 Hours Playback","Turbo mode with 50ms low latency","Case Charge Capacity: 450mAh"],"price_new":1330,"price_old":2550,"price_single":1330,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DEFY Earbuds Price in Bangladesh | Star Tech","cat_seo_description":"Buy DEFY Earbuds at the best price in Bangladesh. Latest DEFY TWS True Wireless Earbuds available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"DEFY TWS Earbuds","status":"In Stock","code":"34247","brand":"DEFY","product_page_short_description":["Model: Gravity Turbo","Bluetooth: Version 5.3","30 Hours Playback","Turbo mode with 50ms low latency","Case Charge Capacity: 450mAh"],"emi_price":234,"full_description":"<h2>DEFY Gravity Turbo Low Latency True Wireless Gaming Earbuds</h2><p>The DEFY <span style=\"font-weight: bold;\">Gravity Turbo</span> Low Latency True Wireless Gaming Earbuds are expertly constructed to deliver an exceptional gaming audio experience. These earbuds' Turbo mode, which delivers an extremely low 50ms latency and eliminates lag, ensures real-time audio synchronization, providing gamers a competitive edge. Large gaming periods are assured with the large 30-hour battery backup, so frequent recharging is not necessary. Designed with the gaming enthusiast in mind, these earbuds feature intuitive LED lights that not only add a visually dynamic element but also contribute to an immersive gaming environment. The 10mm dynamic drivers embedded in the earbuds deliver superior sound quality, capturing the nuances of in-game audio with precision. With the addition of 4-microphone ENC (Environmental Noise Cancellation) Technology, communication is incredibly clear. By successfully cutting out background noise during calls, this technology guarantees clear and continuous conversation. With a remarkable 180 minutes of backup time, the earbuds' rapid 10-minute charge time and brisk charging technology make them perfect for people who lead hectic, mobile lives. The IPX4 splash and sweat resistance certification means that customers who are active and able to endure the hardships of intense workouts or gaming sessions may use these headphones. The Quick Pair &amp; Connect feature increases user convenience by speeding up the connecting procedure. In conclusion, customers who need outstanding performance and reliability from their wireless earbuds are the target market for the DEFY Gravity Turbo earbuds. They achieve this by fusing modern technology with potent features and a clever design.</p><h2 style=\"\"><span style=\"color: inherit; font-family: inherit;\">Buy&nbsp;</span>DEFY Gravity Turbo Low Latency True Wireless Gaming Earbuds<span style=\"color: inherit; font-family: inherit;\">&nbsp;Shop in Bangladesh: Star Tech</span><br></h2><p>In Bangladesh, you can get original&nbsp;<span style=\"font-weight: 700;\">DEFY Gravity Turbo Low Latency True Wireless Gaming Earbuds</span>&nbsp;From Star Tech. We have a large collection of the latest&nbsp;<a href=\"https://www.startech.com.bd/havit-earbuds\" target=\"_blank\">DEFY Earbuds</a>&nbsp;to purchase for your Mobile. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech</a>&nbsp;Shop to get yours at the lowest price. The Havit TW965 True Wireless Earbuds come with a 1 Year Full Replacement in the Whole Warranty period ( must claim with box and all accessories)</p>","specifications":[{"heading":"Main Feature","values":[{"key":"Frequency","value":"20Hz~20KHz"},{"key":"Connection Type","value":"Bluetooth 5.3"},{"key":"Battery","value":"400mAH"},{"key":"Duration","value":"Earbud playtime: about 6 hrs (at 70%)"},{"key":"Others","value":"Charging connector: Type-C"}]},{"heading":"Physical Specification","values":[{"key":"Drivers","value":"10mm Dynamic Driver"},{"key":"Weight","value":"3.9g"},{"key":"Color","value":"Gray"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"1 Year Full Replacement in the Whole Warranty period ( must claim with box and all accessories)"}]}],"latest_price":{"heading":"What is the price of DEFY Gravity Turbo TWS Gaming Earbuds in Bangladesh?","paragraph":"The latest price of DEFY Gravity Turbo TWS Gaming Earbuds in Bangladesh is 1,330৳. You can buy the DEFY Gravity Turbo TWS Gaming Earbuds at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/earbuds/defy/gravity-turbo/gravity-turbo-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/defy/gravity-turbo/gravity-turbo-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/defy/gravity-turbo/gravity-turbo-03-500x500.webp"],"product_seo_title":"DEFY Gravity Turbo TWS Gaming Earbuds Price in Bangladesh | Star Tech","product_seo_description":"Buy DEFY Gravity Turbo TWS Gaming Earbuds at the best price in Bangladesh. Order latest DEFY Gravity Turbo True Wireless Gaming Earbuds from Star Tech Online shop in BD.","product_seo_keywords":"DEFY Gravity Turbo Low Latency True Wireless Gaming Earbuds"}]