[{"url":"https://www.startech.com.bd/dji-pocket-2-creator-combo-3-action-camera","img":"https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-01-228x228.jpg","title":"DJI Osmo Pocket 2 Creator Combo 3 Axis Gimbal Stabilizer Action Camera","product_list_short_description":["Camera with 1/1.7\" 64MP CMOS Sensor","Up to 8x Zoom, 93° Angle of View","Optional Wi-Fi & Bluetooth Monitoring","Time-Lapse, Motion-Lapse, Panorama Modes"],"price_new":48500,"price_old":52000,"price_single":48500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"21888","brand":"Dji","product_page_short_description":["Model: Pocket 2 Creator Combo","Camera with 1/1.7\" 64MP CMOS Sensor","Up to 8x Zoom, 93° Angle of View","Optional Wi-Fi & Bluetooth Monitoring","Time-Lapse, Motion-Lapse, Panorama Modes"],"emi_price":4442,"full_description":"<h2>DJI Pocket 2 Creator Combo 3 Axis Gimbal Stabilizer Action Camera</h2>\n\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera adds a 1/1.7\" 64MP CMOS sensor, up to 8x zoom, a 93Â° angle of view, and four directional stereo microphones with DJI Matrix Stereo audio zoom to its predecessor, employing its lightweight, ultra-compact 3-axis gimbal stabilizer and 4K camera combo. New software additions include an upgraded ActiveTrack 3.0, built-in glamour effects, an AI editor, Hybrid AF 2.0, and motion-lapse, all without the need for a smartphone app. It includes everything you'll need for a high-resolution mobile production to make family films, add footage to photo sessions or vlog your latest streaming masterpieces with smooth motion video.</p>\n\n<h3>Pocket-Sized and Creator Combo</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera is a pocket-sized and incredibly portable camera that allows you to film unforgettable events on your own. It can steady movement, capture excellent photographs, and record smooth movies. A wide-angle lens, a \"Do-it-All\" handle, a USB Type-A to Type-C splitter, a wireless microphone transmitter, and a mini tripod are all included in the Creator Combo.</p>\n\n<h3>High-Definition Panorama and ActiveTrack 3.0</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera Get a 180Â° panorama of the entire mountain range or a 3x3 panoramic of everyone in a group selfie. With ActiveTrack 3.0, Pocket 2 keeps you and your buddies in the shot no matter how you move.</p>\n\n<h3>Story Mode and Time-Lapse</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera Story mode employs video and audio templates to create thrilling mini-movies in a matter of seconds. Time-lapse photography allows you to compress hours into seconds. Motion-lapse incorporates smooth camera movement. Hyper-lapse photography allows you to journey through time.</p>\n\n<h3>AI Editor and Motorized Stabilization</h3>\nNot interested in editing? AI Editor blends your video with transitions and music to produce shareable content. Glamour effects, an AI editor, and narrative mode software are all included.<p></p>\n\n<h3>Hollywood-Quality Smoothness and Image Quality</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera 3-axis motorized gimbal is what permits this little camera to provide large-screen effects. The Pocket 2 has a 1/1.7\" sensor, can take up to 64MP images, can shoot video at up to 4K60, and has Hybrid AF 2.0.</p>\n\n<h3>HDR Video and 8x Zoom</h3>\n<p>The DJI Pocket 2 Creator Combo 3 Action Camera is a 3-in-1 action camera. A good life is full of color, so let it all shine. DJI Pocket 2 uses HDR video to split exposure settings by location and overlay the image so that the film bursts with life-like realism. Looking for attention to detail? The stabilized camera captures excellent 8x zoom stills while capturing 64MP images, up to 4x zoom on 1080p video, and up to 2x zoom on 4K video. It has no warranty.</p>\n","specifications":[{"heading":"Key Features","values":[{"key":"Image Sensor","value":"1/1.7\"-Type CMOS Sensor"},{"key":"Sensor Resolution","value":"Effective: 64 Megapixel"},{"key":"Display","value":"Fixed LCD"},{"key":"USB Port","value":"1 x USB 2.0 Type-C Charging"},{"key":"Memory","value":"Single Slot: microSD/microSDHC/microSDXC"}]},{"heading":"Battery Information","values":[{"key":"Charging Interface","value":"Type-C"},{"key":"type","value":"USB"},{"key":"Charging Time","value":"1.25 Hours"}]},{"heading":"Special Features","values":[{"key":"Wi-Fi","value":"Yes"},{"key":"Tripod/Monopod Mountable","value":"1/4\"-20 Female"},{"key":"HDR Mode","value":"Yes"},{"key":"Slow Motion Recording","value":"240 fps Recorded at 1920 x 1080p"}]},{"heading":"Warranty Information","values":[{"key":"Manufacturing Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI Pocket 2 Creator Combo 3 Action Camera in Bangladesh?","paragraph":"The latest price of DJI Pocket 2 Creator Combo 3 Action Camera in Bangladesh is 48,500৳. You can buy the DJI Pocket 2 Creator Combo 3 Action Camera at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/pocket-2-creator-combo/pocket-2-creator-combo-04-500x500.jpg"],"product_seo_title":"DJI Pocket 2 Creator Combo 3 Action Camera Price in Bangladesh","product_seo_description":"Buy DJI Pocket 2 Creator Combo Action Camera at the best price in Bangladesh. Latest DJI Action Camera is available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"DJI Osmo Pocket 2 Creator Combo 3 Axis Gimbal Stabilizer Action Camera"},{"url":"https://www.startech.com.bd/dji-osmo-pocket-waterproof-case","img":"https://www.startech.com.bd/image/cache/catalog/camera-accessories/pocket-waterproof/pocket-waterproof-02-228x228.jpg","title":"DJI Osmo Pocket Waterproof Case","product_list_short_description":["Supports water resistance at depths of up to 60m","Includes two mounting brackets","Designed for mirrorless cameras","Anti-fog inserts"],"price_new":0,"price_old":0,"price_single":7000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"19594","brand":"Dji","product_page_short_description":["Model: Waterproof Case","Supports water resistance at depths of up to 60m","Includes two mounting brackets","Designed for mirrorless cameras","Anti-fog inserts"],"emi_price":642,"full_description":"<h2 style=\"text-align: justify; \">DJI Osmo Pocket Waterproof Case\n<br></h2>\n\n<p style=\"text-align: justify; \">DJI Osmo Pocket Waterproof Case supports water resistance at depths of up to 60 m. In this Osmo Pocket Waterproof Case, Two buttons on the outside grant precise control of the Osmo Pocket. Here, Includes two mounting brackets for additional accessories. In avoiding unwanted movements, the precise fit inside the case keeps Osmo Pocket secure. The Osmo Waterproof Case also includes two mounting brackets that allow you to attach the case to other equipment. When you use this Camera water case, make sure Osmo Pocket is powered off before placing it in the waterproof case. The anti-fog inserts effectively prevent the case from fogging up. It is designed with 169.30 x 72.60 x 80.60 mm size and 110g Weight. The camera cannot be adjusted when you used with the waterproof case, and also make sure the anti-fog insert works properly. Replace the anti-fog insert regularly. The new DJI Osmo Pocket Waterproof Case has no warranty.\n</p>","specifications":[],"latest_price":{"heading":"What is the price of DJI Osmo Pocket Waterproof Case in Bangladesh?","paragraph":"The latest price of DJI Osmo Pocket Waterproof Case in Bangladesh is 7,000৳. You can buy the DJI Osmo Pocket Waterproof Case at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/camera-accessories/pocket-waterproof/pocket-waterproof-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera-accessories/pocket-waterproof/pocket-waterproof-01-500x500.jpg"],"product_seo_title":"DJI Osmo Pocket Waterproof Case Price in Bangladesh","product_seo_description":"Buy DJI Osmo Pocket Waterproof Case at the best price in Bangladesh. Latest Osmo Case available at Star Tech Shop. Order online to get delivery anywhere in BD.\n","product_seo_keywords":"DJI Osmo Pocket Waterproof Case"},{"url":"https://www.startech.com.bd/dji-osmo-mobile-se-smartphone-gimbal","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-se/osmo-mobile-se-01-228x228.webp","title":"DJI Osmo Mobile SE Smartphone Gimbal with 3-Axis Stabilization","product_list_short_description":["Smartphone Gimbal Stabilizer","Up to 290 g Load Capacity","Supports Smartphones up to 3.3\" Wide","Time-Lapse, Hyperlapse, and Panorama Modes"],"price_new":10000,"price_old":11000,"price_single":10000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"27748","brand":"Dji","product_page_short_description":["MPN: M05E01","Model: Osmo Mobile SE","Smartphone Gimbal Stabilizer","Up to 290 g Load Capacity","Supports Smartphones up to 3.3\" Wide","Time-Lapse, Hyperlapse, and Panorama Modes"],"emi_price":1000,"full_description":"<h2 style=\"text-align: justify; \">DJI Osmo Mobile SE Smartphone Gimbal with 3-Axis Stabilization</h2><p style=\"text-align: justify; \">The DJI Osmo Mobile SE Smartphone Gimbal stabilizer enhances stability and enables you to move your footage more creatively by having a smaller form factor and a longer battery life than its predecessor. More shooting modes and features are available when using the DJI Mimo app thanks to the improved Bluetooth 5.1 connection. The OM Magnetic Phone Clamp 3 is another feature of the SE that enables the rig to support cellphones up to 3.3\" broad. The gimbal can support weights up to 10.2 oz overall. A grip tripod, power cord, and storage pouch are all included with the gimbal so you can take it with you wherever you go.</p><h3 style=\"text-align: justify; \">ActiveTrack 5.0</h3><p style=\"text-align: justify; \">The DJI Osmo Mobile SE Smartphone Gimbal Upgraded ActiveTrack 5.0 enhances stability over greater distances and supports front camera tracking from both side orientations and while spinning. Built-in 3-axis gimbal motors produce smooth video even when they are operating with lossless delivery.</p><h3 style=\"text-align: justify; \">Timelapse, Motion lapse, Hyperlapse</h3><p style=\"text-align: justify; \">The DJI Osmo Mobile SE Smartphone Gimbal With the grip tripod, place your gimbal on a level surface and start a timelapse of the view of your choice. During your timelapse, use Motionlapse to pre-set a gimbal path for subtle, dynamic movement. Using hyper-lapse, you may quickly and steadily capture motion. You may make compilation videos using the DJI Mimo app's templates by selecting footage to emphasize.</p><h3 style=\"text-align: justify; \">Gimbal Modes</h3><p style=\"text-align: justify; \">This Gimbal modes refer to the different settings available on a camera gimbal that control its movement and orientation while shooting. One of the most common modes is the \"Follow\" mode, in which the camera view follows the gimbal's pan and tilt movements while remaining stable during rolls. This mode is useful for capturing smooth, steady footage while tracking a subject's movement. Another popular mode is \"Tilt Locked,\" which allows the camera view to only follow the gimbal's pan movement while remaining stable during tilts and rolls. This mode is useful when filming a subject that is stationary or when the camera needs to stay level while the gimbal moves. The \"FPV\" mode is a more advanced setting that allows all three axes of the gimbal to follow the movement of the main body. This mode is commonly used in drone or action camera footage, where the camera needs to follow the movement of the user. The \"SpinShot\" mode allows the user to control the rotation of the gimbal by pushing the joystick left or right. This mode is useful when filming panoramic shots or when the user wants to add a dynamic element to their footage. Compact and Portable. Fold the Mobile SE down to a compact form factor capable of fitting in your pocket. Its magnetic phone clamp easily detaches when not in use and is capable of fitting around your phone while in its case.</p><h3 style=\"text-align: justify; \">Bluetooth 5.1 for Remote Control</h3><p style=\"text-align: justify; \">The DJI Osmo Mobile SE Smartphone Gimbal Integrated Bluetooth 5.1 connectivity allows you to control your gimbal from your smartphone with the DJI Mimo app. Tutorials provide intuitive instructions and guides to execute your creative vision. Toggle between modes like Timelapse, Dynamic Zoom, and Panorama. When touching your screen or controls is inefficient, Gesture Control has your back for easy group photos or selfies. Once finished, LightCut can help you edit your videos or photos with embedded AI-powered templates.</p><h3 style=\"text-align: justify; \">Onboard Control</h3><p style=\"text-align: justify; \">The DJI Osmo Mobile SE Smartphone Gimbal's straightforward, easy-to-reach controls let you control all three axes while holding the gimbal. You may check the gimbal mode, system status indicator, and battery level using the built-in status screen. The mode button alternates among the four gimbal modes. Adjustments are made quickly at a maximum control speed of 120°/s. At the push of a button, switch between portrait and landscape orientations.</p><h2>Buy DJI Osmo Mobile SE Smartphone Gimbal with 3-Axis Stabilization from the best  Gimbal Shop in BD</h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/dji-osmo-mobile-se-smartphone-gimbal\" target=\"\">DJI Osmo Mobile SE Smartphone Gimbal with 3-Axis Stabilization</a> From Star Tech. We have a large collection of the latest <a href=\"https://www.startech.com.bd/dji-gimbal\" target=\"\">DJI Gimbal</a> to purchase for your <a href=\"https://www.startech.com.bd/mobile-phone\" target=\"\">Mobile</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at the lowest price. The DJI Osmo Mobile SE Smartphone Gimbal comes with 3 years of warranty.</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Unfolded: 262.5×119.5×104 mm (L×W×H)"},{"key":"Weight","value":"Gimbal: Approx. 352 g"},{"key":"Compatibility","value":"Camera Control: On Compatible Models"}]},{"heading":"Battery","values":[{"key":"Type","value":"Li-ion"},{"key":"Capacity","value":"2600 mAh"},{"key":"Energy","value":"9.36 Wh"},{"key":"Charging Temperature","value":"5° to 40° C (41° to 104° F)"},{"key":"Operating Temperature","value":"0° to 40° C (32° to 104° F)"},{"key":"Operating Time","value":"Approx. 8 hours (measured under ideal conditions with the gimbal fully balanced)"},{"key":"Charging Time","value":"Approx. 2 hours and 12 minutes (measured with a 10W Type-C charger)"},{"key":"Ports","value":"USB-C"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan: -161.2° to 171.95°"},{"key":"Max Controllable Speed","value":"120°/s"},{"key":"Width of Compatible","value":"Width: 2.6 to 3.3\" / 67 to 84 mm"},{"key":"Thickness of Compatible","value":"Thickness: 0.3 to 0.4\" / 6.9 to 10 mm"},{"key":"Maximum Load","value":"170 to 290 g"},{"key":"Wireless","value":"Bluetooth 5.1"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No warranty"}]}],"latest_price":{"heading":"What is the price of DJI Osmo Mobile SE Smartphone Gimbal in Bangladesh?","paragraph":"The latest price of DJI Osmo Mobile SE Smartphone Gimbal in Bangladesh is 10,000৳. You can buy the DJI Osmo Mobile SE Smartphone Gimbal at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-se/osmo-mobile-se-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-se/osmo-mobile-se-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-se/osmo-mobile-se-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-se/osmo-mobile-se-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-se/osmo-mobile-se-05-500x500.webp"],"product_seo_title":"DJI Osmo Mobile SE Smartphone Gimbal with 3-Axis Stabilization price in Bangladesh","product_seo_description":"Buy DJI Osmo Mobile SE Smartphone Gimbal with 3-Axis Stabilization at the best price in Bangladesh. Order latest DJI Osmo Mobile SE Smartphone Gimbal with 3-Axis Stabilization from Star Tech Online shop in BD.","product_seo_keywords":"DJI Osmo Mobile SE Smartphone Gimbal with 3-Axis Stabilization"},{"url":"https://www.startech.com.bd/dji-rs-3-mini-gimbal-stabilizer","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3/rs-3-01-228x228.webp","title":"DJI RS 3 Mini Gimbal Stabilizer","product_list_short_description":["1.4\" Full-Color Touchscreen","Supports A7 + 24-70mm F2.8 GM","3rd-Gen RS Stabilization Algorithm","795g (1.75lbs) Lightweight Design"],"price_new":35000,"price_old":38000,"price_single":35000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"29188","brand":"Dji","product_page_short_description":["Model: RS 3","1.4\" Full-Color Touchscreen","Supports A7 + 24-70mm F2.8 GM","3rd-Gen RS Stabilization Algorithm","795g (1.75lbs) Lightweight Design"],"emi_price":3417,"full_description":"<h2>DJI RS 3 Mini Gimbal Stabilizer</h2><p style=\"text-align: justify; \">The DJI RS 3 Mini Gimbal Stabilizer is a compact and versatile stabilization device designed for mirrorless cameras. It features a 1.4\" full-color OLED touchscreen that allows for easy control and navigation of settings. With its lightweight design weighing in at just 795g (1.75 lbs), it is incredibly portable and suitable for on-the-go shooting. Equipped with the 3rd-Gen RS Stabilization Algorithm, the RS 3 Mini ensures smooth and steady footage, minimizing camera shakes and vibrations. It supports the A7 + 24-70mm F2.8 GM lens, providing compatibility with popular mirrorless camera setups. The gimbal stabilizer can handle a maximum payload of up to 4.4 lbs, allowing for a wide range of camera and lens combinations. It offers wireless camera control via Bluetooth, enabling convenient adjustments and settings changes remotely. The DJI RS 3 Mini Gimbal Stabilizer offers both horizontal and vertical shooting modes, giving users flexibility and creative freedom. It features panorama, timelapse, and tracking functions, allowing for dynamic and engaging shots. The built-in 2450mAh battery provides a runtime of up to 10 hours, ensuring extended usage without frequent recharging. The gimbal stabilizer is equipped with a NATO rail that enables the attachment of handles and various accessories, enhancing the overall shooting experience. Whether you're capturing professional footage or documenting your adventures, the DJI RS 3 Mini Gimbal Stabilizer offers stability, control, and a host of creative features to elevate your videography.</p><h2 style=\"text-align: justify; \">Buy DJI RS 3 Mini Gimbal Stabilizer from Star Tech</h2><p>In Bangladesh, you can get original&nbsp;<a href=\"https://www.startech.com.bd/dji-rs-3-mini-gimbal-stabilizer\" target=\"\">DJI RS 3 Mini Gimbal Stabilizer</a>&nbsp;From Star Tech. We have a large collection of latest&nbsp;<a href=\"https://www.startech.com.bd/dji-gimbal\" target=\"\">DJI Gimbal</a>&nbsp;to purchase for your&nbsp;<a href=\"https://www.startech.com.bd/mobile-phone\" target=\"\">mobile phone</a>. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a>&nbsp;Shop to get yours at lowest price. The DJI RS 3 Mini Gimbal Stabilizer comes with no warranty.</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Folded: 220×200×75 mm"},{"key":"Weight","value":"Folded: 323×195×98 mm (L×W×H, height excludes the Extended Grip/Tripod)"},{"key":"Model","value":"HB7-2450mAh-7.2"}]},{"heading":"Battery","values":[{"key":"Type","value":"18650 Li-ion 2S"},{"key":"Capacity","value":"2450 mAh"},{"key":"Energy","value":"17.64 Wh"},{"key":"Voltage","value":"7.2 VDC"},{"key":"Charging Temperature","value":"5° to 40°C (41° to 104°F)"},{"key":"Operating Temperature","value":"-10° to 45° C (14° to 113° F)"},{"key":"Operating Time","value":"10 hours"},{"key":"Charging Time","value":"Approx. 2.5 hours"},{"key":"Ports","value":"USB-C Charging Port"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan Axis: 360° continuous rotation"},{"key":"Max Controllable Speed","value":"Pan: 360°/s"},{"key":"Maximum Load","value":"0.4-2 kg (0.8-4.4 lbs)"},{"key":"Wireless","value":"Bluetooth 5.1"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI RS 3 Mini Gimbal Stabilizer in Bangladesh?","paragraph":"The latest price of DJI RS 3 Mini Gimbal Stabilizer in Bangladesh is 35,000৳. You can buy the DJI RS 3 Mini Gimbal Stabilizer at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3/rs-3-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3/rs-3-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3/rs-3-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3/rs-3-04-500x500.webp"],"product_seo_title":"DJI RS 3 Mini Gimbal Stabilizer Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI RS 3 Mini Gimbal Stabilizer at best price in Bangladesh. Latest DJI RS 3 Mini Gimbal Stabilizer available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"DJI RS 3 Mini Gimbal Stabilizer"},{"url":"https://www.startech.com.bd/dji-rsc-2-gimbal-stabilizer-pro-combo","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rsc-2-pro-combo/rsc-2-pro-combo-01-228x228.webp","title":"DJI RSC 2 Pro Combo Gimbal Stabilizer","product_list_short_description":["1\" OLED Screen; 2 x NATO Mounts","3.0 kg Payload for Camera & Accessories","Designed for Mirrorless & DSLR Cameras","RSC 2 + 1080p Transmitter, Servo & More"],"price_new":0,"price_old":0,"price_single":58300,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"29197","brand":"Dji","product_page_short_description":["Model: RSC 2 Pro Combo","1\" OLED Screen; 2 x NATO Mounts","3.0 kg Payload for Camera & Accessories","Designed for Mirrorless & DSLR Cameras","RSC 2 + 1080p Transmitter, Servo & More"],"emi_price":5344,"full_description":"<h2>DJI RSC 2 Pro Combo Gimbal Stabilizer</h2><p style=\"text-align: justify; \">The DJI RSC 2 Gimbal Stabilizer Pro Combo is a professional-grade camera stabilizer designed specifically for mirrorless and DSLR cameras. This versatile stabilizer allows you to capture smooth and steady footage while on the move, providing professional-quality results. With a maximum payload of 6.6 pounds, the RSC 2 can easily accommodate not only your camera but also various accessories, allowing you to customize your setup according to your shooting needs. Its foldable design enables you to switch to underslung mode, providing additional shooting angles and flexibility. Featuring a 1\" OLED screen, the RSC 2 provides a clear and intuitive interface for easy control and monitoring of your settings. It is equipped with two NATO mounts, offering convenient attachment points for accessories such as a wireless video transmitter or other compatible equipment. The RSC 2 is the DJI Titan Stabilization Algorithm, which ensures precise and stable footage even in dynamic shooting situations. This advanced algorithm combines with powerful motors to provide smooth and responsive stabilization performance. The RSC 2 also includes a built-in focus dial, allowing you to make quick and precise focus adjustments without the need for additional equipment. Additionally, the SuperSmooth feature enhances stability when using long lenses, ensuring smooth tracking shots and minimizing camera shake. This gimbal stabilizer offers both standard and portrait modes, giving you the flexibility to capture footage in various orientations. Furthermore, it boasts creative functions like Roll 360, enabling you to achieve stunning cinematic effects with seamless camera movements. The DJI RSC 2 Gimbal Stabilizer Pro Combo is a professional-grade camera stabilizer that combines advanced stabilization technology, a versatile design, and a range of creative features. Whether you're shooting videos or capturing photos, this gimbal provides the stability and control necessary to elevate your content to new heights.</p><h2 style=\"\">Buy DJI RSC 2 Gimbal Stabilizer Pro Combo from the best Shop in BD</h2><p>In Bangladesh, you can get the original&nbsp;<a href=\"https://www.startech.com.bd/dji-rsc-2-gimbal-stabilizer-pro-combo\" target=\"\">DJI RSC 2 Gimbal Stabilizer Pro Combo&nbsp;</a>From Star Tech. We have a large collection of&nbsp;<a href=\"https://www.startech.com.bd/dji-gimbal\" target=\"\">DJI Gimbal Stabilizers</a>&nbsp;to purchase for your&nbsp;<a href=\"https://www.startech.com.bd/camera\" target=\"\">camera</a>. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech&nbsp;</a>Shop to get yours at lowest price. The DJI RSC 2 Gimbal Stabilizer Pro Combo comes with no warranty.</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Folded: 260×210×75 mm (including the handle)"},{"key":"Weight","value":"Gimbal: Approx. 1216 g (including the battery and excluding Quick-Release Plate)"},{"key":"Model","value":"RB2-3400mAh -7.2 V"}]},{"heading":"Battery","values":[{"key":"Type","value":"18650 2S"},{"key":"Capacity","value":"3400mAh"},{"key":"Voltage","value":"7.2 V"},{"key":"Charging Temperature","value":"5° to 40° C (41° to 104° F)"},{"key":"Operating Temperature","value":"-20° to 45° C (-4° to 113° F)"},{"key":"Operating Time","value":"14 hours"},{"key":"Charging Time","value":"Approx. 2 hours to fully charge with 18W fast charging (PD and QC 2.0 fast charging protocols are supported)"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan axis: 360° continuous rotation"},{"key":"Max Controllable Speed","value":"Pan axis: 360°/s"},{"key":"Maximum Load","value":"3.0 kg"},{"key":"Wireless","value":"Bluetooth 5.0"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI RSC 2 Pro Combo Gimbal Stabilizer in Bangladesh?","paragraph":"The latest price of DJI RSC 2 Pro Combo Gimbal Stabilizer in Bangladesh is 58,300৳. You can buy the DJI RSC 2 Pro Combo Gimbal Stabilizer at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rsc-2-pro-combo/rsc-2-pro-combo-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rsc-2-pro-combo/rsc-2-pro-combo-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rsc-2-pro-combo/rsc-2-pro-combo-03-500x500.webp"],"product_seo_title":"DJI RSC 2 Pro Combo Gimbal Stabilizer Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI RSC 2 Pro Combo Gimbal Stabilizer at the best price in Bangladesh. Latest DJI RSC 2 Gimbal Stabilizer Pro Combo available at Star Tech Shop. Order online to get delivery anywhere in BD.","product_seo_keywords":"DJI RSC 2 Pro Combo Gimbal Stabilizer"},{"url":"https://www.startech.com.bd/dji-rs-3-gimbal-stabilizer-combo","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-combo/rs-3-combo-01-228x228.webp","title":"DJI RS 3 Gimbal Stabilizer Combo","product_list_short_description":["1.4\" Full-Color OLED Touchscreen","12-Hour Operation Time, PD Fast Charging","Lightweight Design with 3 Kg Payload","Combo Includes Focus Motor, Case, Cables"],"price_new":60000,"price_old":65000,"price_single":60000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"29191","brand":"Dji","product_page_short_description":["Model: RS 3 Combo","1.4\" Full-Color OLED Touchscreen","12-Hour Operation Time, PD Fast Charging","Lightweight Design with 3 Kg Payload","Combo Includes Focus Motor, Case, Cables"],"emi_price":5833,"full_description":"<h2>DJI RS 3 Gimbal Stabilizer Combo</h2><p style=\"text-align: justify; \">The DJI RS 3 Gimbal Stabilizer Combo is a professional-grade camera stabilization system designed to provide smooth and steady footage for filmmakers and videographers. With its advanced features and versatile design, it offers exceptional performance and convenience. The DJI RS 3 is its 1.4\" full-color OLED touchscreen. This high-resolution display allows for easy access to various settings and controls, making it convenient to adjust parameters and monitor your shots in real time. The gimbal stabilizer offers an impressive 12-hour operation time, ensuring extended shooting sessions without the need for frequent battery changes. Additionally, it supports PD fast charging, which means you can quickly recharge the device and minimize downtime between shoots. Designed with portability in mind, the DJI RS 3 features a lightweight design while still maintaining a robust construction. It has a maximum payload capacity of 3 kg (6.6 lbs), making it compatible with a wide range of camera setups, including mirrorless cameras, DSLRs, and even small cinema cameras. The combo package of the DJI RS 3 includes several accessories to enhance your shooting experience. It comes with a focus motor, which enables precise and accurate focusing control, ensuring your shots are always sharp and in focus. Additionally, a protective case is included to safely transport and store the gimbal, protecting it from any potential damage. The combo also includes various cables to connect your camera and other devices to the gimbal, ensuring seamless integration. Whether you're shooting professional films, or documentaries, or capturing memorable moments, the DJI RS 3 Gimbal Stabilizer Combo offers exceptional stability, versatility, and convenience, making it a valuable tool for filmmakers and videographers alike.</p><h2><span style=\"text-align: justify;\"><span style=\"color: inherit; font-family: inherit;\">Buy </span>DJI RS 3 Gimbal Stabilizer Combo<span style=\"color: inherit; font-family: inherit;\">&nbsp;from Star Tech</span></span><br></h2><p>In Bangladesh, you can get original&nbsp;<a href=\"https://www.startech.com.bd/dji-rs-3-gimbal-stabilizer-combo\" target=\"\">DJI RS 3 Gimbal Stabilizer Combo</a>&nbsp;From Star Tech. We have a large collection of latest&nbsp;<a href=\"https://www.startech.com.bd/dji-gimbal\" target=\"\">DJI Gimbal</a>&nbsp;to purchase for your&nbsp;<a href=\"https://www.startech.com.bd/mobile-phone\" target=\"\">mobile phone</a>. Order Online Or Visit your Nearest&nbsp;<a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a>&nbsp;Shop to get yours at lowest price. The DJI RS 3 Gimbal Stabilizer Combo comes with no warranty.</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Folded: 254×230×68 mm (L×W×H, excluding camera, grip, and the Extended Grip/Tripod)"},{"key":"Weight","value":"Gimbal: Approx. 990 g (2.18 lbs)"},{"key":"Model","value":"BHX711-3000-7.2V"}]},{"heading":"Battery","values":[{"key":"Type","value":"2S"},{"key":"Capacity","value":"3000 mAh"},{"key":"Energy","value":"17.64 Wh"},{"key":"Voltage","value":"7.2 VDC"},{"key":"Charging Temperature","value":"5° to 40°C (41° to 104°F)"},{"key":"Operating Temperature","value":"-10° to 45° C (14° to 113° F)"},{"key":"Operating Time","value":"10 hours"},{"key":"Charging Time","value":"Approx. 2.5 hours"},{"key":"Ports","value":"USB-C Charging Port"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan Axis: 360° continuous rotation"},{"key":"Max Controllable Speed","value":"Pan: 360°/s"},{"key":"Maximum Load","value":"0.4-2 kg (0.8-4.4 lbs)"},{"key":"Wireless","value":"Bluetooth 5.1"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI RS 3 Gimbal Stabilizer Combo in Bangladesh?","paragraph":"The latest price of DJI RS 3 Gimbal Stabilizer Combo in Bangladesh is 60,000৳. You can buy the DJI RS 3 Gimbal Stabilizer Combo at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-combo/rs-3-combo-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-combo/rs-3-combo-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-combo/rs-3-combo-03-500x500.webp"],"product_seo_title":"DJI RS 3 Gimbal Stabilizer Combo Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI RS 3 Gimbal Stabilizer Combo at best price in Bangladesh. Latest DJI RS 3 Gimbal Stabilizer Combo available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"DJI RS 3 Gimbal Stabilizer Combo"},{"url":"https://www.startech.com.bd/dji-rs-3-pro-gimbal-stabilizer","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-07-228x228.webp","title":"DJI RS 3 Pro Gimbal Stabilizer","product_list_short_description":["1.8'' OLED full-color touchscreen","Lightweight Design with 4.5 kg Payload","Supports Wireless Transmitter, LiDAR","Supports Sony FX6/Canon C70 Cameras"],"price_new":0,"price_old":0,"price_single":93500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"29195","brand":"Dji","product_page_short_description":["Model: RS 3 Pro","1.8'' OLED full-color touchscreen","Lightweight Design with 4.5 kg Payload","Supports Wireless Transmitter, LiDAR","Supports Sony FX6/Canon C70 Cameras"],"emi_price":8571,"full_description":"<h2>DJI RS 3 Pro Gimbal Stabilizer</h2><p style=\"text-align: justify; \">The DJI RS 3 Pro <a href=\"https://www.startech.com.bd/gimbal\" target=\"\" style=\"color: rgb(0, 0, 0);\">Gimbal</a> Stabilizer surpasses the RS 2 gimbal in terms of power. Its body is crafted from carbon silver, weighing in at 3.3 pounds. It has the capacity to support up to 10 pounds of weight, enabling effortless handling of setups such as the Sony FX6 or Canon C70 with a 24-70mm zoom lens attached. The gimbal's arms are meticulously constructed using layers of uncut carbon fiber, resulting in its lightweight nature and facilitating smooth shooting experiences. Additionally, this gimbal features a precision adjustment knob, further enhancing its versatility as a camera accessory.</p><p style=\"text-align: justify; \"><span style=\"color: inherit; font-family: inherit; font-size: 21px;\">Automated Axis Locks</span><br></p><p style=\"text-align: justify; \">This DJI RS 3 Pro Gimbal&nbsp;allows you to work within 2 seconds by simply pressing and holding the power button. The three axes unlock and the gimbal expands automatically. After finishing your work, you can automatically lock the axes and turn them into sleep mode just by pressing the power button within a moment.</p><h3 style=\"text-align: justify;\">Wireless Shutter Control</h3><p style=\"text-align: justify; \">This functionality makes it feasible to use mirror control mode and to provide seamless wireless control from wherever on set. You may control the primary menu features of the Sonny mirrorless camera by using the DJI RS 3 Pro's camera control features. The camera doesn't need to be removed from its mount. In this gimbal, a gyroscopic sensor may be used to turn on the remote monitor without the use of any additional gear. This functionality enables you to create more complex camera movement when driving or utilizing a jib.</p><p style=\"text-align: justify; \"><span style=\"color: inherit; font-family: inherit; font-size: 21px;\">Enhanced Battery and Fast Charging</span><br></p><p style=\"text-align: justify; \">DJI RS 3 Pro's new battery grip provides up to 12-hour runtime. So you can continuously shoot all day long. It needs only 2.5 hours of charging time as it supports 18W PD fast charging.</p><h3 style=\"text-align: justify;\">Large 1.8\" OLED Touchscreen</h3><p style=\"text-align: justify; \">The DJI RS 3 Pro has 1.8 inches OLED full-color touchscreen. It gives a 28% larger display than RS 2. This OLED screen offers higher brightness than the LCD screen with low power consumption.</p><h3 style=\"text-align: justify; \">Third-Gen RS Stabilization Algorithm</h3><p style=\"text-align: justify; \">The DJI RS 3 Pro employs a third-generation RS stabilization algorithm, delivering 20% enhanced stability compared to its predecessor. This enables seamless handling of low-angle shots, running sequences, and various high and low positions.</p><h2>Buy DJI RS 3 Pro Gimbal Stabilizer from the best Shop in BD</h2><p>In Bangladesh, you can get the original <a href=\"https://www.startech.com.bd/dji-rs-3-pro-gimbal-stabilizer\" target=\"\">DJI RS 3 Pro Gimbal Stabilizer </a>From Star Tech. We have a large collection of <a href=\"https://www.startech.com.bd/dji-gimbal\" target=\"\">DJI Gimbal Stabilizers</a> to purchase for your <a href=\"https://www.startech.com.bd/camera\" target=\"\">camera</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech </a>Shop to get yours at lowest price. The RS 3 Pro Gimbal Stabilizer comes with no warranty. </p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"16.3 x 8.6 x 7.7\" / 415 x 218 x 195 mm"},{"key":"Weight","value":"2.5 lb / 1143 g"},{"key":"Model","value":"RS 3 Pro"},{"key":"Compatibility","value":"On Compatible Models"}]},{"heading":"Battery","values":[{"key":"Type","value":"1 x Built-In"},{"key":"Capacity","value":"1950 mAh / 30 Wh"},{"key":"Energy","value":"12 Hours"},{"key":"Voltage","value":"15.4 VDC"},{"key":"Operating Temperature","value":"-4 to 113°F / -20 to 45°C"},{"key":"Charging Time","value":"1.5 Hours"},{"key":"Ports","value":"3 x USB-C (Control) Output"},{"key":"Mount","value":"1 x 1/4\"-20 Female"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan axis: 360° continuous rotation"},{"key":"Max Controllable Speed","value":"Pan: 360°/s"},{"key":"Maximum Load","value":"9.9 lb / 4.5 kg"},{"key":"Wireless","value":"Bluetooth 5.0"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No warranty"}]},{"heading":"Camera","values":[{"key":"ISO Range","value":"iOS 11.0 or above"}]}],"latest_price":{"heading":"What is the price of DJI RS 3 Pro Gimbal Stabilizer in Bangladesh?","paragraph":"The latest price of DJI RS 3 Pro Gimbal Stabilizer in Bangladesh is 93,500৳. You can buy the DJI RS 3 Pro Gimbal Stabilizer at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-07-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-08-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-09-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-10-500x500.webp"],"product_seo_title":"DJI RS 3 Pro Gimbal Stabilizer Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI RS 3 Pro Gimbal Stabilizer at best price in Bangladesh. Latest DJI RS 3 Pro Gimbal Stabilizer available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"DJI RS 3 Pro Gimbal Stabilizer"},{"url":"https://www.startech.com.bd/dji-rs-3-pro-gimbal-stabilizer-combo","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-01-228x228.webp","title":"DJI RS 3 Pro Gimbal Stabilizer Combo","product_list_short_description":["3rd-Gen DJI RS Stabilization Algorithm","Automated axis locks, Extended carbon fiber axis arms","4.5kg (10lbs) max tested payload","1.8'' OLED full-color touchscreen"],"price_new":0,"price_old":0,"price_single":114500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"25879","brand":"Dji","product_page_short_description":["Model: RS 3 Pro","3rd-Gen DJI RS Stabilization Algorithm","Automated axis locks, Extended carbon fiber axis arms","4.5kg (10lbs) max tested payload","1.8'' OLED full-color touchscreen"],"emi_price":9875,"full_description":"<h2>DJI RS 3 Pro Gimbal Stabilizer Combo</h2><p>DJI RS 3 Pro <a href=\"https://www.startech.com.bd/gadget/\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\">Gimbal Stabilizer</a> Combo is now more potent than the RS 2 gimbal. It is made of a carbon silver body. and weight is 3.3. And it can take up 10 10lb weight. So it can easily carry  Sony FX6 or Canon C70 with an attached 24-70mm zoom lens. Its arms are constructed from layered sheets of uncut carbon fiber. For this, this gimbal is so low weight and easy to shoot all time. This Gilmer has a fine-tuning knob. So this can be a special kit for a camera.</p><h3>Automated Axis Locks</h3><p>DJI RS 3 Pro gambler allows you to work within 2 seconds by simply pressing and holding the power button. The three axes unlock and the gimbal expands automatically. After finishing your work, you can automatically lock the axes and turn them into sleep mode just by pressing the power button within a moment.</p><h3>Wireless Shutter Control</h3><p>This feature allows you to use mirror control mode and unlocks seamless wireless control from anywhere on set. DJI RS 3 Pro's this camera control feature allows you to control the core menu operations for the sonny mirrorless camera. You do not need to detach your camera. In this gimbal, a gyroscopic sensor can turn on the remote monitor without additional accessories. This feature allows you to accomplish more complex camera movement when you move in a vehicle or with a jib.</p><h3>Enhanced Battery and Fast Charging</h3><p>DJI RS 3 Pro's new battery grip provides up to 12-hour runtime. So you can continuously shoot all day long. It needs only 2.5 hours of charging time as it supports 18W PD fast charging.</p><h3>Large 1.8\" OLED Touchscreen</h3><p>DJI RS 3 Pro has 1.8 inches OLED full-color touchscreen. It gives a 28% larger display than RS 2. This OLED screen offers higher brightness than the LCD screen with low power consumption.</p><h3>Third-Gen RS Stabilization Algorithm</h3><p>DJI RS 3 Pro has used a third Gen RS stabilization algorithm. It provides you with 20% more stability than the previous version. So, by using this you can easily manage low-angle shoots, running scenarios, and high and low positions.</p><h2>Buy DJI RS 3 Pro Gimbal Stabilizer Combo from the best Shop in BD</h2><p>In Bangladesh, you can get the original <a href=\"https://www.startech.com.bd/dji-rs-3-pro-gimbal-stabilizer-combo\" target=\"_blank\">DJI RS 3 Pro Stabilizer Combo</a> From Star Tech. We have a large collection of <a href=\"https://www.startech.com.bd/dji-gimbal\" target=\"\">DJI Gimbal Stabilizers</a> to purchase for your <a href=\"https://www.startech.com.bd/camera\" target=\"\">camera</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"_blank\">Star Tech </a>Shop to get yours at lowest price. The RS 3 Pro Gimbal Stabilizer Combo comes with no warranty. </p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"16.3 x 8.6 x 7.7\" / 415 x 218 x 195 mm"},{"key":"Weight","value":"2.5 lb / 1143 g"},{"key":"Model","value":"RS 3 Pro"},{"key":"Compatibility","value":"On Compatible Models"}]},{"heading":"Battery","values":[{"key":"Type","value":"1 x Built-In"},{"key":"Capacity","value":"1950 mAh / 30 Wh"},{"key":"Energy","value":"12 Hours"},{"key":"Voltage","value":"15.4 VDC"},{"key":"Operating Temperature","value":"-4 to 113°F / -20 to 45°C"},{"key":"Charging Time","value":"1.5 Hours"},{"key":"Ports","value":"3 x USB-C (Control) Output"},{"key":"Mount","value":"1 x 1/4\"-20 Female"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan axis: 360° continuous rotation"},{"key":"Max Controllable Speed","value":"Pan: 360°/s"},{"key":"Maximum Load","value":"9.9 lb / 4.5 kg"},{"key":"Wireless","value":"Bluetooth 5.0"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No warranty"}]},{"heading":"Camera","values":[{"key":"ISO Range","value":"iOS 11.0 or above"}]}],"latest_price":{"heading":"What is the price of DJI RS 3 Pro Gimbal Stabilizer Combo in Bangladesh?","paragraph":"The latest price of DJI RS 3 Pro Gimbal Stabilizer Combo in Bangladesh is 114,500৳. You can buy the DJI RS 3 Pro Gimbal Stabilizer Combo at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-05-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-3-pro/rs-3-pro-06-500x500.webp"],"product_seo_title":"DJI RS 3 Pro Gimbal Stabilizer Combo Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI RS 3 Pro Gimbal Stabilizer Combo at best price in Bangladesh. Latest DJI RS 3 Pro Gimbal Stabilizer available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"DJI RS 3 Pro Gimbal Stabilizer Combo"},{"url":"https://www.startech.com.bd/dji-om-4-gimbal","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4/om-4-228x228.jpg","title":"DJI OM 4 Handheld 3 Axis Stable Gimbal for Smartphone Vlogging and YouTube Live Video","product_list_short_description":["Portable and Foldable","Magnetic Design","Gesture Control","ActiveTrack 3.0"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"Out Of Stock","code":"14870","brand":"Dji","product_page_short_description":["Model: DJI OM 4","Portable and Foldable","Magnetic Design","Gesture Control","ActiveTrack 3.0"],"emi_price":0,"full_description":"<h2>DJI OM 4 Handheld 3 Axis Stable Gimbal for Smartphone Vlogging and YouTube Live Video<br></h2><p>Lifeâ€™s extraordinary moments deserve to be captured with smooth video. DJI OM 4 is a foldable stabilizer designed to complement your smartphone, allowing you to start recording right away. Magnetic, ultra-compact, and bursting with easy-to-use features, OM 4 is the ultimate solution for sharing your world. The magnetic phone clamp and magnetic ring holder enable effortless capture whenever inspiration strikes. Attach your smartphone to DJI OM 4 instantly, perfect for filming on the go. The magnetic phone clamp is incredibly thin and ultralight, keeping your smartphone secure while in use. Use the magnetic ring holder to snap your smartphone onto OM 4, hold your phone safely, or use it as a kickstand. DJI OM 4 is packed with one-of-a-kind features that ensure truly magnetic content. Speed up fluffy white clouds drifting across an open sky or condense a road trip into a few seconds. Impress your friends with captivating, compact videos. Take advantage of a whole host of creative modes to add more pizazz to your shots. The DJI Mimo app features a video editor that allows you to compose masterpieces on the fly. Built-in tutorials provide guidance so you can focus on creating. At its core, DJI OM 4 was designed to provide unbelievably smooth footage along with countless creative shooting options. Never post a shaky video again. Even with an external lens added, DJI OM 4â€™s powerful motor keeps your smartphone steady and your video smooth. OM 4 directly controls the shutter of most smartphone cameras and has also been specially optimized for certain brands. DJI OM 4 simplifies every situation, creating the most streamlined shooting experience possible. <br></p><div class=\"video-wrapper\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/HX2fIy898mY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></div>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Unfolded: 276×119.6×103.6 mm"},{"key":"Weight","value":"Gimbal: 390 g"},{"key":"Compatibility","value":"230 ± 60 g"}]},{"heading":"Battery","values":[{"key":"Type","value":"18650 Li-ion"},{"key":"Capacity","value":"2450 mAh"},{"key":"Energy","value":"17.64 Wh"},{"key":"Voltage","value":"7.2 V"},{"key":"Charging Temperature","value":"5 to 40 °C (41 to 104 °F)"},{"key":"Operating Temperature","value":"0 to 40 °C (32 to 104 °F)"},{"key":"Operating Time","value":"15 hrs"},{"key":"Charging Time","value":"2.5 hrs"},{"key":"Ports","value":"Gimbal Charging Port: USB-C"},{"key":"Mount","value":"1/4\" Threaded Hole"}]},{"heading":"Gimbal","values":[{"key":"Consumption","value":"1.2 W"},{"key":"Mechanical Range","value":"Pan: -161.2° to 171.95°"},{"key":"Max Controllable Speed","value":"120 °/s"},{"key":"Width of Compatible","value":"Phone: 67-84 mm"},{"key":"Thickness of Compatible","value":"Phone: 6.9-10 mm"},{"key":"Maximum Load","value":"230 ± 60 g"},{"key":"Wireless","value":"Bluetooth Low Energy 5.0"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI OM 4 Gimbal in Bangladesh?","paragraph":"The latest price of DJI OM 4 Gimbal in Bangladesh is 13,800৳. You can buy the DJI OM 4 Gimbal at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4/om-4-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4/om-4-1-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4/om-4-2-500x500.jpg"],"product_seo_title":"DJI OM 4 Portable Phone Gimbal Price in Bangladesh","product_seo_description":"Buy DJI OM 4 Handheld 3 Axis Stable Gimbal for Smartphone Vlogging and YouTube Live Video at best price in Bangladesh. Order online or visit Your nearest Star Tech branch","product_seo_keywords":"DJI OM 4 Handheld 3 Axis Stable Gimbal for Smartphone Vlogging and YouTube Live Video"},{"url":"https://www.startech.com.bd/dji-om-5-gimbal","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-5/om-5-01-228x228.jpg","title":"DJI OM 5 3 Axis Stable Gimbal","product_list_short_description":["DJI Stabilization Technology with 3-Axis Stabilization","1000 mAh Pouch Cell Battery","Built-In Extension Rod, ActiveTrack 4.0","Wireless Mode: Bluetooth Low Energy 5.0"],"price_new":0,"price_old":0,"price_single":14500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"19436","brand":"Dji","product_page_short_description":["MPN: OM5SSW","Model: OM 5","DJI Stabilization Technology with 3-Axis Stabilization","1000 mAh Pouch Cell Battery","Built-In Extension Rod, ActiveTrack 4.0","Wireless Mode: Bluetooth Low Energy 5.0"],"emi_price":1357,"full_description":"<h2 style=\"text-align: justify; \">DJI OM 5 3 Axis Stable Gimbal</h2>\n\n\n\n<p style=\"text-align: justify; \">DJI OM 5 Stable Gimbal supports up to 3.3\" wide smartphones. This is one kind os Magnetic smartphone mount with intelligent sensor. The DJI gimbal comes with Ultracompact, foldable design with redesigned comfort handgrip, High-torque motor, Easy to balance with Controllable range: -161.2 to 172.08Â° pan / -101.46 to 229.54Â° tilt / -127.05 to 208.95Â° roll. This gimbal featured with Bluetooth 5.0 support, Controllable speed: 120Â°/s max, Built-in battery: Up to 6.5-hour runtime / 7.74Wh capacity, 1000mAh, 1/4\"-20 tripod mounting thread, USB Type-C power input. With the joystick controls on the handle, you can also use hand gestures to control the gimbal to track your movement, take a selfie, or start/stop your smartphone camera, so you don't have to press the record button or touch any controls. The OM 5 features Bluetooth 5 control and syncs up. You can set multiple shooting modes and functions, including Sport, Portrait, Underslung, Landscape, Time-Lapse, DynamicZoom (Dolly Zoom), Hyperlapse, Panorama, enhanced \"CloneMe\" Panorama, Slow-Motion, Inception-style spin (SpinShot), and a Sport mode for fast-action shooting with the DJI Mimo app to provide . In this Gimbal, the OM 5 uses pre-set templates to help you create a dynamic video. This gimbal can also automatically track body shapes to track human subjects without the need to make a manual selection with the latest ActiveTrack 4.0. In this Gimbal, the OM 5 uses pre-set templates to help you create a dynamic video. You can record, and re-record these clips. It will then stitch them together and add music for a polished and instantly shareable final product. With this DJI OM 5, you can also record, and re-record these clips. It will then stitch them together and add music. The new DJI OM 5 Stable Gimbal has no warranty.\n</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Gimbal Dimensions:"},{"key":"Weight","value":"Gimbal: 292 g"},{"key":"Compatibility","value":"Smartphone Vlogging and YouTube Live Video"}]},{"heading":"Battery","values":[{"key":"Type","value":"Pouch Cell"},{"key":"Capacity","value":"1000 mAh"},{"key":"Energy","value":"7.74Wh"},{"key":"Voltage","value":"6-8.8 V"},{"key":"Charging Temperature","value":"5° to 40°C (41° to 104°F)"},{"key":"Operating Temperature","value":"0° to 40°C (32° to 104°F)"},{"key":"Operating Time","value":"6.4 hrs (under ideal conditions with the gimbal fully balanced)"},{"key":"Charging Time","value":"1.5 hrs (measured with a 10W charger)"},{"key":"Ports","value":"Gimbal Charging Port: USB-C"},{"key":"Mount","value":"1/4\" Threaded Hole"}]},{"heading":"Gimbal","values":[{"key":"Consumption","value":"1.2 W (under ideal conditions with the gimbal fully balanced)"},{"key":"Mechanical Range","value":"Pan: -161.12° to 172.08°"},{"key":"Width of Compatible","value":"67-84 mm"},{"key":"Thickness of Compatible","value":"6.9-10 mm"},{"key":"Wireless","value":"Bluetooth Low Energy 5.0"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI OM 5 Gimbal in Bangladesh?","paragraph":"The latest price of DJI OM 5 Gimbal in Bangladesh is 14,500৳. You can buy the DJI OM 5 Gimbal at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-5/om-5-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-5/om-5-04-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-5/om-5-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-5/om-5-02-500x500.jpg"],"product_seo_title":"DJI OM 5 3 Axis Stable Gimbal Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI OM 5 3 Axis Stable Gimbal at the best price in Bangladesh. Latest reasonable DJI Gimbal available at Star Tech Shop. Order online, get delivery anywhere in BD.","product_seo_keywords":"DJI OM 5 3 Axis Stable Gimbal"},{"url":"https://www.startech.com.bd/dji-osmo-mobile-6-gimbal","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-6/osmo-mobile-6-03-228x228.webp","title":"DJI Osmo Mobile 6 Foldable Smartphone Gimbal","product_list_short_description":["Portable and Foldable","Gesture Control","ActiveTrack 5.0","Dynamic Zoom"],"price_new":15000,"price_old":16500,"price_single":15000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"25185","brand":"Dji","product_page_short_description":["Model: Osmo Mobile 6","Portable and Foldable","Gesture Control","ActiveTrack 5.0","Dynamic Zoom"],"emi_price":1513,"full_description":"<h2 style=\"text-align: justify; \">The DJI Osmo Mobile 6 Foldable Smartphone Gimbal</h2><p style=\"text-align: justify; \">The DJI Osmo Mobile 6 Foldable Smartphone Gimbal comes with creative features with an intelligent smartphone stabilizer packed. This DJI Gimbal is not only small and simple to fold to fit in your palm, but it also starts up automatically once unfurled to take pictures at a moment's notice. Utilize the built-in extension rod to create dynamic angles and take the ideal selfie. You have access to a plethora of clever tools and advisors. Catch every amazing moment with the DJI Mimo app's quick shooting, editing, and sharing features. The DJI Gimbal has a complete upgrade to ActiveTrack 5.0 allows for more reliable tracking over greater distances. &nbsp;The updated model enables the front camera to follow moving subjects, even those that twist or veer to the side.</p><h3 style=\"text-align: justify;\">3-Axis Stabilization</h3><p style=\"text-align: justify;\">The 3-axis stabilization of the DJI mobile 6<a href=\"https://www.startech.com.bd/gimbal\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\"> gimbal</a> allows for the capture of impressive, lossless, on-the-go masterpieces. Osmo Mobile 6 incorporates DJI's cutting-edge stabilization technology to provide you access to reliable, steady, shake-free results.</p><h3 style=\"text-align: justify;\">Portable and Compact </h3><p style=\"text-align: justify;\">The DJI Osmo Mobile 6 gimbal has a Portable and Compact design. Take your Osmo Mobile 6 along on thrilling excursions. With the quick-release magnetic phone clamp, you can go without the inconvenience of taking your phone cover off thanks to the compact and foldable design. You can quickly shoot or answer a call by just snapping in or out.</p><h3 style=\"text-align: justify;\">Smooth Operator</h3><p style=\"text-align: justify;\">The gimbal comes with a new integrated status panel, you can easily monitor the battery level, and the system status indication, and switch between <a href=\"https://www.startech.com.bd/gimbal\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\">gimbal</a> modes. To choose between the four settings to suit your filming requirements or to add an artistic flair, press the M button. With the redesigned side wheel on Osmo Mobile 6, you can zoom and focus with ease and fluidity. Roll the wheel to change the focal length for versatile composition and buttery smooth zoom in and out. Additionally, you can switch to manual focus by pressing the side wheel once for even more cinematic control.</p><h3 style=\"text-align: justify;\">Built-In Extension Rod</h3><p style=\"text-align: justify;\">The DJI gimbal has an extended feature that Includes everyone in the image. No one has been excluded thanks to the built-in extension. Any shot should have additional people, animals, or stunning scenery. Dynamic selfies should be taken at higher or lower angles. Extend the rod to increase your options for creativity. The switch button twice to convert between landscape and portrait mode.The DJI Osmo Mobile 6 Smartphone Gimbal Has no warranty</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Unfolded: 276×111.5×99 mm (L×W×H)"},{"key":"Weight","value":"Approx. 72 g"},{"key":"Model","value":"Osmo Mobile 6"}]},{"heading":"Battery","values":[{"key":"Type","value":"Li-Po 2S"},{"key":"Capacity","value":"1000 mAh"},{"key":"Energy","value":"7.74 Wh"},{"key":"Charging Temperature","value":"5° to 40° C (41° to 104° F)"},{"key":"Operating Temperature","value":"0° to 40° C (32° to 104° F)"},{"key":"Operating Time","value":"Approx. 6 hours and 24 minutes (measured under ideal conditions with the gimbal fully balanced)"},{"key":"Charging Time","value":"Approx. 1 hour 24 minutes (measured with a 10W Type-C charger)"},{"key":"Ports","value":"USB-C"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan: -161.64° to 173.79°"},{"key":"Max Controllable Speed","value":"120°/s"},{"key":"Width of Compatible","value":"67-84 mm"},{"key":"Thickness of Compatible","value":"6.9-10 mm"},{"key":"Wireless","value":"Bluetooth 5.1"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No warranty"}]}],"latest_price":{"heading":"What is the price of DJI Osmo Mobile 6 Smartphone Gimbal in Bangladesh?","paragraph":"The latest price of DJI Osmo Mobile 6 Smartphone Gimbal in Bangladesh is 15,000৳. You can buy the DJI Osmo Mobile 6 Smartphone Gimbal at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-6/osmo-mobile-6-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-6/osmo-mobile-6-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-6/osmo-mobile-6-02-500x500.webp"],"product_seo_title":"DJI Osmo Mobile 6 Foldable Smartphone Gimbal price in Bangladesh","product_seo_description":"Buy DJI Osmo Mobile 6 Foldable Smartphone Gimbal at the best price in Bangladesh. Latest DJI Gimbal available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"DJI Osmo Mobile 6 Foldable Smartphone Gimbal"},{"url":"https://www.startech.com.bd/dji-ronin-sc-3-axis-camera-gimbal","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/ronin-sc/dji-ronin-sc-3-axis-camera-gimbal-228x228.jpg","title":"DJI Ronin-SC Handheld 3-Axis Camera Gimbal Stabilizer","product_list_short_description":["Mirroless Cameras","Quick record function","Battery Grip Lasts up to 11 Hours","ActiveTrack 3.0","USB Type-C & Bluetooth Control"],"price_new":24000,"price_old":26500,"price_single":24000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"19292","brand":"Dji","product_page_short_description":["Model: Ronin-SC","Mirroless Cameras","Quick record function","Battery Grip Lasts up to 11 Hours","ActiveTrack 3.0","USB Type-C & Bluetooth Control"],"emi_price":2338,"full_description":"<h2>DJI Ronin-SC Handheld 3-Axis Camera Gimbal Stabilizer<br></h2><p> DJI Ronin-SC Handheld 3-Axis Camera Gimbal Stabilizer brings many improvements over its predecessor, the Ronin-S, with this smaller and lighter stabilized, three-axis single-handle gimbal, designed for small mirrorless cameras under 4.4 lb. Ronin-SC was built to go anywhere, Opening possibilities for filmmakers and content creators in almost any situation. Even in action-packed scenes, Ronin-SC gives a perfectly stable shot. Continuous stabilization makes Ronin-SC more effective in fast follows, sudden motions, and even complete changes in direction. The buttons and trigger are easy to reach for every essential control. A flared battery grip makes extended holding easier and slip-resistant, letting you capture moments throughout the day. DJI Ronin App requires iOS 11.0, Android 7.0 or above. This DJI Ronin-SC Handheld 3-Axis Camera Gimbal Stabilizer has no warranty. <br></p>   ","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Folded: 220×200×75 mm"},{"key":"Weight","value":"Gimbal: Approx. 830 g"},{"key":"Model","value":"RB2-2450mAh-7.2V"}]},{"heading":"Battery","values":[{"key":"Type","value":"18650 LiPo"},{"key":"Capacity","value":"2450 mAh"},{"key":"Voltage","value":"7.2 VDC"},{"key":"Charging Temperature","value":"5° to 40°C (41° to 104°F)"},{"key":"Operating Temperature","value":"-20° to 45°C (-4° to 113°F)"},{"key":"Charging Time","value":"2.5 h (5 V/2 A)"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan axis control: 360° continuous rotation"},{"key":"Max Controllable Speed","value":"Pan axis control: 180°/s"},{"key":"Maximum Load","value":"≤ 2.0 kg"},{"key":"Wireless","value":"Bluetooth 5.0"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI Ronin-SC Camera Stabilizer in Bangladesh?","paragraph":"The latest price of DJI Ronin-SC Camera Stabilizer in Bangladesh is 24,000৳. You can buy the DJI Ronin-SC Camera Stabilizer at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/ronin-sc/dji-ronin-sc-3-axis-camera-gimbal-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/ronin-sc/dji-ronin-sc-3-axis-camera-gimbal-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/ronin-sc/dji-ronin-sc-3-axis-camera-gimbal-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/ronin-sc/dji-ronin-sc-3-axis-camera-gimbal-03-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/ronin-sc/dji-ronin-sc-3-axis-camera-gimbal-04-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/ronin-sc/dji-ronin-sc-3-axis-camera-gimbal-05-500x500.jpg"],"product_seo_title":"DJI Ronin-SC Handheld 3-Axis Gimbal Stabilizer Price in Bangladesh","product_seo_description":"Buy DJI Ronin-SC Handheld 3-Axis Gimbal Stabilizer at best price in Bangladesh. Best DJI Gimbal Stabilizer available at Star Tech Shop. Order Online & get delivery in BD","product_seo_keywords":"DJI Ronin-SC Handheld 3-Axis Camera Gimbal Stabilizer"},{"url":"https://www.startech.com.bd/dji-rsc-2-3-axis-gimbal-stabilizer","img":"https://www.startech.com.bd/image/cache/catalog/camera/action/dji/rsc-2/rsc-2-01-228x228.jpg","title":"DJI RSC 2 3-Axis Gimbal Stabilizer","product_list_short_description":["1'' OLED Screen, Foldable Design","1.2kg Weight / 3kg Tested Payload","Max 14hr Fast-Charge Batteries","Titan Stabilization Algorithm"],"price_new":37500,"price_old":39000,"price_single":37500,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"21891","brand":"Dji","product_page_short_description":["Model: RSC 2","1'' OLED Screen, Foldable Design","1.2kg Weight / 3kg Tested Payload","Max 14hr Fast-Charge Batteries","Titan Stabilization Algorithm"],"emi_price":3458,"full_description":"<h2 style=\"text-align: justify; \">DJI RSC 2 3-Axis Gimbal Stabilizer</h2><p style=\"text-align: justify; \">The DJI RSC 2 3-Axis Gimbal Stabilizer is intended for mirrorless and DSLR cameras and can manage the camera and accessory weights of up to 3kg. The motors in the RSC 2 are 50% more powerful than those in the Ronin-SC, which is the gimbal's predecessor. The RSC 2 has a folding construction that allows it to be used in underslung mode.</p><h3 style=\"text-align: justify; \">Integrated grip handle with built-in 14-hour batteries</h3><p style=\"text-align: justify; \">The gimbal head folds down from the gimbal handle, allowing you to utilize the gimbal underslung for low-angle pictures without having to connect or detach anything. The gimbal handle stays integrated and features built-in batteries with a runtime of up to 14 hours. Furthermore, the batteries may be charged via the handle while the gimbal is in use (unless in extremely hot/cold climates). The handle supports the PD and QC 2.0 fast-charging protocols and can be recharged in around two hours using an 18W fast charger, which is not supplied. The gimbal's folding form makes it easy to travel and store.</p><h3 style=\"text-align: justify; \">1\" OLED black-and-white display</h3><p style=\"text-align: justify; \">The RSC 2 also incorporates a 1\" OLED black-and-white screen and a horizontal dial on the front for adjusting focus with the same hand that holds the gimbal. A NATO mount with M4 threads is located on either side of the gimbal handle for adding specific accessories such as an optional suitcase handle.</p><h3 style=\"text-align: justify; \">DJI Titan stabilization algorithm</h3><p style=\"text-align: justify; \">The DJI Titan stabilization algorithm is used by the RSC 2, which is an enhanced version of their previous one that gives superior stability and fluidity. When dealing with up to 100mm zoom lenses, the algorithm is supplemented with a built-in function dubbed SuperSmooth. To provide smooth motion with long lenses, SuperSmooth adjusts for micromovements and boosts torque.</p><h3 style=\"text-align: justify; \">iOS 11+/Android 7.0+ companion app &amp; Creative Functions Such as Roll 360</h3> <p style=\"text-align: justify; \">The gimbal is equipped with a dual-layer Manfrotto plus Arca-Swiss camera mounting system and two detachable fast-release plates. A single button press puts your camera in portrait mode for social media material. The RSC 2 has six possible setups and comes with an iOS/Android app that gives you access to functions like time-lapse, panoramic, and Roll 360, which spins your camera constantly along the roll axis. The gimbal also works with the optional DJI RavenEye transmission device, which enables remote 1080p video transmission, ActiveTrack 3.0 subject tracking from the gimbal, and other features.</p><p style=\"text-align: justify; \">The RSC 2 comes with a tiny tripod that attaches to a 1/4\"-20 thread on the bottom of the grip handle and may be used as a stand or an extension handle for two-handed gimbal manipulation for specific shots. Camera control cables are also supplied, allowing specific cameras and functionalities to be controlled directly from the gimbal controls. It has no warranty.</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"15.7 x 7.3 x 6.9\" / 40 x 18.5 x 17.5 cm"},{"key":"Weight","value":"2.681 lb / 1.216 kg (without Battery)"}]},{"heading":"Battery","values":[{"key":"Type","value":"2 x 18650"},{"key":"Capacity","value":"3400 mAh"},{"key":"Operating Temperature","value":"-4 to 113°F / -20 to 45°C"}]},{"heading":"Gimbal","values":[{"key":"Maximum Load","value":"3 kg"},{"key":"Wireless","value":"Wireless Frequency 2.4 GHz (2.4 - 2.483)"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI RSC 2 3-Axis Gimbal Stabilizer in Bangladesh?","paragraph":"The latest price of DJI RSC 2 3-Axis Gimbal Stabilizer in Bangladesh is 37,500৳. You can buy the DJI RSC 2 3-Axis Gimbal Stabilizer at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/camera/action/dji/rsc-2/rsc-2-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/rsc-2/rsc-2-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/camera/action/dji/rsc-2/rsc-2-03-500x500.jpg"],"product_seo_title":"DJI RSC 2 3-Axis Gimbal Stabilizer Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI RSC 2 3-Axis Gimbal Stabilizer at the best price in Bangladesh. Latest DJI Gimbal is available at Star Tech Shop. Order online to get delivery anywhere in BD.","product_seo_keywords":"DJI RSC 2 3-Axis Gimbal Stabilizer"},{"url":"https://www.startech.com.bd/dji-rs-3-gimbal-stabilizer","img":"https://www.startech.com.bd/image/cache/catalog/drones/dji/rs-3/rs-3--01-228x228.webp","title":"DJI RS 3 Gimbal Stabilizer","product_list_short_description":["1.8\" Full-Color OLED Touchscreen","12h Max Battery Life","3kg (6.6lbs) Tested Payload","3rd-Gen RS Stabilization Algorithm"],"price_new":41000,"price_old":45000,"price_single":41000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"In Stock","code":"29932","brand":"Dji","product_page_short_description":["Model: RS 3","1.8\" Full-Color OLED Touchscreen","12h Max Battery Life","3kg (6.6lbs) Tested Payload","3rd-Gen RS Stabilization Algorithm"],"emi_price":4042,"full_description":"<h2>DJI RS 3 Gimbal Stabilizer</h2><p style=\"text-align: justify; \">The DJI RS 3 Gimbal Stabilizer is a cutting-edge camera accessory designed to provide smooth and stable footage for professional filmmakers and videographers. Boasting a lightweight design, the gimbal is highly portable and easy to carry around, making it an excellent choice for on-the-go shooting. The DJI RS 3 is its impressive 3kg payload capacity, which allows it to support popular camera models like the Sony a7S III and Canon R5. This high payload capacity ensures that filmmakers can mount their preferred cameras with ease and capture high-quality footage without any worries about stability. Navigating through the gimbal's settings and functions is made effortless with the inclusion of an advanced 1.8\" OLED touchscreen. Users can easily access various controls and settings, facilitating quick adjustments and mode switching on the fly. The Instant Mode Switching feature is particularly handy for filmmakers who need to adapt swiftly to different shooting scenarios. With a simple tap or click, the gimbal can switch between various modes, ensuring that users can capture the perfect shot without any delays. For seamless and convenient transmission of images and footage, the DJI RS 3 supports a wireless image transmitter. This feature enables filmmakers to review their shots in real-time on a connected device, providing instant feedback and enhancing the overall shooting experience. The gimbal offers motion control functionality when paired with a smartphone. This allows users to execute precise camera movements remotely, offering creative possibilities and dynamic shots without the need for complex rigging or additional equipment. Filmmakers will appreciate the extended 12-hour operation time of the DJI RS 3, ensuring that they can capture all the desired footage throughout their shooting sessions. The PD fast charging capability further minimizes downtime and keeps users ready for action. Fine-tuning the gimbal's performance is made easier with the inclusion of a dedicated knob on the tilt axis. This fine-tuning option allows users to adjust the gimbal's tilt angle with precision, ensuring optimal balance and stability for different camera setups. It also offers creative functions such as \"Time Tunnel,\" adding an artistic touch to the footage. This feature creates captivating visual effects that can elevate the overall production value of the videos. The DJI RS 3 Gimbal Stabilizer is a feature-packed and versatile tool that empowers filmmakers and videographers to unleash their creativity and capture stunning, stable footage with ease. Its lightweight design, high payload capacity, advanced controls, and creative functions make it a valuable addition to any filmmaker's toolkit.</p><h2><span style=\"text-align: justify; color: inherit; font-family: inherit;\">Buy </span><span style=\"text-align: justify; color: inherit; font-family: inherit;\">DJI RS 3 Gimbal Stabilizer </span><span style=\"text-align: justify; color: inherit; font-family: inherit;\">from Star Tech</span><br></h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/dji-rs-3-gimbal-stabilizer\" target=\"\">DJI RS 3 Gimbal Stabilizer Combo</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/dji-gimbal\" target=\"\">DJI Gimbal</a> to purchase for your <a href=\"https://www.startech.com.bd/mobile-phone\" target=\"\">mobile phone</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The DJI RS 3 Gimbal Stabilizer Combo comes with no warranty.</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Folded: 254×230×68 mm (L×W×H, excluding camera, grip, and the Extended Grip/Tripod)"},{"key":"Weight","value":"Gimbal: Approx. 990 g (2.18 lbs)"},{"key":"Model","value":"BHX711-3000-7.2V"}]},{"heading":"Battery","values":[{"key":"Type","value":"2S"},{"key":"Capacity","value":"3000 mAh"},{"key":"Energy","value":"17.64 Wh"},{"key":"Voltage","value":"7.2 VDC"},{"key":"Charging Temperature","value":"5° to 40°C (41° to 104°F)"},{"key":"Operating Temperature","value":"-10° to 45° C (14° to 113° F)"},{"key":"Operating Time","value":"10 hours"},{"key":"Charging Time","value":"Approx. 2.5 hours"},{"key":"Ports","value":"USB-C Charging Port"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan Axis: 360° continuous rotation"},{"key":"Max Controllable Speed","value":"Pan: 360°/s"},{"key":"Maximum Load","value":"0.4-2 kg (0.8-4.4 lbs)"},{"key":"Wireless","value":"Bluetooth 5.1"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI RS 3 Gimbal Stabilizer in Bangladesh?","paragraph":"The latest price of DJI RS 3 Gimbal Stabilizer in Bangladesh is 41,000৳. You can buy the DJI RS 3 Gimbal Stabilizer at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/drones/dji/rs-3/rs-3--01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/drones/dji/rs-3/rs-3-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/drones/dji/rs-3/rs-3-03-500x500.webp"],"product_seo_title":"DJI RS 3 Gimbal Stabilizer Combo Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI RS 3 Gimbal Stabilizer Combo at best price in Bangladesh. Latest DJI RS 3 Gimbal Stabilizer Combo available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"DJI RS 3 Gimbal Stabilizer Combo"},{"url":"https://www.startech.com.bd/dji-osmo-mobile-3-gimbal","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-3/osmo-mobile-3-1-228x228.jpg","title":"DJI Osmo Mobile 3 Foldable Mobile Gimbal Combo","product_list_short_description":["Foldable & Portable","Gesture Control","ActiveTrack 3.0","Sport Mode"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"Out Of Stock","code":"14868","brand":"Dji","product_page_short_description":["Model: DJI Osmo Mobile 3","Foldable & Portable","Gesture Control","ActiveTrack 3.0","Sport Mode"],"emi_price":0,"full_description":"<h2>DJI Osmo Mobile 3 Foldable Mobile Gimbal Combo<br></h2><p>With a 3-axis gimbal that effectively reduces shaky footage, Osmo Mobile 3 delivers a super-smooth, stabilized image. A lightweight, ultra-responsive design reacts to your movements in real time, letting you focus more on the moment at hand. A sleek, foldable design allows Osmo Mobile 3 to be taken anywhere. Weighing just 405 g, it is portable, light, and incredibly convenient to toss in a backpack for your next adventure. Standby mode allows you to use your smartphone when the gimbal is folded, enabling you to start shooting again in no time. Thanks to its intelligent design, Osmo Mobile 3 can be held for long periods of time. A comfortable grip fits perfectly in your palm, enabling you to create without limitations. From the extraordinary to the everyday, share your unique moment easily and creatively with Story mode. Story mode provides multiple templates that transform your footage in seconds by automatically adding movement, music, and other effects for a polished result. After customizing your video with a variety of music templates, transition effects, and filters, share your work easily on social media and video platforms. A simple gesture is all it takes to snap a selfie or begin recording. Both the front and rear camera can recognize Gesture Control, which makes shooting your solo travels and group shots a walk in the park. To capture scenes that require fast movement, simply press the trigger, make a gesture, or select a subject on your smartphone to start tracking. ActiveTrack 3.0 incorporates deep learning and computer vision algorithms, resulting in smooth and reliable tracking technology. The powerful combination of electronic image stabilization (EIS) and gimbal stabilization is perfect for shooting Hyperlapse videos. Enable ActiveTrack 3.0 for a truly unique Hyperlapse creation that tracks your subject while recording. Condense time and movement for stunning results. Convenient buttons and intuitive functions make Osmo Mobile 3 easy to use with just one hand, providing more versatility and freedom of movement. Say goodbye to time-consuming steps. Osmo Mobile 3 is able to shoot from any angle with the M button and trigger. Explore useful functions like Quick Roll, which allows you to transition from portrait to landscape mode. Enable most operations with a single hand thanks to the joystick, intuitive button combinations, and access to the Quick Menu. Dolly Zoom is a fantastic way to add an extra touch of cinematic flair to your footage. Thanks to a zoom slider that allows customizable speed, you can now recreate the famous â€œHitchcock effectâ€� with your mobile device. Sport mode has been redesigned with fully optimized algorithms that let Osmo Mobile 3 easily capture fast-paced action. From the dynamic movements of a basketball game to your dog chasing a squirrel, never miss a moment. For a complete filmmaking experience, use Osmo Mobile 3 with the DJI Mimo app. Complete with helpful tutorials, convenient templates, and intelligent modes, DJI Mimo allows you to explore more functions and push your creativity. <br></p><div class=\"video-wrapper\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Xah7LpZpFY0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></div>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Unfolded: 285 × 125 × 103 mm"},{"key":"Weight","value":"405 g"},{"key":"Model","value":"OF100"},{"key":"Compatibility","value":"Phone:"}]},{"heading":"Battery","values":[{"key":"Type","value":"18650 Li-ion"},{"key":"Capacity","value":"2450 mAh"},{"key":"Energy","value":"17.64 Wh"},{"key":"Voltage","value":"7.2 V"},{"key":"Charging Temperature","value":"5 - 40 ℃ (41 to 104 °F)"},{"key":"Operating Temperature","value":"0 - 40 ℃ (32 to 104 °F)"},{"key":"Operating Time","value":"15 hrs"},{"key":"Charging Time","value":"2.5 hrs"}]},{"heading":"Gimbal","values":[{"key":"Consumption","value":"1.2 W"},{"key":"Mechanical Range","value":"Pan: -162.5° to 170.3°"},{"key":"Max Controllable Speed","value":"120°/s"},{"key":"Width of Compatible","value":"62 - 88 mm"},{"key":"Thickness of Compatible","value":"≤ 9.5mm"},{"key":"Maximum Load","value":"200 ± 30g"},{"key":"Wireless","value":"Bluetooth Low Energy 5.0"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI Osmo Mobile 3 Gimbal in Bangladesh?","paragraph":"The latest price of DJI Osmo Mobile 3 Gimbal in Bangladesh is 9,999৳. You can buy the DJI Osmo Mobile 3 Gimbal at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-3/osmo-mobile-3-1-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-3/osmo-mobile-3-2-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-3/osmo-mobile-3-3-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/osmo-mobile-3/osmo-mobile-3-500x500.jpg"],"product_seo_title":"DJI Osmo Mobile 3 Gimbal Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI Osmo Mobile 3 Foldable Mobile Gimbal Combo at best price in Bangladesh. Order online or visit your nearest Star Tech branch","product_seo_keywords":"DJI Osmo Mobile 3 Foldable Mobile Gimbal Combo"},{"url":"https://www.startech.com.bd/dji-om-4-combo","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4-combo/om-4-combo-01-228x228.jpg","title":"DJI OM 4 Combo","product_list_short_description":["Magnetic Ring Holder, Wrist Strap","DJI OM 4, DJI Sling Pouch","Magnetic Phone Clamp","Grip Tripod, Storage Pouch"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"Out Of Stock","code":"20034","brand":"Dji","product_page_short_description":["Model: OM 4 Combo","Magnetic Ring Holder, Wrist Strap","DJI OM 4, DJI Sling Pouch","Magnetic Phone Clamp","Grip Tripod, Storage Pouch"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">DJI OM 4 Combo</h2><p style=\"text-align: justify; \">The new DJI OM 4 Combo comes with DJI Sling Pouch and Grip, Tripod Handheld 3-Axis Smartphone Gimbal, DJI OM 4 Ã— 1, DJI Sling PouchÃ— 1, Magnetic Ring Holder Ã— 1, Magnetic Phone Clamp Ã— 1, Grip Tripod Ã— 1, Power Cable Ã— 1, Storage Pouch Ã— 1, Wrist Strap Ã— 1 and Manuals Ã— 1. Here the battery featured with 18650 Li-ion, Capacity:2450 mAh, Energy:17.64 Wh, Voltage:7.2 V, Charging Temperature:5 to 40 Â°C (41 to 104 Â°F), Operating Temperature:0 to 40 Â°C (32 to 104 Â°F), Operating Time:15 hrs (Under ideal conditions with the gimbal fully balanced.). Its take Charging Time:2.5 hrs (Measured with a 10W charger.). In this Combo, it has USB-C Gimbal Charging Port, External Device Charging Port:USB-A, and Universal Mount:1/4â€³ Threaded Hole. In this combo Gimbal is featured with Consumption:1.2 W (Under ideal conditions with the gimbal fully balanced.), Mechanical Range:Pan: -161.2Â° to 171.95Â° ;Roll: â€“ 136.7Â° to 198Â° ;Tilt:- 106.54Â° to 235.5Â° with Max Control Speed:120 Â°/s. You can  capture with smooth video. DJI OM 4  is a foldable stabilizer designed to complement your smartphone,  and also it allows you to start recording right away. Magnetic, ultra-compact, and  bursting with easy-to-use features. The Full DJI OM 4 Combo has no warranty.</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Unfolded: 276×119.6×103.6 mm"},{"key":"Weight","value":"Gimbal: 390 g"}]},{"heading":"Battery","values":[{"key":"Type","value":"18650 Li-ion"},{"key":"Capacity","value":"2450 mAh"},{"key":"Energy","value":"17.64 Wh"},{"key":"Voltage","value":"7.2 V"},{"key":"Charging Temperature","value":"5 to 40 °C (41 to 104 °F)"},{"key":"Operating Temperature","value":"0 to 40 °C (32 to 104 °F)"},{"key":"Operating Time","value":"15 hrs"},{"key":"Charging Time","value":"2.5 hrs"},{"key":"Ports","value":"Gimbal Charging Port: USB-C"},{"key":"Mount","value":"1/4\" Threaded Hole"}]},{"heading":"Gimbal","values":[{"key":"Consumption","value":"1.2 W (Under ideal conditions with the gimbal fully balanced.)"},{"key":"Mechanical Range","value":"Pan: -161.2° to 171.95°"},{"key":"Max Controllable Speed","value":"120 °/s"},{"key":"Width of Compatible","value":"Phone: 67-84 mm"},{"key":"Thickness of Compatible","value":"Phone: 6.9-10 mm"},{"key":"Maximum Load","value":"230 ± 60 g"},{"key":"Wireless","value":"Bluetooth Low Energy 5.0"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI OM 4 Combo in Bangladesh?","paragraph":"The latest price of DJI OM 4 Combo in Bangladesh is 14,500৳. You can buy the DJI OM 4 Combo at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4-combo/om-4-combo-01-500x500.jpg"],"product_seo_title":"DJI OM 4 Combo Price in Bangladesh Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI OM 4 Combo at the best price in Bangladesh. Latest Reasonable DJI Osmo Mobile 4 Combo available at Star Tech Shop. Order online to get delivery anywhere in BD.","product_seo_keywords":"DJI OM 4 Combo\nDJI Osmo Mobile 4 Combo"},{"url":"https://www.startech.com.bd/dji-rs-2-gimbal-stabilizer-pro","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-2/dji-rs-2-gimbal-stabilizer-228x228.jpg","title":"DJI RS 2 Gimbal Stabilizer Pro Combo","product_list_short_description":["Standard & Portrait Modes","DJI Stabilization Evolved","Payload 10 lb","1950 mAh Battery"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"Out Of Stock","code":"19319","brand":"Dji","product_page_short_description":["Model: RS 2","Standard & Portrait Modes","DJI Stabilization Evolved","Payload 10 lb","1950 mAh Battery"],"emi_price":0,"full_description":"<h2>DJI RS 2 Gimbal Stabilizer Pro Combo<br></h2><p>DJI RS 2 Gimbal Stabilizer Pro Combo is a redesigned follow-up to the Ronin-S gimbal with a payload of up to 10 lb. It's about 25% lighter and more compact thanks to monocoque carbon fiber axis arms and a shorter grip handle with a smaller battery cartridge, although still with a 12-hour runtime. The motors are about 20% more powerful and support cameras such as the Blackmagic Pocket 6K, Canon 1D X Mark III, Sony a7S III, and ALEXA Mini LF. The RS 2 also has a 1.4\" full-color LCD touchscreen that allows you to access gimbal settings as well as features such as time-lapse and hyperlapse, which were previously accessible only via the companion mobile app. The RS 2 uses the DJI Titan stabilization algorithm to provide improved stabilization with increased smoothness. In applications with up to 100mm zoom lenses, a built-in feature called SuperSmooth complements the algorithm by compensating for micromovements and increasing torque to achieve fluid motion (an optional lens support is required). The RS 2 comes with a splash-proof carry case designed with dedicated compartments for the different parts of the gimbal and key accessories. A mini tripod is also included and attaches to a 1/4\"-20 thread on the bottom of the grip handle to function as a stand or an extension handle for two-handed maneuvering of the gimbal in certain scenarios. This DJI RS 2 Gimbal Stabilizer Pro Combo has no warranty. <br></p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Folded: 260×265×70 mm (excluding the BG30 grip)"},{"key":"Weight","value":"Gimbal: Approx. 960 g (2.12 lbs) (excluding the Quick-Release Plates and Camera Mounting Plate)"},{"key":"Model","value":"BG30-1950mAh-15.4V"}]},{"heading":"Battery","values":[{"key":"Type","value":"LiPo 4S"},{"key":"Capacity","value":"1950 mAh"},{"key":"Voltage","value":"15.4V"},{"key":"Charging Temperature","value":"5°C to 40°C"},{"key":"Operating Temperature","value":"-20° to 45° C (-4° to 113° F)"},{"key":"Operating Time","value":"12 h"},{"key":"Charging Time","value":"1.5 h (24W USB adapter using the QC 2.0 or PD protocol)"}]},{"heading":"Gimbal","values":[{"key":"Mechanical Range","value":"Pan axis control: 360° continuous rotation"},{"key":"Max Controllable Speed","value":"Pan: 360°/s"},{"key":"Maximum Load","value":"4.5 kg (10.0 lbs)"},{"key":"Wireless","value":"Bluetooth 5.0"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]}],"latest_price":{"heading":"What is the price of DJI RS 2 Gimbal Stabilizer in Bangladesh?","paragraph":"The latest price of DJI RS 2 Gimbal Stabilizer in Bangladesh is 70,000৳. You can buy the DJI RS 2 Gimbal Stabilizer at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-2/dji-rs-2-gimbal-stabilizer-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-2/dji-rs-2-gimbal-stabilizer-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-2/dji-rs-2-gimbal-stabilizer-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/rs-2/dji-rs-2-gimbal-stabilizer-03-500x500.jpg"],"product_seo_title":"DJI RS 2 Gimbal Stabilizer Pro Combo Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI RS 2 Gimbal Stabilizer Pro Combo at Best price in BD. Best DJI RS 2 Gimbal Stabilizer Pro available at Star Tech Online Shop. Order online & get delivery in BD","product_seo_keywords":"DJI RS 2 Gimbal Stabilizer Pro Combo"},{"url":"https://www.startech.com.bd/dji-om-4-se-gimbal","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4-se/om-4-se-01-228x228.jpg","title":"DJI OM 4 SE 3 Axis Stable Gimbal","product_list_short_description":["Perfect for Smartphone Vlogging & YouTube Video","3-Axis Stabilization, Dynamic Zoom","Gesture Control, ActiveTrack 3.0","Intelligent Shooting Modes"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"DJI Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy DJI Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"","status":"Out Of Stock","code":"19435","brand":"Dji","product_page_short_description":["Model: OM 4 SE","Perfect for Smartphone Vlogging & YouTube Video","3-Axis Stabilization, Dynamic Zoom","Gesture Control, ActiveTrack 3.0","Intelligent Shooting Modes"],"emi_price":0,"full_description":"<h2>DJI OM 4 SE 3 Axis Stable Gimbal</h2>\n\n<p>DJI OM 4 SE 3 Axis Stable Gimbal 2 enables effortless capture whenever inspiration strikes. This DJI Gimbal comes with 3-Axis Stabilization. DJI OM 4 SEâ€™s powerful 3-axis motor keeps your smartphone steady and your video smooth with an external lens added, This Gimble featured with DynamicZoom. It is one of the perfect choice for Vlogging. With the â€œHitchcock effect,â€� a creative zoom shot that delivers a Hollywood feel with minimal effort. Advanced algorithms know what to do, so all you have to do is tap and walk. In this DJI Gimble, ActiveTrack 3.0 makes following subjects a walk in the park. The latest DJI OM 4 SE Gimbal has no warranty.\n</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"16.3 x 9.9 x 4.6 Centimeters"},{"key":"Weight","value":"424 Grams"},{"key":"Compatibility","value":"Smartphone"}]},{"heading":"Gimbal","values":[{"key":"Thickness of Compatible","value":"6.9 to 10 mm (mobile phones)"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No Warranty"}]},{"heading":"Camera","values":[{"key":"Sensor","value":"Flashlight Mode"},{"key":"Lens","value":"external"}]}],"latest_price":{"heading":"What is the price of DJI OM 4 SE Gimbal in Bangladesh?","paragraph":"The latest price of DJI OM 4 SE Gimbal in Bangladesh is 12,900৳. You can buy the DJI OM 4 SE Gimbal at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4-se/om-4-se-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4-se/om-4-se-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4-se/om-4-se-04-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/dji/om-4-se/om-4-se-03-500x500.jpg"],"product_seo_title":"DJI OM 4 SE 3 Axis Stable Gimbal Price in Bangladesh | Star Tech","product_seo_description":"Buy DJI OM 4 SE 3 Axis Stable Gimbal at the best price in Bangladesh. Latest reasonable DJI Gimbal available at Star Tech Shop. Order online, get delivery anywhere in BD.","product_seo_keywords":"DJI OM 4 SE 3 Axis Stable Gimbal"}]