[{"url":"https://www.startech.com.bd/xinji-cobee-ca1-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-ca1/cobee-ca1-03-228x228.webp","title":"XINJI COBEE CA1 1.96\" Curved Waterproof Smart Watch","product_list_short_description":["1.96-inch AMOLED Large Display","3D Curved Surface","Extended Battery Life","IP68 Waterproof"],"price_new":4650,"price_old":6190,"price_single":4650,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"In Stock","code":"34773","brand":"XINJI","product_page_short_description":["Model: COBEE CA1","1.96-inch AMOLED Large Display","3D Curved Surface","Extended Battery Life","IP68 Waterproof"],"emi_price":567,"full_description":"<h2>XINJI COBEE CA1 1.96\" Curved Waterproof  Smart Watch</h2><p>The XINJI COBEE CA1 1.96\" Curved Smart Watch is a clever combination of appearance and functionality designed to improve your everyday life. Its huge 1.96-inch display has high-definition quality, providing sharp and bright graphics for an immersive experience. The 3D curved surface adds elegance while also improving usage by smoothly merging with the wrist. The CA1 is encased in a robust titanium aluminum alloy body that is designed to endure regular wear and tear. Explore over 100 sports modes that have been rigorously designed using exact algorithm testing to suit to your different preferences and activities with unrivaled precision. Stay in control of your fitness path with complete health monitoring driven by high-performance body recognition sensors, offering real-time insights on your activity levels and essential vital signs. With a longer battery life, the CA1 keeps up with your busy lifestyle, allowing for continuous use throughout the day. With over 100 online changeable watch faces, you can easily express yourself and personalize your watch to match your mood and style. The liquid silicone comfort strap gives a gentle and tight fit, allowing for all-day usage without discomfort. Furthermore, with an IP68 waterproof rating, the CA1 provides piece of mind, allowing you to securely use it in all weather or during water-related activities. The XINJI COBEE CA1 Curved Smart Watch combines refinement and utility to provide a genuinely immersive wearable experience. </p><h3>1.96\" Super Retina AMOLED Display</h3><p>1.96\" Super Retina AMOLED Display of XINJI <strong>COBEE CA1</strong>, 410×502 High Resolution. The large 1.96-inch display provides clarity like never before, with high-definition quality that brings your entertainment to life with beautiful images.</p><h3>3D Curved Surface </h3><p> The XINJI COBEE CA1 smartwatch's 3D curved surface adds sophistication while also ensuring a comfortable fit on your wrist, improving both style and wearability. With over 100 sports modes evaluated using exact algorithms, this XINJI COBEE CA1 smart watch enables you to follow your interests while providing accurate monitoring and insights for a healthy lifestyle.</p><h3100+ sports=\"\" modes=\"\" with=\"\" precise=\"\" algorithm<=\"\" h3=\"\"><h3>Health Monitoring </h3><p>Featuring high-performance body recognition sensors. With high-performance body recognition sensors, this <strong>COBEE CA1</strong> watch delivers complete health monitoring, allowing you to keep track of your well-being and fitness progress.</p><h3>IP68 Waterproof</h3><p>Whether you're swimming or caught in the rain, the IP68 waterproof rating protects your COBEE CA1 smartwatch and makes it appropriate for a wide range of situations and weather conditions. (Note: diving. Showers in hot water and saunas are not suggested.</p><h2>Buy XINJI COBEE CA1 1.96\" Curved Waterproof  Smart Watch from Star Tech</h2><p style=\"text-align: justify; \">In Bangladesh, you can get original <span style=\"font-weight: bold;\">XINJI </span><span style=\"font-weight: 700;\">COBEE&nbsp;</span><span style=\"font-weight: bold;\">CA1 1.96\" Curved Waterproof Smart Watch&nbsp;</span> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI COBEE CA1 1.96\" Curved Waterproof  Smart Watch comes with 1 year of warranty.</p></h3100+>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.96-inch AMOLED Large Display With High-Definition Resolution"},{"key":"Battery","value":"300 mAh"},{"key":"Connectivity","value":"BT5.2+BLE3.0"},{"key":"Material","value":"Durable Titanium Aluminum Alloy Body"},{"key":"OS","value":"Android 6.0+ and above. IOS 12.0+ and above"},{"key":"SpecialFeatures","value":"IP68 Waterproof"},{"key":"Sensor","value":"Health Monitoring With High-Performance Body Recognition Sensors"},{"key":"Others","value":"100+ Sports Modes With Precise Algorithm Testing For Your Passions"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"47x41x11.6mm"},{"key":"Weight","value":"34.7g"},{"key":"Color","value":"Black- XINCOBCA1BL"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of XINJI COBEE CA1 1.96\" Curved Waterproof Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI COBEE CA1 1.96\" Curved Waterproof Smart Watch in Bangladesh is 4,650৳. You can buy the XINJI COBEE CA1 1.96\" Curved Waterproof Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-ca1/cobee-ca1-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-ca1/cobee-ca1-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-ca1/cobee-ca1-02-500x500.webp"],"product_seo_title":"XINJI COBEE CA1 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy XINJI COBEE CA1 Smart Watch at best price in Bangladesh. Latest XINJI COBEE CA1 1.96\" Curved Waterproof  Smart Watch available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"XINJI COBEE CA1 1.96\" Curved Waterproof  Smart Watch"},{"url":"https://www.startech.com.bd/xinji-pagt-g2-plus-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/pagt-g2-plus/pagt-g2-plus-03-228x228.webp","title":"XINJI PAGT G2 PLUS Bluetooth Calling Lady Smart Watch","product_list_short_description":["1.3-inch AMOLED Super Retina Blue Light Screen","One-tap Pair HD BT Call","IP68 Waterproof Performance","Luxurious Diamond Decoration"],"price_new":0,"price_old":0,"price_single":5490,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"In Stock","code":"35158","brand":"XINJI","product_page_short_description":["Model: PAGT G2 PLUS","1.3-inch AMOLED Super Retina Blue Light Screen","One-tap Pair HD BT Call","IP68 Waterproof Performance","Luxurious Diamond Decoration"],"emi_price":491,"full_description":"<h2>XINJI PAGT G2 PLUS Bluetooth Calling Lady Smart Watch</h2><p>The XINJI <strong>PAGT G2 PLUS</strong> is a full-featured Lady&nbsp;<a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">smartwatch </a>that flawlessly blends appearance and practicality. At its core is a dazzling 1.3-inch AMOLED Super Retina Blue Light Screen, which provides sharp and vivid images that make information and notifications simple to see even in strong sunshine. This high-quality display provides an excellent viewing experience, whether you're checking the time, tracking your health, or browsing through alerts. One of the notable features of the XINJI PAGT G2 PLUS is its one-touch pair HD BT call functionality, which allows you to make and receive calls straight from your wrist with a single tap. This function improves ease and connectivity, allowing you to stay connected without reaching for your smartphone. This PAGT G2 PLUS Lady smart watch prioritizes durability and adaptability, as indicated by its IP68 water resistance rating. This means it can endure immersion in water up to 1.5 meters deep for up to 30 minutes, allowing you to swim, wash, and do other water-related activities with confidence. The XINJI PAGT G2 PLUS adds an elegant touch to its design with exquisite diamond embellishment around the watch face, boosting its visual appeal and making it a fashionable accessory for any outfit or event. This lady watch prioritizes safety by including an SOS emergency function that allows you to rapidly communicate your position and a distress message to specified contacts in the event of an emergency, giving you peace of mind wherever you go. For on-the-go amusement, the XINJI PAGT G2 PLUS has mini-games that allow you to relax and have fun anytime you need a break from your regular routine. Last but not least, its skin-friendly soft strap is kind on the skin and provides a comfortable fit throughout the day, making it excellent for long-term usage. The XINJI PAGT G2 PLUS 1.3\" AMOLED Smart Watch provides an appealing combination of beauty, functionality, and convenience. Its brilliant display, one-tap HD BT call, IP68 waterproof certification, luxury design, SOS emergency function, mini-games, and comfortable strap make it an ideal companion for everyday usage, keeping you connected, engaged, and secure wherever you go.</p><img src=\"https://www.startech.com.bd/image/catalog/smart-watch/xinji/pagt-g2-plus/pagt-g2-plus-001.webp\" alt=\"XINJI PAGT G2 PLUS Bluetooth Calling Lady Smart Watch\" width=\"920\" height=\"450\"><h3>1.2\" Super Retina AMOLED Display</h3><p>The XINJI <strong>PAGT G2 PLUS</strong> has a 1.2\" Super Retina AMOLED display with a high resolution of 360×360. The big 1.96-inch display delivers unprecedented clarity and high-definition resolution, bringing your entertainment to life with stunning graphics.</p><h3>IP68 Waterproof</h3><p>Whether you're swimming or caught in the rain, the IP68 waterproof rating protects your PAGT G2 PLUS smartwatch and makes it suitable for a variety of scenarios and weather conditions. (Note: Diving, Showering in hot water and saunas are not recommended.)</p><img src=\"https://www.startech.com.bd/image/catalog/smart-watch/xinji/pagt-g2-plus/pagt-g2-plus-002.webp\" alt=\"XINJI PAGT G2 PLUS Bluetooth Calling Lady Smart Watch\" width=\"920\" height=\"450\"><h3>Instant Assistance SOS Emergency</h3><p>Feature Empowering safety, right on your XINJI <strong>PAGT G2 PLUS</strong> Smart Watch. In emergencies, your watch is your lifeline. With the built-in SOS emergency feature, help is just a tap away. Stay protected, stay prepared, with every moment, every heartbeat.</p><h2>Buy XINJI PAGT G2 PLUS Bluetooth Calling Lady Smart Watch from Star Tech</h2><p>In Bangladesh, you can get original <span style=\"font-weight: bold;\">XINJI PAGT G2 PLUS Bluetooth Calling Lady Smart Watch</span> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI PAGT G2 PLUS Bluetooth Calling Lady Smart Watch comes with 1 year of warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.3-inch AMOLED Super Retina Blue Light Screen"},{"key":"OS","value":"One-tap Pair HD BT Call"},{"key":"SpecialFeatures","value":"IP68 Waterproof"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Pink"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of XINJI PAGT G2 PLUS 1.3\" AMOLED Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI PAGT G2 PLUS 1.3\" AMOLED Smart Watch in Bangladesh is 5,490৳. You can buy the XINJI PAGT G2 PLUS 1.3\" AMOLED Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/pagt-g2-plus/pagt-g2-plus-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/pagt-g2-plus/pagt-g2-plus-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/pagt-g2-plus/pagt-g2-plus-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/pagt-g2-plus/pagt-g2-plus-02-500x500.webp"],"product_seo_title":"XINJI PAGT G2 PLUS Calling Lady Smart Watch Price in Bangladesh","product_seo_description":"Buy XINJI PAGT G2 PLUS Calling Lady Smart Watch at best price in Bangladesh. Latest XINJI PAGT G2 PLUS Smart Watch available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"XINJI PAGT G2 PLUS Bluetooth Calling Lady Smart Watch"},{"url":"https://www.startech.com.bd/xinji-cobee-c1-plus-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c1-plus/cobee-c1-plus-02-228x228.webp","title":"XINJI COBEE C1 PLUS Smart Watch","product_list_short_description":["1.96-inch large high-definition touch screen","100+ Sports Mode","IP68 waterproof grade","Built-in Games"],"price_new":0,"price_old":0,"price_single":3390,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"In Stock","code":"35202","brand":"XINJI","product_page_short_description":["Model: COBEE C1 PLUS","1.96-inch large high-definition touch screen","100+ Sports Mode","IP68 waterproof grade","Built-in Games"],"emi_price":311,"full_description":"<h2>XINJI COBEE C1 PLUS Smart Watch</h2><p>The XINJI <strong>COBEE C1 PLUS</strong> Smart Watch is a cutting-edge wearable that blends a stylish appearance with advanced functions. Its main feature is a big 1.96-inch high-definition touch screen with sharp pictures and an expanded interface that improves user engagement and reading. Despite its huge display, the watch has an ultra-thin casing, ensuring a modern and attractive appearance on your wrist. The XINJI COBEE C1 PLUS is waterproof up to IP68 standards, making it both durable and versatile. This means that it is not only splash and weather resistant, but it can also be immersed in water up to 1.5 meters deep for 30 minutes, making it perfect for swimmers and water sports enthusiasts. One of the main benefits of this COBEE C1 PLUS smart <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">watch </a>is its efficient charging method and lengthy standby time. With its rapid charging time, you can quickly power up the gadget, and once charged, it has a prolonged standby duration, lowering the frequency of charging and letting you to use it for longer periods of time without interruption. The XINJI COBEE C1 PLUS has configurable audio settings, so you may change the call volume and media volume individually to suit your needs. Whether you're having a call, listening to music, or viewing a video, you can customize the sound output to fit your surroundings and tastes. For enjoyment and relaxation, the&nbsp;COBEE C1 PLUS watch has built-in activities that provide an enjoyable distraction. These games may be played at any time and from any location, making them an ideal way to relax and pass the time. Staying connected is made simple with the Smart Sync Notification function. This function keeps you up to speed with notifications from your smartphone, such as calls, texts, and app alerts, right on your wrist. You can simply monitor incoming calls and read messages without having to reach for your phone, allowing you to stay connected even when on the road. Fitness aficionados will like the XINJI COBEE C1 PLUS's extensive sports tracking features. With over 100 sports modes to select from, the COBEE C1 PLUS watch can precisely record a wide range of physical activities, including running and cycling. It also has a sophisticated sensor that offers exact data, allowing you to accurately measure your steps, calories burnt, distance traveled, and heart rate. The XINJI COBEE C1 PLUS Smart Watch has a large high-definition touch screen, an IP68 waterproof rating, efficient charging with a long standby time, customizable audio settings, built-in games, smart notifications, extensive fitness tracking features, and an ultra-thin case with an advanced sensor. The XINJI COBEE C1 PLUS, with its combination of design, durability, and usefulness, is a flexible and dependable companion for daily usage and busy lives. </p><h2>Buy XINJI COBEE C1 PLUS Smart Watch from Star Tech</h2><p>In Bangladesh, you can get original <strong>XINJI COBEE C1 PLUS Smart Watch</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI COBEE C1 PLUS Smart Watch comes with 1 year of warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.96-Inch Large High-Definition Touch Screen"},{"key":"SpecialFeatures","value":"IP68 waterproof grade"},{"key":"Sensor","value":"built-in advanced sensor"},{"key":"Others","value":"Call Volume and Media Volume Can Be Adjusted Separately"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of XINJI COBEE C1 PLUS Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI COBEE C1 PLUS Smart Watch in Bangladesh is 3,390৳. You can buy the XINJI COBEE C1 PLUS Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c1-plus/cobee-c1-plus-02-500x500.webp"],"product_seo_title":"XINJI COBEE C1 PLUS Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy XINJI COBEE C1 PLUS Smart Watch at the best price in Bangladesh. Latest XINJI COBEE C1 PLUS Smart Watch available at Star Tech Shop. Order online for delivery in BD.","product_seo_keywords":"XINJI COBEE C1 PLUS Smart Watch\n"},{"url":"https://www.startech.com.bd/xinji-nothing-3-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-3/nothing-3091-228x228.webp","title":"XINJI Nothing 3 1.43\" AMOLED Smart Watch","product_list_short_description":["1.43-inch Super Retina AMOLED Large Display","100+ Online Watch Faces","110+ Sports Modes","Stay Connected Seamlessly"],"price_new":4850,"price_old":6490,"price_single":4850,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"In Stock","code":"34777","brand":"XINJI","product_page_short_description":["MPN: XINNOT3BL","Model: Nothing 3","1.43-inch Super Retina AMOLED Large Display","100+ Online Watch Faces","110+ Sports Modes","Stay Connected Seamlessly"],"emi_price":595,"full_description":"<h2>XINJI Nothing 3 1.43\" AMOLED Smart Watch</h2><p>The XINJI <strong>Nothing 3</strong> is a 1.43\" AMOLED S<a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">mart Watch</a> that flawlessly blends elegance and practicality. Encased in a sleek metal ultra-thin shell, its 1.43-inch Super Retina AMOLED Display provides dazzling clarity, guaranteeing that every detail explodes with vividness. With over 100 online watch faces, you can easily express your distinctive style. The revolutionary rotational design allows for easy interaction, and the magnetic strap adds an element of simple elegance. This multi-functional wonder promotes a wiser lifestyle with features such as 100+ professional sports modes that provide real-time data insights, helping you remain on top of your fitness objectives.Swift message answers keep you connected and improve your conversation experience. And with a powerful 300mAh battery, you can count on consistent performance throughout the day. The XINJI Nothing 3 is more than simply a smartwatch; it's a partner that takes your lifestyle to new heights.</p><h3>1.43-inch Super Ratina AMOLED Display</h3><p>With its 1.43-inch AMOLED screen of <strong>Nothing 3</strong>, 600 nit brightness, 466 x 466 pixel resolution, and smooth 60 frames per second refresh rate, the XINJI Nothing 3 Smart Watch will revolutionize gaming. With alerts and notifications that keep you updated in real time, you can stay fully engaged in the game world.</p><h3>110+ sports Modes</h3><p>With over 110 sports modes meticulously analyzed using precise algorithms, this Nothing 3 smart watch allows you to pursue your passions while delivering reliable monitoring and insights for a healthy lifestyle.</p><h2>Buy XINJI Nothing 3 1.43\" AMOLED Smart Watch from Star Tech</h2><p>In Bangladesh, you can get original <strong>XINJI Nothing 3 1.43\" AMOLED Smart Watch</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI Nothing 3 1.43\" AMOLED Smart Watch comes with 1 year of warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.43-inch Super Retina AMOLED Display"},{"key":"Battery","value":"300 mAh"},{"key":"Connectivity","value":"BT5.2+BLE3.0"},{"key":"OS","value":"Android 5.0 and above. IOS 9.0 and above"},{"key":"SpecialFeatures","value":"IP68 Waterproof"},{"key":"Sensor","value":"Health Monitoring With High-Performance Body Recognition Sensors"},{"key":"Others","value":"110+ Sports Modes"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"45.5x45.5x12.6mm"},{"key":"Weight","value":"34g (Without Strap)"},{"key":"Color","value":"Dark Silver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of XINJI Nothing 3 Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI Nothing 3 Smart Watch in Bangladesh is 4,850৳. You can buy the XINJI Nothing 3 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-3/nothing-3091-500x500.webp"],"product_seo_title":"XINJI Nothing 3 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy XINJI Nothing 3 Smart Watch at best price in Bangladesh. Latest XINJI Nothing 3 1.43\" AMOLED Smart Watch available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"XINJI Nothing 3 1.43\" AMOLED Smart Watch\n"},{"url":"https://www.startech.com.bd/xinji-cobee-c1-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c1/cobee-c1-01-228x228.webp","title":"XINJI COBEE C1 Waterproof Smart Watch","product_list_short_description":["1.69\" HD (240x280) Display","Health Care Monitoring","260 mAh Battery, Magnetic Charging","5ATM Waterproof"],"price_new":2400,"price_old":2799,"price_single":2400,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"In Stock","code":"24152","brand":"XINJI","product_page_short_description":["Model: COBEE C1","1.69\" HD (240x280) Display","Health Care Monitoring","260 mAh Battery, Magnetic Charging","5ATM Waterproof"],"emi_price":257,"full_description":"<h2 style=\"text-align: justify; \">XINJI COBEE C1 Waterproof Smart Watch</h2><p style=\"text-align: justify; \">The XINJI COBEE C1 Waterproof Smart Watch comes with a 1.69 inch TFT HD (240x280) Capacitor Full Contact Touch Screen display with 500 nits brightness. You can view all your stats and messages at a glance on the large 1.69-inch high-definition touch screen. Get notified of your incoming calls, text messages, social-network updates, and much more on your wrist. You can test and monitor heart rate, blood oxygen saturation and sleep quality in one device all day. It also enables you to check your data records and analytics in the XINJI app to learn more about your physical health. It tracks your real-time fitness data including heart rate, calories, and more. Your health status and exercise data are at your fingertips. The XINJI COBEE C1 is powered by a 260 mAh Battery and it supports magnetic charging. It holds the energy for 10 days of use with a full charge in about 2 hours. You don't need a charger on a short trip.&nbsp; Turn on the power-saving mode on a low battery, which can save power by 30% and last a long time. The XINJI COBEE C1 is 5ATM Waterproof. So you can wear the XINJI C1 on your wrist wherever you go. It can withstand splashes, rain and is also suitable for swimming. The XINJI COBEE C1 comes with 6 months of warranty.<br></p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.69 inch TFT HD (240x280) Capacitor Full Contact Touch Screen"},{"key":"Memory","value":"128 MB"},{"key":"Battery","value":"260 mAh"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"Band Material: Silicone (interchangeable)"},{"key":"OS","value":"Android 5.0 and above. IOS 10.0 and above"},{"key":"SpecialFeatures","value":"5 ATM Waterproof"},{"key":"Others","value":"Button: 1"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"36.4x43.4x10.3mm"},{"key":"Weight","value":"22.5g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"6 Months"}]}],"latest_price":{"heading":"What is the price of XINJI COBEE C1 Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI COBEE C1 Smart Watch in Bangladesh is 2,400৳. You can buy the XINJI COBEE C1 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c1/cobee-c1-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c1/cobee-c1-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c1/cobee-c1-03-500x500.webp"],"product_seo_title":"XINJI COBEE C1 Waterproof Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy XINJI COBEE C1 Waterproof Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"XINJI COBEE C1 Waterproof Smart Watch"},{"url":"https://www.startech.com.bd/xinji-cobee-c1-pros-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c1-pros/cobee-c1-pros-01-228x228.webp","title":"XINJI COBEE C1 PROS Bluetooth Calling Waterproof Smart Watch","product_list_short_description":["1.91\" HD (240x280) 60HZ AMOLED Display","Bluetooth Calling","IP68 Dustproof and Waterproof","Bangla Front Support"],"price_new":3190,"price_old":3799,"price_single":3190,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"In Stock","code":"27419","brand":"XINJI","product_page_short_description":["Model: COBEE C1 PROS","1.91\" HD (240x280) 60HZ AMOLED Display","Bluetooth Calling","IP68 Dustproof and Waterproof","Bangla Front Support"],"emi_price":348,"full_description":"<h2 style=\"text-align: justify; \">XINJI COBEE C1 PROS Bluetooth Calling Waterproof Smart Watch</h2><p style=\"text-align: justify; \">The XINJI COBEE C1 PROS Waterproof Smart Watch comes with a 1.91\" AMOLED HD Display &amp; 60Hz Refresh Rate. The smartwatch supports Bluetooth Calling.&nbsp; Get notified of your incoming calls, text messages, social-network updates, and much more on your wrist. You can test and monitor heart rate, blood oxygen saturation, and sleep quality in one device all day. It also enables you to check your data records and analytics in the XINJI app to learn more about your physical health. It tracks your real-time fitness data including heart rate, calories, and more. Your health status and exercise data are at your fingertips. The XINJI COBEE C1 PROS is powered by a 280 mAh Battery and it supports magnetic charging. It holds the energy for 10 days of use with a full charge in about 2 hours. You don't need a charger on a short trip.&nbsp; Turn on the power-saving mode on a low battery, which can save power by 30% and last a long time. The XINJI COBEE C1 PROS is IP68 Waterproof. So you can wear the XINJI C1 PROS on your wrist wherever you go. It can withstand splashes, rain and is also suitable for swimming. </p><h2 style=\"text-align: justify; \">Buy XINJI COBEE C1 PROS Bluetooth Calling Waterproof Smart Watch from Star Tech</h2><p style=\"text-align: justify; \">In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/xinji-cobee-c1-pros-smart-watch\" target=\"\">XINJI COBEE C1 PROS Bluetooth Calling Waterproof Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI COBEE C1 PROS comes with 6 months of warranty.<br></p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.91 inch AMOLED HD (240*296) Capacitive Full Touch Screen"},{"key":"Memory","value":"128 MB"},{"key":"Battery","value":"280 mAh"},{"key":"Connectivity","value":"Bluetooth 5.2"},{"key":"Material","value":"Watch case: Zinc alloy"},{"key":"OS","value":"Android 5.0 , IOS 10.0 and above"},{"key":"SpecialFeatures","value":"IP68 Waterproof"},{"key":"Others","value":"Button: 1"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"37.97x46.86x10.8mm"},{"key":"Weight","value":"50g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"6 Month Brand Warranty"}]}],"latest_price":{"heading":"What is the price of XINJI COBEE C1 PROS Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI COBEE C1 PROS Smart Watch in Bangladesh is 3,190৳. You can buy the XINJI COBEE C1 PROS Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c1-pros/cobee-c1-pros-01-500x500.webp"],"product_seo_title":"XINJI COBEE C1 PROS Bluetooth Calling Smart Watch Price in Bangladesh","product_seo_description":"Buy XINJI COBEE C1 PROS Bluetooth Calling Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"XINJI COBEE C1 PROS Bluetooth Calling Waterproof Smart Watch"},{"url":"https://www.startech.com.bd/xinji-cobee-c3-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c3/cobee-c3-02-228x228.webp","title":"XINJI COBEE C3 Bluetooth Calling Waterproof Smart Watch","product_list_short_description":["1.43\" Large HD TFT Display","Bluetooth Calling","280 mAh Battery, Magnetic Charging","IP68 Waterproof"],"price_new":3490,"price_old":4190,"price_single":3490,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"In Stock","code":"30009","brand":"XINJI","product_page_short_description":["Model: COBEE C3","1.43\" Large HD TFT Display","Bluetooth Calling","280 mAh Battery, Magnetic Charging","IP68 Waterproof"],"emi_price":384,"full_description":"<h2 style=\"text-align: justify; \">XINJI COBEE C3 Bluetooth Calling Waterproof Smart Watch</h2><p style=\"text-align: justify; \">The XINJI COBEE C3 Smart Watch features a large 1.43\" HD TFT display with a resolution of 360*360 pixels, providing a crisp and clear visual experience. With built-in Bluetooth calling, staying connected on the go is effortless. XINJI COBEE C3 Smart Watch supports an impressive 110+ workout modes, catering to various fitness enthusiasts. It also offers all-day health monitoring, allowing you to keep track of your well-being and fitness progress. The IP68 waterproof rating ensures protection against water and dust, making it suitable for various activities. With the option to download multiple watch faces, you can customize the look to match your style. The long battery life ensures extended usage without frequent charging. The XINJI COBEE C3 Smart Watch comes with a magnetic closure, ensuring a secure and comfortable fit. </p><h2 style=\"text-align: justify; \">Buy XINJI COBEE C3 Bluetooth Calling Waterproof Smart Watch from Star Tech</h2><p style=\"text-align: justify; \">In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/xinji-cobee-c3-smart-watch\" target=\"\">XINJI COBEE C3 Bluetooth Calling Waterproof Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI COBEE C3 comes with 1 year of warranty.<br></p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.43 inch TFT HD (360*360) Full Touch Screen"},{"key":"Battery","value":"280 mAh"},{"key":"Connectivity","value":"BT3.0+BLE5.2 one-click connection"},{"key":"Material","value":"Watch case: Zinc alloy"},{"key":"OS","value":"Android 6.0+ and above. IOS 12.0+ and above"},{"key":"SpecialFeatures","value":"IP68 Waterproof"},{"key":"Sensor","value":"Heart rate (each 10min), Blood oxygen, Breathing Training Steps, Calories, Distance(Auto), 24H Sleep monitor(Auto)"},{"key":"Supported Apps/ Software","value":"Wear Pro"},{"key":"Others","value":"Button: Double Side Key (on/off key + Movement shortcut key)"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"46.95x10.7mm"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of XINJI COBEE C3 Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI COBEE C3 Smart Watch in Bangladesh is 3,562৳. You can buy the XINJI COBEE C3 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c3/cobee-c3-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c3/cobee-c3-01-500x500.webp"],"product_seo_title":"XINJI COBEE C3 Bluetooth Calling Smart Watch Price in Bangladesh","product_seo_description":"Buy XINJI COBEE C3 Bluetooth Calling Smart Watch at the best price in Bangladesh. Latest XINJI C3 Smart Watch available at Star Tech Shop. Order online to get delivery in BD.","product_seo_keywords":"XINJI COBEE C3 Bluetooth Calling Waterproof Smart Watch"},{"url":"https://www.startech.com.bd/xinji-nothing-1-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-1/nothing-1-01-228x228.webp","title":"XINJI NOTHING 1 Bluetooth Calling Waterproof Smart Watch","product_list_short_description":["Display: 1.3\" HD AMOLED, 360x360px Resolution","Battery capacity: 300mAh","Waterproof rating: 3ATM","Bluetooth Calling"],"price_new":4590,"price_old":5490,"price_single":4590,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"In Stock","code":"28813","brand":"XINJI","product_page_short_description":["Model: NOTHING 1","Display: 1.3\" HD AMOLED, 360x360px Resolution","Battery capacity: 300mAh","Waterproof rating: 3ATM","Bluetooth Calling"],"emi_price":503,"full_description":"<h2>XINJI NOTHING 1 Bluetooth Calling Waterproof Smart Watch</h2><p style=\"text-align: justify; \">The XINJI NOTHING 1 Bluetooth Calling Waterproof <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">Smart Watch</a> is the epitome of the ultimate smartwatch experience. This cutting-edge timepiece is designed to be tough and ready for any challenge, ensuring you never miss a beat. Whether you're an outdoor adventurer, a fitness enthusiast, or a busy professional, NOTHING 1 has something for everyone. Stay connected on the go with Bluetooth calling capabilities. Make and receive calls directly from your wrist, eliminating the need to reach for your smartphone. This feature provides convenience and keeps you connected even when your phone is out of reach. With over 100 sports modes, NOTHING 1 is your perfect fitness companion. Whether you're running, cycling, swimming, or practicing yoga, this smartwatch has you covered. It accurately tracks your workouts, providing valuable data to help you monitor your progress and achieve your fitness goals. NOTHING 1 offers a range of practical functions. Stay organized with smart sync notifications, which keep you informed of incoming calls, messages, and app notifications. You can also control your music, set alarms, and access weather updates right from your wrist, making your daily life more convenient and efficient. NOTHING 1 ensures accurate and reliable data tracking. Whether you're monitoring your heart rate, counting your steps, or analyzing your sleep patterns, this smartwatch delivers precise results to help you make informed decisions about your health and wellness. The NOTHING 1 is designed to withstand the elements, featuring 3ATM protection for water resistance. Whether you're caught in the rain or want to track your swim, this smartwatch can handle it. Its durable construction ensures it can keep up with your active lifestyle. Experience the future of smartwatch technology with the XINJI NOTHING 1 Bluetooth Calling Waterproof Smart Watch. Stay connected, stay motivated, and reach new heights in your fitness journey with this feature-packed timepiece. Maximize your performance, stay on top of your notifications, and conquer your goals with the ultimate smartwatch experience.</p><h2 style=\"text-align: justify; \"><span style=\"color: inherit; font-family: inherit;\">Buy </span>XINJI NOTHING 1 Bluetooth Calling Waterproof Smart Watch<span style=\"color: inherit; font-family: inherit;\">&nbsp;from Star Tech</span><br></h2><p style=\"text-align: justify; \">In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/xinji-nothing-1-smart-watch\" target=\"\">XINJI NOTHING 1 Bluetooth Calling Waterproof Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI NOTHING 1 Smart Watch comes with 01-Year of warranty.<br></p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.3inch AMOLED (360×360) Capacitive Full Touch Screen"},{"key":"Memory","value":"Flash Memory: 128 MB"},{"key":"Battery","value":"300mAh"},{"key":"Connectivity","value":"BT3.0+BLE5.2"},{"key":"Material","value":"Band Material: Stainless Steel"},{"key":"OS","value":"Android 5.0 and above. IOS 10.0 and above"},{"key":"SpecialFeatures","value":"3ATM Waterproof"},{"key":"Others","value":"Button: 2"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"46*46*11.2mm"},{"key":"Weight","value":"43g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"01-Year Warranty"}]}],"latest_price":{"heading":"What is the price of XINJI NOTHING 1 Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI NOTHING 1 Smart Watch in Bangladesh is 4,590৳. You can buy the XINJI NOTHING 1 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-1/nothing-1-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-1/nothing-1-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-1/nothing-1-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-1/nothing-1-04-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-1/nothing-1-05-500x500.webp"],"product_seo_title":"XINJI NOTHING 1 Bluetooth Calling Smart Watch Price in Bangladesh","product_seo_description":"Buy XINJI NOTHING 1 Bluetooth Calling Smart Watch at best price in Bangladesh. Latest XINJI NOTHING 1 Smart Watch available at Star Tech Shop. Order online for delivery in BD.","product_seo_keywords":"XINJI NOTHING 1 Bluetooth Calling Waterproof Smart Watch"},{"url":"https://www.startech.com.bd/xinji-nothing-2-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-2/nothing-2-01-228x228.webp","title":"XINJI NOTHING 2 Bluetooth Calling Waterproof Smart Watch","product_list_short_description":["1.32\" HD AMOLED Display","Bluetooth Calling","280 mAh Battery, Magnetic Charging","3ATM Waterproof"],"price_new":4990,"price_old":5400,"price_single":4990,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"In Stock","code":"27420","brand":"XINJI","product_page_short_description":["Model: NOTHING 2","1.32\" HD AMOLED Display","Bluetooth Calling","280 mAh Battery, Magnetic Charging","3ATM Waterproof"],"emi_price":495,"full_description":"<h2 style=\"text-align: justify; \">XINJI NOTHING 2 Bluetooth Calling Waterproof Smart Watch</h2><p style=\"text-align: justify; \">The XINJI NOTHING 2 Waterproof Smart Watch comes with a 1.32\" AMOLED HD Display. The smartwatch supports Bluetooth Calling. Advanced Calling Experience To Stay Connected On The Go. The high clarity and quality Bluetooth call on your wrist makes it easier to manage calls on the move. Get notified of your incoming calls, text messages, social-network updates, and much more on your wrist. You can test and monitor heart rate, blood oxygen saturation, and sleep quality in one device all day. It also enables you to check your data records and analytics in the XINJI app to learn more about your physical health. It tracks your real-time fitness data including heart rate, calories, and more. Your health status and exercise data are at your fingertips. The XINJI NOTHING 2 is powered by a 3.8V 260mAh Lithium Polymer Battery and it supports magnetic charging. You don't need a charger on a short trip. The XINJI NOTHING 2 is 3ATM Waterproof. So you can wear the XINJI NOTHING 2 on your wrist wherever you go. It can withstand splashes, rain and is also suitable for swimming.<br></p><h2 style=\"text-align: justify; \">Buy XINJI NOTHING 2 Bluetooth Calling Waterproof Smart Watch from Star Tech</h2><p style=\"text-align: justify; \">In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/xinji-nothing-2-smart-watch\" target=\"\">XINJI NOTHING 2 Bluetooth Calling Waterproof Smart Watch</a> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI NOTHING 2 comes with 6 months of warranty.<br></p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.32inch AMOLED (454×454) Capacitive Full Touch Screen"},{"key":"Memory","value":"Flash Memory: RAM:578KB+ROM 640KB"},{"key":"Battery","value":"3.8V 260mAh Lithium Polymer Battery"},{"key":"Connectivity","value":"Bluetooth 5.2"},{"key":"Material","value":"Watch case: Aluminum alloy"},{"key":"OS","value":"Android 5.0 and above. IOS 10.0 and above"},{"key":"SpecialFeatures","value":"3ATM Waterproof"},{"key":"Others","value":"Button: 1"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"45*45*12mm"},{"key":"Weight","value":"65g"},{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"6 Month Brand Warranty"}]}],"latest_price":{"heading":"What is the price of XINJI NOTHING 2 Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI NOTHING 2 Smart Watch in Bangladesh is 4,266৳. You can buy the XINJI NOTHING 2 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-2/nothing-2-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-2/nothing-2-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-2/nothing-2-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/nothing-2/nothing-2-04-500x500.webp"],"product_seo_title":"XINJI NOTHING 2 Bluetooth Calling Smart Watch Price in Bangladesh","product_seo_description":"Buy XINJI NOTHING 2 Bluetooth Calling Smart Watch at best price in Bangladesh. Latest XINJI NOTHING 2 Smart Watch available at Star Tech Shop. Order online for delivery in BD.","product_seo_keywords":"XINJI NOTHING 2 Bluetooth Calling Waterproof Smart Watch"},{"url":"https://www.startech.com.bd/xinji-cobee-c2-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c2/cobee-c2-gray-01-228x228.jpg","title":"XINJI COBEE C2 AMOLED Display Waterproof Smart Watch","product_list_short_description":["1.3\" HD (360Ã—360) AMOLED Display","Heart rate and blood-oxygen saturation (SpO2)","240 mAh Battery, Magnetic Charging","3ATM Waterproof"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"Out Of Stock","code":"22205","brand":"XINJI","product_page_short_description":["Model: COBEE C2","1.3\" HD (360Ã—360) AMOLED Display","Heart rate and blood-oxygen saturation (SpO2)","240 mAh Battery, Magnetic Charging","3ATM Waterproof"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">XINJI COBEE C2 AMOLED Display Waterproof Smart Watch</h2><p style=\"text-align: justify; \">XINJI COBEE C2 Smart Watch comes with a 1.3\" HD AMOLED Display. With unprecedented visual clarity that reaches up to 360Ã—360 High resolution, the large 1.3-inch screen of the XINJI C2 boasts a high screen-to-body ratio and is visible even under bright sunlight. It has a Light &amp; Thin Zinc Alloy Body and comes with a Classic Navigation Crown. The XINJI COBEE C2 can monitor the heart rate, time, distance, and calories of more than 14 kinds of sports such as running, hiking, yoga, elliptical, etc., and analyze the sports report to make a scientific fitness plan for you. With the XINJI COBEE C2, you can test your heart rate, blood oxygen saturation, stress level, and breathing rate in one single tap of the watch, for a result in as little as 45 seconds. Get the data you need and then get on with your day. Recognizing the importance of the role blood-oxygen saturation (SpO2) levels play in human health, XINJI C2's advanced biosensor is able to automatically monitor6 your SpO2 level all day. The fitness tracker comes with 3ATM professional waterproof, with super waterproof performance (can't be in hot water). The XINJI COBEE C2 features smart notifications. Receive emails, texts, and alerts right on your watch when paired with a compatible smartphone. You can even respond to texts if you have an Android phone. The&nbsp;XINJI COBEE C2 comes with a 1-year warranty.<br></p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.3 inch HD (360×360) AMOLED Capacitor Full Contact Touch Screen"},{"key":"Memory","value":"128 MB"},{"key":"Battery","value":"240 mAh"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"Watch case: Zinc Alloy"},{"key":"OS","value":"Android 5.0 and above. IOS 10.0 and above"},{"key":"SpecialFeatures","value":"3 ATM Waterproof"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"44.2×44.2×9.9mm"},{"key":"Weight","value":"32.3g"},{"key":"Color","value":"Black Grey , Sliver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 year"}]}],"latest_price":{"heading":"What is the price of XINJI COBEE C2 Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI COBEE C2 Smart Watch in Bangladesh is 4,100৳. You can buy the XINJI COBEE C2 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c2/cobee-c2-gray-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c2/cobee-c2-gray-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c2/cobee-c2-gray-02-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/cobee-c2/cobee-c2-gray-03-500x500.jpg"],"product_seo_title":"XINJI COBEE C2 AMOLED Display Smart Watch Price in Bangladesh","product_seo_description":"Buy XINJI COBEE C2 Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch available at Star Tech Shop. Order online to get delivery anywhere in BD.","product_seo_keywords":"XINJI COBEE C2 AMOLED Display Waterproof Smart Watch"},{"url":"https://www.startech.com.bd/xinji-pagt-g2-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/pagt-g2/pagt-g2-pink-01-228x228.jpg","title":"XINJI PAGT G2 AMOLED Display Waterproof Smart Watch","product_list_short_description":["1.2\" HD (390Ã—390) AMOLED Always On Display","Multi-Function Knob","210 mAh Battery, Magnetic Charging","3ATM waterproof"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"Out Of Stock","code":"22219","brand":"XINJI","product_page_short_description":["Model: PAGT G2","1.2\" HD (390Ã—390) AMOLED Always On Display","Multi-Function Knob","210 mAh Battery, Magnetic Charging","3ATM waterproof"],"emi_price":0,"full_description":"<h2 style=\"text-align: justify; \">XINJI PAGT G2 AMOLED Display Waterproof Smart Watch</h2><p style=\"text-align: justify; \">The&nbsp;XINJI PAGT G2 Smart Watch comes with a Retina HD large screen making the display clear and true-to-life, with vivid colors ensuring smooth readability. With the 1.2 inch HD Screen, XINJI G2 brings you a more comfortable visual enjoyment and user experience. The&nbsp;XINJI PAGT G2 is equipped with a professional sensor to accurately monitor heart rate for dark skin. It offers continuous heart rate tracking with an improved sensor. This watch has a&nbsp;multi-function knob with an ultra-light aluminum alloy body, Anodizing process, never fades.&nbsp;The XINJI PAGT G2 3 ATM waterproof smartwatch can work well on rainy days, and hand washing. Please do not wear it when deep diving or in hot water more than 40Â°C. The smartwatch comes with 10+ built-in&nbsp;professional sports modes to monitor your sports data contrapuntally. With the built-in sports modes, the watch can track metrics like heart rate, calories burned, and more. The&nbsp;XINJI PAGT G2 is supported with Android 5.0 and above. IOS 10.0 and above.. It has a&nbsp;210 mAh battery capacity and it supports&nbsp;Magnetic Charging. It offers a standby time of&nbsp;20 days and a usage time of 7 days. It offers you intelligent notification. It receive emails, texts, and alerts right on your watch when paired with a compatible smartphone. The&nbsp;XINJI PAGT G2 comes with a 1-year warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.2 inch HD (390×390) AMOLED Capacitor Full Contact Touch Screen"},{"key":"Memory","value":"128 MB"},{"key":"Battery","value":"210 mAh"},{"key":"Connectivity","value":"Bluetooth 5.0"},{"key":"Material","value":"Watch case: Aluminum alloy"},{"key":"OS","value":"Android 5.0 and above. IOS 10.0 and above."},{"key":"SpecialFeatures","value":"3 ATM Waterproof"}]},{"heading":"Exterior","values":[{"key":"Dimension","value":"42.45 x 42.45 x 10.68mm"},{"key":"Weight","value":"40.8g"},{"key":"Color","value":"Pink, Golden"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 year"}]}],"latest_price":{"heading":"What is the price of XINJI PAGT G2 Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI PAGT G2 Smart Watch in Bangladesh is 4,350৳. You can buy the XINJI PAGT G2 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/pagt-g2/pagt-g2-pink-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/pagt-g2/pagt-g2-gold-01-500x500.jpg"],"product_seo_title":"XINJI PAGT G2 AMOLED Display Smart Watch Price in Bangladesh","product_seo_description":"Buy XINJI PAGT G2 Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch available at Star Tech Shop. Order online to get delivery anywhere in BD.","product_seo_keywords":"XINJI PAGT G2 AMOLED Display Waterproof Smart Watch"},{"url":"https://www.startech.com.bd/xinji-rorax-x1-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/rorax-x1/rorax-x1-01-228x228.webp","title":"XINJI RORAX X1 Smart Watch","product_list_short_description":["Super Long Endurance","100+ Sports Mode","5ATM Waterproof Grade","Built-in Games"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"Up Coming","code":"35200","brand":"XINJI","product_page_short_description":["Model: RORAX X1","Super Long Endurance","100+ Sports Mode","5ATM Waterproof Grade","Built-in Games"],"emi_price":0,"full_description":"<h2>XINJI RORAX X1 Smart Watch</h2><p>The XINJI <strong>RORAX X1</strong> Smart Watch is a sophisticated wearable gadget that blends usefulness and design. With a 5ATM waterproof rating, this RORAX X1 smart watch is not only resistant to splashes and rain, but also excellent for swimming and snorkeling, making it a dependable companion for aquatic sports. Its extremely long battery life offers continued usage, allowing you to wear the <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">watch </a>for days on end without the need for regular charging. One of its notable features is the ability to customize audio settings. The RORAX X1 watch allows you to set call and media volume independently, providing you complete control over your audio experience. You may customize the sound whether you're on the phone, listening to music, or podcasts. The built-in games on the XINJI RORAX X1 Smart Watch provide amusement on the go. These games provide a delightful distraction that can be played at any time and from any location, making leisure more entertaining. Staying connected is made simple with the smart sync notification function. This function keeps you up to speed on notifications from your smartphone, such as calls, texts, and app alerts, which appear right on your wrist. You can quickly check your watch to see who's calling or read incoming messages without having to reach for your phone. Fitness fanatics will be impressed by the watch's broad set of capabilities for monitoring physical activity. With over 100 sports modes, the XINJI RORAX X1 is suitable for a broad range of routines, including running, cycling, yoga, and swimming. It monitors your steps, calories burnt, heart rate, and other fitness metrics, offering useful insights into your progress. The XINJI RORAX X1 Smart Watch is a multifunctional device with waterproof capabilities, a long battery life, customizable audio settings, built-in games, smart notifications, and comprehensive fitness tracking features, making it an adaptable and dependable companion for daily use and active lifestyles.</p><h2>Buy XINJI RORAX X1 Smart Watch from Star Tech</h2><p>In Bangladesh, you can get original <strong>XINJI RORAX X1 Smart Watch</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI RORAX X1 Smart Watch comes with 1 year of warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"SpecialFeatures","value":"5ATM Waterproof Grade"},{"key":"Others","value":"Call Volume and Media Volume Can Be Adjusted Separately"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Dark Grey"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of XINJI RORAX X1 Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI RORAX X1 Smart Watch in Bangladesh is 0৳. You can buy the XINJI RORAX X1 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/rorax-x1/rorax-x1-01-500x500.webp"],"product_seo_title":"XINJI RORAX X1 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy XINJI RORAX X1 Smart Watch at the best price in Bangladesh. Latest XINJI RORAX X1 Smart Watch available at Star Tech Online Shop. Order online for delivery in BD.","product_seo_keywords":"XINJI RORAX X1 Smart Watch\n"},{"url":"https://www.startech.com.bd/xinji-rorax-x2-smart-watch","img":"https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/rorax-x2/rorax-x2-01-228x228.webp","title":"XINJI RORAX X2 Smart Watch","product_list_short_description":["Super Long Endurance","100+ Sports Mode","13+ Language Modes","Built-in Games"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"XINJI Smart Watch Price in Bangladesh | Star Tech","cat_seo_description":"Buy XINJI Smart Watch at the best price in Bangladesh. Latest XINJI Smart Watch, and Band available at Star Tech Shop. Order online to get delivery anywhere in BD.","cat_seo_keywords":"XINJI Smart Watch","status":"Up Coming","code":"35201","brand":"XINJI","product_page_short_description":["Model: RORAX X2","Super Long Endurance","100+ Sports Mode","13+ Language Modes","Built-in Games"],"emi_price":0,"full_description":"<h2>XINJI RORAX X2 Smart Watch</h2><p>The XINJI <strong>RORAX X2</strong> Smart Watch is a cutting-edge wearable gadget that flawlessly combines advanced technology and user-friendly features. The RORAX X2 watch's key feature is a big 1.96-inch high-definition touch screen, which provides vivid graphics and an expansive interface for easy navigation and interaction. The screen's high resolution provides brilliant colors and fine details, which improves the entire user experience. When it comes to battery life, the XINJI RORAX X2 outperforms with its impressive durability. This RORAX X2 smart <a href=\"https://www.startech.com.bd/gadget/smart-watch\" target=\"\" style=\"color: rgb(0, 0, 0);\">watch </a>is designed to withstand extended periods of usage while minimizing the hassle of regular recharge. Whether you're tracking your activities, receiving notifications, or playing games, the XINJI RORAX X2 will keep up with your hectic schedule. The configurable audio settings are a notable feature of this smartwatch. The option to regulate call and media volume individually provides unrivaled freedom in customizing your audio experience. Whether you're in a noisy area and need to increase call volume or want a lower media level for private listening, the XINJI RORAX X2 lets you easily adjust your sound choices. The built-in games on the XINJI RORAX X2 make it ideal for portable amusement. These games not only pass the time, but also demonstrate the watch's processing power and graphics capabilities. Whether you're waiting for a bus or taking a break between meetings, you can get into a gaming session and experience immersive gameplay right now. Staying connected is simple with the smart sync notification function. This function works smoothly with your smartphone, so you never miss an important call, message, or app alert. With a quick glance at your wrist, you can see who is calling, read incoming messages, and check notifications from your favorite applications, all without having to reach for your phone. The XINJI RORAX X2 is meant to be inclusive, featuring over 13 language settings. Whether you're a natural English speaker or fluent in another language, you can effortlessly switch to your favorite language setting, making the watch accessible to a wide range of users worldwide. Last but not least, fitness tracking is an integral part of the XINJI RORAX X2's features. With over 100 sports modes to select from, this smart watch is the ultimate exercise companion. It properly counts a variety of sports, such as running, cycling, swimming, and yoga, and provides real-time information on steps taken, calories burnt, distance traveled, and heart rate. This useful information enables you to track your progress, set exercise goals, and make educated decisions regarding your health and wellness. The XINJI RORAX X2 Smart Watch has a huge high-definition touch screen, a long battery life, configurable audio settings, built-in games, smart notifications, multilingual support, and full fitness tracking capabilities. The XINJI RORAX X2 is a great companion, combining design, utility, and adaptability. </p><h2>Buy XINJI RORAX X2 Smart Watch from Star Tech</h2><p>In Bangladesh, you can get original <strong>XINJI RORAX X2 Smart Watch</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/xinji-smart-watch\" target=\"\">XINJI Smart Watch</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The XINJI RORAX X2 Smart Watch comes with 1 year of warranty.</p>","specifications":[{"heading":"Basic Information","values":[{"key":"Display","value":"1.96-Inch Large High-Definition Touch Screen"},{"key":"Others","value":"Call Volume and Media Volume Can Be Adjusted Separately"}]},{"heading":"Exterior","values":[{"key":"Color","value":"Black"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of XINJI RORAX X2 Smart Watch in Bangladesh?","paragraph":"The latest price of XINJI RORAX X2 Smart Watch in Bangladesh is 0৳. You can buy the XINJI RORAX X2 Smart Watch at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/smart-watch/xinji/rorax-x2/rorax-x2-01-500x500.webp"],"product_seo_title":"XINJI RORAX X2 Smart Watch Price in Bangladesh | Star Tech","product_seo_description":"Buy XINJI RORAX X2 Smart Watch at the best price in Bangladesh. Latest XINJI RORAX X2 Smart Watch available at Star Tech Online Shop. Order online for delivery in BD.","product_seo_keywords":"XINJI RORAX X2 Smart Watch\n"}]