[{"url":"https://www.startech.com.bd/haier-hwm80-m826-8-kg-automatic-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm80-m826/hwm80-m826-01-228x228.webp","title":"Haier HWM80-M826 8 KG Top Load Fully Automatic Washing Machine","product_list_short_description":["Type: Top Load Fully Automatic","Washing Capacity: 8 Kg, Pillow Drum","Motor Type: AC Motor","Features: Hijab Mode, Magic Filter, Soft Close Tempered Glass"],"price_new":34000,"price_old":35000,"price_single":34000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"In Stock","code":"32344","brand":"Haier","product_page_short_description":["Model: HWM80-M826","Type: Top Load Fully Automatic","Washing Capacity: 8 Kg, Pillow Drum","Motor Type: AC Motor","Features: Hijab Mode, Magic Filter, Soft Close Tempered Glass"],"emi_price":3117,"full_description":"<h2>Haier HWM80-M826 8 KG Top Load Fully Automatic Washing Machine</h2><p>The Haier <strong>HWM80-M826</strong> is a top-load fully automatic washing machine with a 8kg washing capacity. This Haier HWM80-M826 automatic washing machine is powered by an AC motor that ensures smooth and efficient washing performance. The Haier HWM80-M826 8 KG Top Load Fully Automatic Washing Machine also has a soft-close tempered glass lid and a durable and elegant glass lid that closes softly and safely. It also has a dispenser, which is a convenient compartment that holds the detergent and fabric softener. The dispenser automatically releases the right amount of liquid at the right time. The <strong>Haier HWM80-M826 8 KG Automatic Washing Machine</strong> has a stainless steel tub, which is a sturdy and rust-proof tub that lasts longer and cleans better. It also has an Air Dry function, which is a fast and effective drying method that uses hot air to remove moisture from the clothes. The Air Dry function saves time and energy and prevents mold and odor. The Haier HWM80-M826 8 KG Top Load Washing Machine has a Quick Wash function, which is a time-saving option that washes lightly soiled clothes in just 15 minutes. It also has a user-friendly control panel and a simple and intuitive panel that lets you choose from 8 different wash programs and 4 water levels. The control panel also has a digital display that shows the remaining time and status of the wash cycle.</p><h3>Pillow Drum</h3><p>The Pillow Drum is a unique drum design that has soft and smooth pillow-shaped pads. The pillow drum protects your clothes from wear and tear and reduces friction and noise. Its 560 protrusions increase its flexibility across washing. When in operation, the 720 micropores (diameter of 2.5 mm) that spray water lessen wear and speed up cleaning.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-04.jpg\" alt=\"Haier HWM80-M826 8 KG Automatic Washing Machine\" width=\"920\" height=\"450\"><h3>Dedicated Hijab Mode</h3><p>One of the key features of this Haier HWM80-M826 washing machine is the dedicated hijab mode, which is the first dedicated hijab washing mode for Bangladesh. Its specially designed to wash delicate fabrics such as hijabs, scarves, shawls, and veils. The hijab mode uses gentle water flow and low spin speed to prevent damage and tangling of the fabrics.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-05.jpg\" alt=\"Haier HWM80-M826 8 KG Automatic Washing Machine\" width=\"920\" height=\"450\"><h3>Dual Magic Filter</h3><p>The Haier HWM80-M826 top-load washing machine also has a Magic Filter x2, a dual-layer filter that catches lint, hair, and other impurities from the water. The Magic Filter X2 ensures a clean and hygienic wash. The innovative use of bionic design prevents waste from flowing backward, ensuring a more thorough scrap collection process.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-06.jpg\" alt=\"Haier HWM80-M826 8 KG Automatic Washing Machine\" width=\"920\" height=\"450\"><h3>Soft Close Tempered Glass</h3><p>The gentle and gradual descent of the free-closing door prevents hand pinching and the sound of slamming. The glass lid allows you to see the washing process and adds a touch of style to your home.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-07.jpg\" alt=\"Haier HWM80-M826 8 KG Automatic Washing Machine\" width=\"920\" height=\"450\"><h2>Buy Haier HWM80-M826 8 KG Top Load Fully Automatic Washing Machine From Star Tech</h2><p>In Bangladesh, you can get original <strong>Haier HWM80-M826 8 KG Top Load Fully Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/haier-washing-machine\" target=\"\">Haier Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Haier HWM80-M826 8 KG Automatic Washing Machine comes with Motor: 10 Years warranty (Parts &amp; Service: 1 Year Warranty).&nbsp;Haier Warranty Card must be kept for warranty claims.</p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Top Load"},{"key":"Washing Capacity","value":"8kg"},{"key":"Drying Capacity","value":"Yes"},{"key":"Modes","value":"Hijab Mode"},{"key":"Motor Type","value":"AC Motor"},{"key":"Drum Type","value":"Pillow Drum"},{"key":"Door Type","value":"Soft Close Tempered Glass"},{"key":"Control Panel","value":"Yes"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"520*540*911mm"},{"key":"Weight","value":"33kg"},{"key":"Color","value":"Gray"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"Motor: 10 Years Warranty"}]}],"latest_price":{"heading":"What is the price of Haier HWM80-M826 8 KG Automatic Washing Machine in Bangladesh?","paragraph":"The latest price of Haier HWM80-M826 8 KG Automatic Washing Machine in Bangladesh is 34,000৳. You can buy the Haier HWM80-M826 8 KG Automatic Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm80-m826/hwm80-m826-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm80-m826/hwm80-m826-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm80-m826/hwm80-m826-03-500x500.webp"],"product_seo_title":"Haier HWM80-M826 8 KG Automatic Washing Machine Price in Bangladesh","product_seo_description":"Buy Haier HWM80-M826 8 KG Automatic Washing Machine at the best price in Bangladesh. Latest Haier HWM80-M826 8 KG Top Load Automatic Washing Machine available at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Haier HWM80-M826 8 KG Top Load Fully Automatic Washing Machine"},{"url":"https://www.startech.com.bd/haier-hwm100-m826-10-kg-automatic-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-01-228x228.webp","title":"Haier HWM100-M826 10 KG Top Load Fully Automatic Washing Machine","product_list_short_description":["Type: Top Load Fully Automatic","Washing Capacity: 10 Kg, Pillow Drum","Motor Type: AC Motor","Features: Hijab Mode, Magic Filter, Soft Close Tempered Glass"],"price_new":36000,"price_old":39400,"price_single":36000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"In Stock","code":"32343","brand":"Haier","product_page_short_description":["Model: HWM100-M826","Type: Top Load Fully Automatic","Washing Capacity: 10 Kg, Pillow Drum","Motor Type: AC Motor","Features: Hijab Mode, Magic Filter, Soft Close Tempered Glass"],"emi_price":3300,"full_description":"<h2>Haier HWM100-M826 10 KG Top Load Fully Automatic Washing Machine</h2><p>The Haier <strong>HWM100-M826</strong> is a top-load fully automatic washing machine with a 10kg washing capacity. This Haier HWM100-M826 automatic washing machine is powered by an AC motor that ensures smooth and efficient washing performance. The Haier HWM100-M826 10 KG Top Load Fully Automatic Washing Machine also has a soft-close tempered glass lid and a durable and elegant glass lid that closes softly and safely. It also has a dispenser, which is a convenient compartment that holds the detergent and fabric softener. The dispenser automatically releases the right amount of liquid at the right time. The <strong>Haier HWM100-M826 10 KG Automatic Washing Machine</strong> has a stainless steel tub, which is a sturdy and rust-proof tub that lasts longer and cleans better. It also has an Air Dry function, which is a fast and effective drying method that uses hot air to remove moisture from the clothes. The Air Dry function saves time and energy and prevents mold and odor. The Haier HWM100-M826 10 KG Top Load Washing Machine has a Quick Wash function, which is a time-saving option that washes lightly soiled clothes in just 15 minutes. It also has a user-friendly control panel and a simple and intuitive panel that lets you choose from 8 different wash programs and 4 water levels. The control panel also has a digital display that shows the remaining time and status of the wash cycle.</p><h3>Pillow Drum</h3><p>The Pillow Drum is a unique drum design that has soft and smooth pillow-shaped pads. The pillow drum protects your clothes from wear and tear and reduces friction and noise. Its 560 protrusions increase its flexibility across washing. When in operation, the 720 micropores (diameter of 2.5 mm) that spray water lessen wear and speed up cleaning.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-04.jpg\" alt=\"Haier HWM100-M826 10 KG Automatic Washing Machine\" width=\"920\" height=\"450\"><h3>Dedicated Hijab Mode</h3><p>One of the key features of this Haier HWM100-M826 washing machine is the dedicated hijab mode, which is the first dedicated hijab washing mode for Bangladesh. Its specially designed to wash delicate fabrics such as hijabs, scarves, shawls, and veils. The hijab mode uses gentle water flow and low spin speed to prevent damage and tangling of the fabrics.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-05.jpg\" alt=\"Haier HWM100-M826 10 KG Automatic Washing Machine\" width=\"920\" height=\"450\"><h3>Dual Magic Filter</h3><p>The Haier HWM100-M826 top-load washing machine also has a Magic Filter x2, a dual-layer filter that catches lint, hair, and other impurities from the water. The Magic Filter X2 ensures a clean and hygienic wash. The innovative use of bionic design prevents waste from flowing backward, ensuring a more thorough scrap collection process.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-06.jpg\" alt=\"Haier HWM100-M826 10 KG Automatic Washing Machine\" width=\"920\" height=\"450\"><h3>Soft Close Tempered Glass</h3><p>The gentle and gradual descent of the free-closing door prevents hand pinching and the sound of slamming. The glass lid allows you to see the washing process and adds a touch of style to your home.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-07.jpg\" alt=\"Haier HWM100-M826 10 KG Automatic Washing Machine\" width=\"920\" height=\"450\"><h2>Buy Haier HWM100-M826 10 KG Top Load Fully Automatic Washing Machine From Star Tech</h2><p>In Bangladesh, you can get original <strong>Haier HWM100-M826 10 KG Top Load Fully Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/haier-washing-machine\" target=\"\">Haier Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Haier HWM100-M826 10 KG Automatic Washing Machine comes with Motor: 10 Years warranty (Parts &amp; Service: 1 Year Warranty).&nbsp;Haier Warranty Card must be kept for warranty claims.</p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Top Load"},{"key":"Washing Capacity","value":"10kg"},{"key":"Drying Capacity","value":"Yes"},{"key":"Modes","value":"Hijab Mode"},{"key":"Motor Type","value":"Normal Motor"},{"key":"Drum Type","value":"Pillow Drum"},{"key":"Door Type","value":"Soft Close Tempered Glass"},{"key":"Control Panel","value":"Yes"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"580*590*960mm"},{"key":"Weight","value":"38.5kg"},{"key":"Color","value":"Grey"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"Motor: 10 Years Warranty"}]}],"latest_price":{"heading":"What is the price of Haier HWM100-M826 10 KG Automatic Washing Machine in Bangladesh?","paragraph":"The latest price of Haier HWM100-M826 10 KG Automatic Washing Machine in Bangladesh is 36,000৳. You can buy the Haier HWM100-M826 10 KG Automatic Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-03-500x500.webp"],"product_seo_title":"Haier HWM100-M826 10 KG Automatic Washing Machine Price in Bangladesh","product_seo_description":"Buy Haier HWM100-M826 10 KG Automatic Washing Machine at the best price in Bangladesh. Latest Haier HWM100-M826 10 KG Top Load Automatic Washing Machine available at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Haier HWM100-M826 10 KG Top Load Fully Automatic Washing Machine"},{"url":"https://www.startech.com.bd/haier-hw80-im12826tnzp-8-kg-automatic-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw80-im12826tnzp/hw80-im12826tnzp-01-228x228.webp","title":"Haier HW80-IM12826TNZP 8 KG Front Load Fully Automatic Washing Machine","product_list_short_description":["Type: Front Load Fully Automatic","Washing Drum Capacity: 8 Kg, 525mm huge door","Drum Type: Muscular Drum, Spin Speeds: 1200 rpm","Features: Inverter Motor, ABT, Huge Magic door, Near Zero Pressure"],"price_new":50000,"price_old":51000,"price_single":50000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"In Stock","code":"32339","brand":"Haier","product_page_short_description":["Model: HW80-IM12826TNZP","Type: Front Load Fully Automatic","Washing Drum Capacity: 8 Kg, 525mm huge door","Drum Type: Muscular Drum, Spin Speeds: 1200 rpm","Features: Inverter Motor, ABT, Huge Magic door, Near Zero Pressure"],"emi_price":4583,"full_description":"<h2>Haier HW80-IM12826TNZP 8 KG Front Load Fully Automatic Washing Machine</h2><p>The Haier <strong>HW80-IM12826TNZP</strong> is a front-load fully automatic washing machine with an 8-kg washing capacity. This washing machine has a front-loading, fully automatic design to save space and energy. Their 525mm huge door can open wide and allow easy loading and unloading. The <strong>Haier HW80-IM12826TNZP Automatic Washing Machine</strong> is equipped with an inverter motor to provide powerful and stable operation and a long lifespan. The Haier washing machine also has a muscular drum with electric resistance welding technology to protect clothes from damage and reduce noise and vibration. The automatic washing machine has an ABT gasket and dispenser to prevent bacteria and mold growth and keep your clothes hygienic. The Haier HW80-IM12826TNZP 8 KG Front Load Fully Automatic Washing Machine has 16 programs and functions to suit different types of fabrics and washing needs. The Haier 8kg washing machine has a range of programs such as mix, express 15 min, wool, shirts, duvet, disinfectant, intense, self-clean, delicate/silk, heavy, underwear, baby care, daily wash, hygienic, spin, and rinse spin. It also has functions such as power, delay, i-time, temperature, spin speed, rinse, water level, and start/pause, which can allow you to customize your washing preferences and control your washing cycle.</p><h3>Muscular Drum</h3><p>The Haier HW80-IM12826TNZP washing machines come with a unique muscular drum that can enhance the laundry experience by ensuring better scrubbing and caring for clothes. The muscular drum has 128 muscles and drains holes on the surface, creating a gentle and effective washing action. The muscles can lift and drop the clothes repeatedly, which can remove the dirt and stains more efficiently.</p><h3>High-Tech Inverter Motor</h3><p>The advanced high-tech inverter motor with Haier HW80-IM12826TNZP 8kg automatic washing machine reduce vibrations and wash the clothes with extra care. The inverter motor is a brushless motor that adjusts speed and torque according to the load and cycle. The inverter motor saves energy and improves washing performance.</p><h3>Near Zero Pressure Technology</h3><p>One of the challenges of washing clothes is the low water pressure. This can affect the performance and efficiency of the washing machine. However, since the Haier HW80-IM12826TNZP 8kg automatic washing machine comes with Near Zero Pressure technology, this problem is solved. The Near Zero Pressure technology is an advanced feature that smartly senses the load and adjusts the water level accordingly. It ensures reliable performance and effective cleaning even at extremely low water pressures of 0.001–0.002 MPA.</p><h3>ABT: Anti-Bacterial Technology</h3><p>Hygiene is very important when washing clothes. The Haier HW80-IM12826TNZP 8kg automatic washing machine is equipped with ABT that is contaminated with bacteria and allergens that can cause infections and allergies. Anti-Bacterial Technology is a feature that provides a hygienic, clean, and safe wash by eliminating 99.8% of allergen microbes.</p><h2>Buy Haier HW80-IM12826TNZP 8 KG Front Load Fully Automatic Washing Machine From Star Tech</h2><p>In Bangladesh, you can get original <strong>Haier HW80-IM12826TNZP 8 KG Front Load Fully Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/haier-washing-machine\" target=\"\">Haier Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Haier HW80-IM12826TNZP 8 KG Front Load Fully Automatic Washing Machine comes with Motor: 12 Years warranty (Parts &amp; Service: 1 Year Warranty).&nbsp;Haier Warranty Card must be kept for warranty claims.</p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Front Load"},{"key":"Washing Capacity","value":"8kg"},{"key":"Drying Capacity","value":"No"},{"key":"Modes","value":"Mix, Express 15 min, Wool, Shirts, Duvet, Disinfectant, Intense, Self Clean, Delicate/Silk, Heavy, Underwear, Baby Care, Daily Wash, Hygienic, Spin, Rinse+Spin"},{"key":"Motor Type","value":"Invertor Motor"},{"key":"Spin Speed","value":"1200 RPM"},{"key":"Drum Type","value":"Muscular drum"},{"key":"Drum Volume","value":"495mm"},{"key":"Door Type","value":"525mm huge door"},{"key":"Control Panel","value":"Touch"},{"key":"Display","value":"Touch screen"},{"key":"Noise level","value":"56/75 dB"},{"key":"Energy Efficiency Class","value":"A++ Energy Consumption"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595*550*850mm"},{"key":"Color","value":"Titanium Grey"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"Motor: Lifetime Warranty"}]}],"latest_price":{"heading":"What is the price of Haier HW80-IM12826TNZP 8 KG Automatic Washing Machine in Bangladesh?","paragraph":"The latest price of Haier HW80-IM12826TNZP 8 KG Automatic Washing Machine in Bangladesh is 50,000৳. You can buy the Haier HW80-IM12826TNZP 8 KG Automatic Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw80-im12826tnzp/hw80-im12826tnzp-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw80-im12826tnzp/hw80-im12826tnzp-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw80-im12826tnzp/hw80-im12826tnzp-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw80-im12826tnzp/hw80-im12826tnzp-04-500x500.webp"],"product_seo_title":"Haier HW80-IM12826TNZP 8 KG Washing Machine Price in Bangladesh","product_seo_description":"Buy Haier HW80-IM12826TNZP 8 KG Washing Machine at the best price in Bangladesh. Latest Haier HW80-IM12826TNZP 8 KG Front Load Fully Automatic Washing Machine available at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Haier HW80-IM12826TNZP 8 KG Front Load Fully Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-nas085m1-8kg-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/nas085m1/nas085m1-228x228.webp","title":"Panasonic NAS085M1 8kg Front Load Automatic Washing Machine","product_list_short_description":["Type: Fully Automatic, Motor: Universal Motor","Washing Capacity: 8 kg, Drying Capacity: 4 kg","Spin Speed: Max. 1400 RPM","Drum Type: Cube Drum"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34405","brand":"Panasonic","product_page_short_description":["Model: NAS085M1","Type: Fully Automatic, Motor: Universal Motor","Washing Capacity: 8 kg, Drying Capacity: 4 kg","Spin Speed: Max. 1400 RPM","Drum Type: Cube Drum"],"emi_price":0,"full_description":"<h2>Panasonic NAS085M1 8kg Front Load Automatic Washing Machine</h2><p>The Panasonic <strong>NAS085M1</strong> 8kg Front Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine </a>is a multifunctional and effective machine that makes doing laundry easier. With its robust universal motor and completely automatic operation, this washer/dryer can handle loads of up to 8 kg each and is ideal for households with different laundry requirements. Its cube drum design and maximum spin speed of 1400 RPM guarantee that clothing is cleaned thoroughly and gently. Operating on a power source of 220-240V and a frequency of 50Hz/60Hz, the Panasonic NAS085M1 8kg Automatic Washing Machine consumes between 1950W and 2100W of power. The washing process can be readily monitored and controlled by users thanks to the LED display, and the electromagnetic door lock assures safety while in use. With a wash ratio of 1.03, the appliance offers exceptional washing performance and a 4-star energy efficiency certification. To accommodate diverse fabric kinds and laundry preferences, it provides 16 distinct programs. Additionally, it runs silently, causing the least amount of disturbance in the home, with noise emissions as low as 62 dB during the washing and drying cycles. In general, the Panasonic NAS085M1 washing machine streamlines users' laundry experiences by combining cutting-edge technologies, effective performance, and user-friendly operation.</p><h2>Buy Panasonic NAS085M1 8kg Front Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NAS085M1 8kg Front Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NAS085M1 8kg Front Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Front Loading"},{"key":"Washing Capacity","value":"8KG"},{"key":"Drying Capacity","value":"4KG"},{"key":"Motor Type","value":"Universal Motor"},{"key":"Spin Speed","value":"Max. 1400 RPM"},{"key":"Drum Type","value":"Cube Drum"},{"key":"Door Type","value":"Electromagnetic Lock"},{"key":"Display","value":"LED Display"},{"key":"Noise level","value":"62 dB"},{"key":"Energy Efficiency Class","value":"4 star"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595*565*850 mm"},{"key":"Weight","value":"78 Kg"},{"key":"Color","value":"Silver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NAS085M1 8kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NAS085M1 8kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NAS085M1 8kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/nas085m1/nas085m1-500x500.webp"],"product_seo_title":"Panasonic NAS085M1 8kg Automatic Washing Machine Price in Bangladesh","product_seo_description":"Buy Panasonic NAS085M1 8kg Automatic Washing Machine at best price in Bangladesh. Latest Panasonic NAS085M1 Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NAS085M1 8kg Front Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-na-127xb-7kg-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-127xb/na-127xb-228x228.webp","title":"Panasonic NA-127XB 7kg Front Load Automatic Washing Machine","product_list_short_description":["Machine Type: Fully Automatic","Washing Capacity: 7 kg, Spin Speed: 1200 RPM","Drum Type: Stainless Steel, 420 mm Wide Door","Double Hygiene With Cold/Hot Wash"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34406","brand":"Panasonic","product_page_short_description":["Model: NA-127XB","Machine Type: Fully Automatic","Washing Capacity: 7 kg, Spin Speed: 1200 RPM","Drum Type: Stainless Steel, 420 mm Wide Door","Double Hygiene With Cold/Hot Wash"],"emi_price":0,"full_description":"<h2>Panasonic NA-127XB 7kg Front Load Automatic Washing Machine</h2><p>The Panasonic <strong>NA-127XB</strong> 7kg Front Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine</a>'s fully automatic front loading design provides a practical and effective washing solution. It guarantees complete cleaning and rapid drying of garments with a 7 kg washing capacity and a 1200 RPM spin speed. With five temperature settings ranging from 20 to 90 degrees Celsius and an integrated heater, users may tailor the wash to the specific needs of the cloth and the degree of staining. The Panasonic NA-127XB 7kg Front Load Automatic Washing Machine has unique wash programs, like Aqua Fresh Wash, which uses three water flows to effectively remove stubborn stains, and Brisk Wash, which offers quick cycles. Its practical features, which preserve hygiene and prolong the life of the appliance, include Pre Wash for soaking deeply stained garments and Tub Clean for eliminating stains from the inner walls of the outer tub. The laundry can be loaded and unloaded more easily because of the 420 mm wide door, and the stainless steel tub guarantees long-lasting cleaning effectiveness. Users can effortlessly oversee and manage the washing process with the help of a digital display, and the machine uses 1900 watts of power to run energy-efficiently. In general, the Panasonic NA-127XB washing machine offers a smooth and efficient laundry experience by combining cutting-edge technology, adjustable settings, and an intuitive design.</p><h2>Buy Panasonic NA-127XB 7kg Front Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NA-127XB 7kg Front Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NA-127XB 7kg Front Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Front Loading"},{"key":"Washing Capacity","value":"7KG"},{"key":"Spin Speed","value":"1200 RPM"},{"key":"Drum Type","value":"Stainless Steel"},{"key":"Door Type","value":"420 mm Wide Door"},{"key":"Display","value":"LED Display"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595 x 470 x 845 mm"},{"key":"Weight","value":"60 kg"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NA-127XB 7kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NA-127XB 7kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NA-127XB 7kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-127xb/na-127xb-500x500.webp"],"product_seo_title":"Panasonic NA-127XB 7kg Washing Machine Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic NA-127XB 7kg Washing Machine at best price in Bangladesh. Latest Panasonic NA-127XB Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NA-127XB 7kg Front Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-na-128xb-8kg-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-128xb/na-128xb-228x228.webp","title":"Panasonic NA-128XB 8kg Front Load Automatic Washing Machine","product_list_short_description":["Machine Type: Fully Automatic","Washing Capacity: 8 kg, Spin Speed: 1200 RPM","Drum Type: Stainless Steel, 420 mm Wide Door","Double Hygiene With Cold/Hot Wash"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34407","brand":"Panasonic","product_page_short_description":["Model: NA-128XB","Machine Type: Fully Automatic","Washing Capacity: 8 kg, Spin Speed: 1200 RPM","Drum Type: Stainless Steel, 420 mm Wide Door","Double Hygiene With Cold/Hot Wash"],"emi_price":0,"full_description":"<h2>Panasonic NA-128XB 8kg Front Load Automatic Washing Machine</h2><p>The Panasonic <strong>NA-128XB</strong> 8kg Front Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine</a>'s completely automatic front-loading design makes it a convenient and efficient washing machine. With an 8-kilogram washing capacity and a 1200 RPM spin speed, it ensures thorough cleaning and quick drying of clothes. With an inbuilt heater and five temperature settings ranging from 20 to 90 degrees Celsius, customers may customize the wash to the exact requirements of the material and the level of stains. Unique wash programs including Aqua Fresh Wash, which uses three water flows to effectively remove stubborn stains, and Brisk Wash, which delivers rapid cycles, are available on the Panasonic NA-128XB 8kg Front Load Automatic Washing Machine. Pre-wash for soaking severely stained clothes and Tub Clean for getting rid of stains from the inner walls of the outer tub are two of its useful functions that maintain hygiene and extend the life of the appliance. The 420 mm wide door makes loading and unloading the laundry easier, and the stainless steel tub ensures effective washing for a long time. With the aid of a digital display, users can easily supervise and regulate the washing operation. The machine runs energy-efficiently with 1900 watts of power. Overall, the Panasonic NA-128XB washing machine combines state-of-the-art technology, customizable settings, and an easy-to-use design to provide a seamless and effective laundry experience.</p><h2>Buy Panasonic NA-128XB 8kg Front Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NA-128XB 8kg Front Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NA-128XB 8kg Front Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Front Loading"},{"key":"Washing Capacity","value":"8KG"},{"key":"Spin Speed","value":"1200 RPM"},{"key":"Drum Type","value":"Stainless Steel"},{"key":"Door Type","value":"420 mm Wide Door"},{"key":"Display","value":"LED Display"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595 x 535 x 845 mm"},{"key":"Weight","value":"64 kg"},{"key":"Color","value":"Silver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NA-128XB 8kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NA-128XB 8kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NA-128XB 8kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-128xb/na-128xb-500x500.webp"],"product_seo_title":"Panasonic NA-128XB 8kg Washing Machine Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic NA-128XB 8kg Washing Machine at best price in Bangladesh. Latest Panasonic NA-128XB Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NA-128XB 8kg Front Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-na-f127xb-7kg-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-128xb/na-128xb-228x228.webp","title":"Panasonic NA-F127XB 7kg Front Load Automatic Washing Machine","product_list_short_description":["Machine Type: Fully Automatic","Washing Capacity: 7 kg, Spin Speed: 1200 RPM","Drum Type: Stainless Steel, 420 mm Wide Door","Double Hygiene With Cold/Hot Wash"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34408","brand":"Panasonic","product_page_short_description":["Model: NA-F127XB","Machine Type: Fully Automatic","Washing Capacity: 7 kg, Spin Speed: 1200 RPM","Drum Type: Stainless Steel, 420 mm Wide Door","Double Hygiene With Cold/Hot Wash"],"emi_price":0,"full_description":"<h2>Panasonic NA-F127XB 7kg Front Load Automatic Washing Machine</h2><p>The Panasonic <strong>NA-F127XB</strong> 7kg Front Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine</a>'s completely automatic front loading design provides a complete laundry solution. It guarantees effective cleaning and speedy drying of garments with a large 7 kg washing capacity and a 1200 RPM spin speed. With five temperature settings from 20 to 90 degrees Celsius and an integrated heater, customers may customize the wash cycle to fit a variety of fabric kinds and stain levels. The Panasonic NA-F127XB 7kg Automatic Washing Machine has specific wash programs, like Aqua Fresh Wash, which uses three water flows to effectively remove stubborn stains, and Brisk Wash, which offers speedier cycles. Its practical features, which ensure hygiene and prolong the life of the appliance, include Pre Wash for soaking deeply stained garments and Tub Clean for getting rid of stains from the inner walls of the outer tub. A 420 mm wide door makes it simple to load and unload laundry from the Panasonic NA-F127XB 7kg Front Load Automatic Washing Machine, and a stainless steel tub ensures long-lasting use and excellent cleaning. The machine uses 1900 watts of power for energy-efficient operation, but users can easily monitor and regulate the washing process because of its digital display. </p><h2>Buy Panasonic NA-F127XB 7kg Front Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NA-F127XB 7kg Front Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NA-F127XB 7kg Front Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Front Loading"},{"key":"Washing Capacity","value":"7KG"},{"key":"Spin Speed","value":"1200 RPM"},{"key":"Drum Type","value":"Stainless Steel"},{"key":"Door Type","value":"420 mm Wide Door"},{"key":"Display","value":"LED Display"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"Width: 58 cm"},{"key":"Weight","value":"60 kg"},{"key":"Color","value":"Silver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NA-F127XB 7kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NA-F127XB 7kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NA-F127XB 7kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-128xb/na-128xb-500x500.webp"],"product_seo_title":"Panasonic NA-F127XB 7kg Washing Machine Price in Bangladesh","product_seo_description":"Buy Panasonic NA-F127XB 7kg Washing Machine at best price in Bangladesh. Latest Panasonic NA-F127XB Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NA-F127XB 7kg Front Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-na-f100b5-10kg-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f100b5/na-f100b5-228x228.webp","title":"Panasonic NA-F100B5 10kg Top Load Automatic Washing Machine","product_list_short_description":["Machine Type: Fully Automatic","Washing Capacity: 10kg, Spin Speed: 710RPM","Aqua Crystal Glass Durable Glass Cover","Air Dry Spin Dry System"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34415","brand":"Panasonic","product_page_short_description":["Model: NA-F100B5","Machine Type: Fully Automatic","Washing Capacity: 10kg, Spin Speed: 710RPM","Aqua Crystal Glass Durable Glass Cover","Air Dry Spin Dry System"],"emi_price":0,"full_description":"<h2>Panasonic NA-F100B5 10kg Top Load Automatic Washing Machine</h2><p>The Panasonic <strong>NA-F100B5</strong> 10kg Top Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine</a> is a feature-rich machine that is intended to handle your laundry needs efficiently. Its Eco Aquabeat Technology ensures water conservation with its New Shower Rinse &amp; Aqua Spin Rinse features while providing a thorough clean with Dancing Water Flow &amp; Foam Wash. It's 10 kg washing capacity and 710 RPM spin speed guarantee that your clothing will dry quickly and with plenty of space. With nine different automatic washing programs to accommodate different types of fabric, the Panasonic NA-F100B5 10kg Top Load Automatic Washing Machine offers the best care possible for every load. Faster drying is made possible with the Air Dry Spin Dry System and the sturdy Aqua Crystal Glass cover. The user-friendly control panel of the Panasonic NA-F100B5 10kg Automatic Washing Machine improves the convenience of use, and convenient functions like Auto Restart and Auto Power Off help save energy. This washing machine provides a complete laundry solution with its eco-friendly design and cutting-edge features like the Sazanami wash tub and Dancing water circulating system.</p><h2>Buy Panasonic NA-F100B5 10kg Top Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NA-F100B5 10kg Top Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NA-F100B5 10kg Top Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Top Loading"},{"key":"Washing Capacity","value":"10KG"},{"key":"Drying Capacity","value":"Air Dry Spin Dry System"},{"key":"Modes","value":"9 automatic washing programs as appropriate for the fabric"},{"key":"Spin Speed","value":"710RPM"},{"key":"Door Type","value":"Aqua Crystal Glass Durable Glass Cover"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595 x 641 x 995mm"},{"key":"Weight","value":"30 kg"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NA-F100B5 10kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NA-F100B5 10kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NA-F100B5 10kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f100b5/na-f100b5-500x500.webp"],"product_seo_title":"Panasonic NA-F100B5 10kg Washing Machine Price in Bangladesh","product_seo_description":"Buy Panasonic NA-F100B5 10kg Washing Machine at best price in Bangladesh. Latest Panasonic NA-F100B5 Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NA-F100B5 10kg Top Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-na-f70b5-7kg-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f70b5/na-f70b5-228x228.webp","title":"Panasonic NA-F70B5 7kg Top Load Automatic Washing Machine","product_list_short_description":["Machine Type: Fully Automatic","Washing Capacity: 7kg, Spin Speed: 740RPM","Twin lint filter, 6 water level settings","Digital display, Dancing water flow"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34417","brand":"Panasonic","product_page_short_description":["Model: NA-F70B5","Machine Type: Fully Automatic","Washing Capacity: 7kg, Spin Speed: 740RPM","Twin lint filter, 6 water level settings","Digital display, Dancing water flow"],"emi_price":0,"full_description":"<h2>Panasonic NA-F70B5 7kg Top Load Automatic Washing Machine</h2><p>The Panasonic <strong>NA-F70B5</strong> 7kg Top Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine</a> is a dependable and effective option for your laundry needs. Its Dancing water flow system assures thorough cleaning, and its stainless steel tub guarantees endurance and resists rusting. It offers a greater water flow and a squeezing impact for efficient cleaning with two different strengths in the tub's rotation. The double lint filter guarantees clean, lint-free laundry, and the innovative auto power-down feature helps save electricity. Different load sizes are accommodated by the six water level settings, and the digital display provides straightforward operation. The Panasonic NA-F70B5 7kg Top Load Washing Machine's functionality is enhanced by features including a child lock, a pre-set timer with delay start, ECONAVI technology for optimal fabric load and water temperature, and a double inlet for hot and cold water. For a thorough laundry experience, the machine also includes features like a Soft Closing Lid, Baby-Care, Tub Hygiene, Stain Master, and Digital Indicator. With a 7kg washing capacity and a motor speed of 740 RPM, the Panasonic NA-F70B5 7kg Top Load Automatic Washing Machine operates efficiently. Furthermore, quality and dependability are guaranteed by its Japanese provenance and Indian assembly.</p><h2>Buy Panasonic NA-F70B5 7kg Top Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NA-F70B5 7kg Top Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NA-F70B5 7kg Top Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Top Loading"},{"key":"Washing Capacity","value":"7KG"},{"key":"Spin Speed","value":"740RPM"},{"key":"Display","value":"Digital display"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"571×525× 969mm"},{"key":"Weight","value":"30 kg"},{"key":"Color","value":"Silver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NA-F70B5 7kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NA-F70B5 7kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NA-F70B5 7kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f70b5/na-f70b5-500x500.webp"],"product_seo_title":"Panasonic NA-F70B5 7kg Washing Machine Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic NA-F70B5 7kg Washing Machine at best price in Bangladesh. Latest Panasonic NA-F70B5 Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NA-F70B5 7kg Top Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-na-f75s7sfw-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f75s7sfw/na-f75s7sfw-228x228.webp","title":"Panasonic NA-F75S7SFW 7.5kg Top Load Automatic Washing Machine","product_list_short_description":["Machine Type: Fully Automatic","Washing Capacity: 7.5kg, Spin Speed: 730RPM","Intelligent Econavi Sensor, Aqua Crystal Glass Lid","15 Automatic Washing Programs"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34419","brand":"Panasonic","product_page_short_description":["Model: NA-F75S7SFW","Machine Type: Fully Automatic","Washing Capacity: 7.5kg, Spin Speed: 730RPM","Intelligent Econavi Sensor, Aqua Crystal Glass Lid","15 Automatic Washing Programs"],"emi_price":0,"full_description":"<h2>Panasonic NA-F75S7SFW 7.5kg Top Load Automatic Washing Machine</h2><p>The Panasonic <strong>NA-F75S7SFW</strong> 7.5kg Top Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine</a>, with its 7.5kg capacity and 730 RPM spin speed, provides a flexible and effective washing solution. With just 450 watts of power usage, it is energy-efficient without sacrificing functionality. It meets different fabric needs with temperature control choices for hot and warm washes. With 15 automatic washing programs, including Foam Premia Washing and Stain Master Technology, the Panasonic NA-F75S7SFW 7.5kg Top Load Washing Machine ensures thorough cleaning for a variety of laundry kinds. Its Econavi Sensor, which is Intelligent, optimizes energy and water use according to load, making it more environmentally friendly. While the Gentle Hand Wash function guarantees that delicate materials are handled with care, the Easy Wide Opening and Premium Back Panel Design make loading and unloading straightforward. With the help of Aqua Spin Rinse and Eco Aquabeat Technology, the Panasonic NA-F75S7SFW 7.5kg Top Load Automatic Washing Machine guarantees efficient cleaning and water conservation. The Aqua Crystal Glass Lid adds durability and style, while the Easy-to-Use Control Panel simplifies operation. Advanced functions that save energy and increase convenience include Auto-Restart and Auto-Power Off.</p><h2>Buy Panasonic NA-F75S7SFW 7.5kg Top Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NA-F75S7SFW 7.5kg Top Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NA-F75S7SFW 7.5kg Top Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Top Loading"},{"key":"Washing Capacity","value":"7.5KG"},{"key":"Modes","value":"15 Automatic Washing Programs"},{"key":"Spin Speed","value":"730RPM"},{"key":"Door Type","value":"Aqua Crystal Glass Lid"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"52.5x57.1x103.4 cm"},{"key":"Weight","value":"31 kg"},{"key":"Color","value":"SUS (Stainless Steel)"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NA-F75S7SFW 7.5kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NA-F75S7SFW 7.5kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NA-F75S7SFW 7.5kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f75s7sfw/na-f75s7sfw-500x500.webp"],"product_seo_title":"Panasonic NA-F75S7SFW 7.5kg Washing Machine Price in Bangladesh","product_seo_description":"Buy Panasonic NA-F75S7SFW 7.5kg Washing Machine at best price in BD. Latest Panasonic NA-F75S7SFW Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NA-F75S7SFW 7.5kg Top Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-na-f75v7lrb-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f75s7sfw/na-f75s7sfw-228x228.webp","title":"Panasonic NA-F75V7LRB 7.5kg Top Load Automatic Washing Machine","product_list_short_description":["Machine Type: Fully Automatic","Washing Capacity: 7.5kg, Spin Speed: 730RPM","Intelligent Econavi Sensor, Aqua Crystal Glass Lid","15 Automatic Washing Programs"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34420","brand":"Panasonic","product_page_short_description":["Model: NA-F75V7LRB","Machine Type: Fully Automatic","Washing Capacity: 7.5kg, Spin Speed: 730RPM","Intelligent Econavi Sensor, Aqua Crystal Glass Lid","15 Automatic Washing Programs"],"emi_price":0,"full_description":"<h2>Panasonic NA-F75V7LRB 7.5kg Top Load Automatic Washing Machine</h2><p>The Panasonic <strong>NA-F75V7LRB</strong> 7.5kg Top Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine</a> offers a versatile and efficient washing option thanks to its 7.5kg capacity and 730 RPM spin speed. It uses only 450 watts of power, so it is energy-efficient without compromising performance. It satisfies various fabric requirements by offering options for hot and warm wash temperatures. The Panasonic NA-F75V7LRB 7.5 kg Top Load Washing Machine has 15 automatic washing programs, including Foam Premia Washing and Stain Master Technology, to guarantee complete cleaning for a range of laundry types. Its intelligent Econavi Sensor optimizes water and energy use according to load, reducing its environmental impact. Loading and unloading are made simple with the Easy Wide Opening and Premium Back Panel Design, while the Gentle Hand Wash feature ensures that delicate textiles are handled with care. The Panasonic NA-F75V7LRB 7.5kg Top Load Automatic Washing Machine ensures effective washing and water conservation with the aid of Aqua Spin Rinse and Eco Aquabeat Technology. The Easy-to-Use Control Panel makes operation simpler, and the Aqua Crystal Glass Lid adds durability and appeal. Auto-Restart and Auto-Power Off are examples of advanced features that save energy use and improve convenience.</p><h2>Buy Panasonic NA-F75V7LRB 7.5kg Top Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NA-F75V7LRB 7.5kg Top Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NA-F75V7LRB 7.5kg Top Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Top Loading"},{"key":"Washing Capacity","value":"7.5KG"},{"key":"Modes","value":"15 Automatic Washing Programs"},{"key":"Spin Speed","value":"730RPM"},{"key":"Door Type","value":"Aqua Crystal Glass Lid"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"52.5x57.1x103.4 cm"},{"key":"Weight","value":"31 kg"},{"key":"Color","value":"Silver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NA-F75V7LRB 7.5kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NA-F75V7LRB 7.5kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NA-F75V7LRB 7.5kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f75s7sfw/na-f75s7sfw-500x500.webp"],"product_seo_title":"Panasonic NA-F75V7LRB 7.5kg Washing Machine Price in Bangladesh","product_seo_description":"Buy Panasonic NA-F75V7LRB 7.5kg Washing Machine at best price in BD. Latest Panasonic NA-F75V7LRB Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NA-F75V7LRB 7.5kg Top Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-na-f80b5-8kg-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f80b5/na-f80b5-228x228.webp","title":"Panasonic NA-F80B5 8kg Top Load Automatic Washing Machine","product_list_short_description":["Machine Type: Fully Automatic","Washing Capacity: 8kg, Spin Speed: 730RPM","Drum Type: Sazanami Drum, Aqua Spin Rinse","6 water level settings, Digital display"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34423","brand":"Panasonic","product_page_short_description":["Model: NA-F80B5","Machine Type: Fully Automatic","Washing Capacity: 8kg, Spin Speed: 730RPM","Drum Type: Sazanami Drum, Aqua Spin Rinse","6 water level settings, Digital display"],"emi_price":0,"full_description":"<h2>Panasonic NA-F80B5 8kg Top Load Automatic Washing Machine</h2><p>The Panasonic <strong>NA-F80B5</strong> 8kg Top Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine</a> is a reliable and versatile machine made to efficiently handle your laundry needs. It guarantees a thorough cleaning and leaves your clothing smelling great thanks to features like Aqua Spin Rinse and Fragrance Course. The Baby Care functionality ensures gentle washing for fragile fabrics, giving parents peace of mind. Its stainless steel tub ensures long-term function by being durable and resistant to rust. With its dancing water flow mechanism and two different tub rotation strengths, the Panasonic NA-F80B5 8kg Top Load Automatic Washing Machine provides a stronger water flow and squeezing impact for effective cleaning. While the six water level settings accommodate different load sizes, the unique auto power-off feature also helps to save energy consumption. The digital display, pre-set timer with delay start, and child lock on the Panasonic NA-F80B5 8kg Top Load Automatic Washing Machine improve user convenience. With an 8-kilogram washing capacity and a 730 RPM spin speed, this fully automatic machine operates at peak efficiency. To enhance its efficacy, the Sazanami Drum and Aqua Spin Rinse are included. </p><h2>Buy Panasonic NA-F80B5 8kg Top Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NA-F80B5 8kg Top Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NA-F80B5 8kg Top Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Top Loading"},{"key":"Washing Capacity","value":"8KG"},{"key":"Spin Speed","value":"730RPM"},{"key":"Drum Type","value":"Sazanami Drum"},{"key":"Door Type","value":"Glass Lid"},{"key":"Display","value":"Digital display"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"525 x 571 x 929mm"},{"key":"Weight","value":"32 kg"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NA-F80B5 8kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NA-F80B5 8kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NA-F80B5 8kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f80b5/na-f80b5-500x500.webp"],"product_seo_title":"Panasonic NA-F80B5 8kg Washing Machine Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic NA-F80B5 8kg Washing Machine at best price in Bangladesh. Latest Panasonic NA-F80B5 Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NA-F80B5 8kg Top Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/panasonic-na-f90b5-9kg-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f90b5/na-f90b5-228x228.webp","title":"Panasonic NA-F90B5 9kg Top Load Automatic Washing Machine","product_list_short_description":["Machine Type: Fully Automatic","Washing Capacity: 9kg, Spin Speed: 710RPM","Air Dry Spin Dry System, Aqua Spin Rinse","Aqua Crystal Glass Durable Glass Cover"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"34424","brand":"Panasonic","product_page_short_description":["Model: NA-F90B5","Machine Type: Fully Automatic","Washing Capacity: 9kg, Spin Speed: 710RPM","Air Dry Spin Dry System, Aqua Spin Rinse","Aqua Crystal Glass Durable Glass Cover"],"emi_price":0,"full_description":"<h2>Panasonic NA-F90B5 9kg Top Load Automatic Washing Machine</h2><p>The Panasonic <strong>NA-F90B5</strong> 9kg Top Load Automatic <a href=\"https://www.startech.com.bd/washing-machine\" target=\"\" style=\"color: rgb(0, 0, 0);\">Washing Machine</a>, with its innovative functions, provides an effective and convenient washing solution. Through the use of Dancing Water Flow and Foam Wash in conjunction with New Shower Rinse and Aqua Spin Rinse features, Eco Aquabeat Technology guarantees complete cleaning while conserving water. With a big 9 kg washing capacity, this Panasonic NA-F90B5 9kg Top Load Automatic Washing Machine is ideal for heavy loads. Its 710 RPM spin speed guarantees efficient drying. With nine automatic washing routines catered to various fabric kinds, the appliance ensures that every load is treated with the best care possible. The sturdy Aqua Crystal Glass cover increases durability, and the Air Dry Spin Dry System speeds up drying. Auto Restart and Auto Power Off are two more functions that help save energy and make life easier for the user. The Panasonic NA-F90B5 9kg Automatic Washing Machine offers a complete laundry experience by combining effectiveness, simplicity, and environmental friendliness.</p><h2>Buy Panasonic NA-F90B5 9kg Top Load Automatic Washing Machine from Star Tech</h2><p>In Bangladesh, you can get original <strong>Panasonic NA-F90B5 9kg Top Load Automatic Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/panasonic-washing-machine\" target=\"\">Panasonic Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech Shop</a> to get yours at lowest price. The Panasonic NA-F90B5 9kg Top Load Automatic Washing Machine comes with 1-year warranty. </p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Top Loading"},{"key":"Washing Capacity","value":"9KG"},{"key":"Modes","value":"9 Automatic Washing Programs as Appropriate for the Fabric"},{"key":"Spin Speed","value":"710RPM"},{"key":"Door Type","value":"Aqua Crystal Glass Durable Glass Cover"},{"key":"Display","value":"Digital display"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595 x 641 x 995mm"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"1 Year"}]}],"latest_price":{"heading":"What is the price of Panasonic NA-F90B5 9kg Washing Machine in Bangladesh?","paragraph":"The latest price of Panasonic NA-F90B5 9kg Washing Machine in Bangladesh is 0৳. You can buy the Panasonic NA-F90B5 9kg Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/panasonic/na-f90b5/na-f90b5-500x500.webp"],"product_seo_title":"Panasonic NA-F90B5 9kg Washing Machine Price in Bangladesh | Star Tech","product_seo_description":"Buy Panasonic NA-F90B5 9kg Washing Machine at best price in Bangladesh. Latest Panasonic NA-F90B5 Washing Machine available at Star Tech. Order online for delivery in BD.","product_seo_keywords":"Panasonic NA-F90B5 9kg Top Load Automatic Washing Machine"},{"url":"https://www.startech.com.bd/haier-hwm70-fd10829-front-loading-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm70-fd10829/hwm70-fd10829-01-228x228.webp","title":"Haier HWM70-FD10829 7 KG Front Loading Washing Machine","product_list_short_description":["Type: Front Load Fully Automatic","Washing Drum Capacity: 7 Kg","Motor Type: BLDC Motor, Spin Speed: 1000 rpm","Features: Add Wash, Huge Screen, Huge Door, Muscular Drum, ABT"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Out Of Stock","code":"32317","brand":"Haier","product_page_short_description":["Model: HWM70-FD10829","Type: Front Load Fully Automatic","Washing Drum Capacity: 7 Kg","Motor Type: BLDC Motor, Spin Speed: 1000 rpm","Features: Add Wash, Huge Screen, Huge Door, Muscular Drum, ABT"],"emi_price":0,"full_description":"<h2>Haier HWM70-FD10829 7 KG Front Loading Washing Machine</h2><p>The Haier HWM70-FD10829 is a Front Loading Washing Machine that is smart and convenient. This washing machine has a front-load, fully automatic design to save space and energy. The Haier washing machine has a 7-kg washing capacity to accommodate small to medium loads of clothes. It also has a magic door that opens wide and allows easy loading and unloading. The Haier HWM70-FD10829 Washing Machine has an add-wash feature, so add clothes or detergent during the washing cycle. It also has a muscular drum with laser-seamless welding technology, which protects your clothes from damage and reduces noise and vibration. It also has an ABT gasket and dispenser to prevent bacteria and mold growth and keep your clothes hygienic. The Haier HWM70-FD10829 Washing Machine has 14 programs and functions that can suit different types of fabrics and washing needs. It has programs such as cotton, shirts, baby care, duvet, delicate/silk, disinfection, self-clean, heavy, mix, express 15 min, sport, spin, rinse spin, and hygienic, optimal washing conditions and results. It also has functions such as delay, steam, temperature, speed, extra rinse, start/pause, customize your washing preferences, and control your washing cycle. The Haier Washing Machine also has a maximum spin speed of 1000 rpm, removing more water and reducing drying time. It also has a noise level of 56 dB (A) for washing and 75 dB (A) for spinning, ensuring a quiet and peaceful washing experience.</p><h3>Super BLDC Inverter Motor</h3><p>The Haier HWM70-FD10829 7 KG Front Loading Washing Machine is equipped with a super inverter motor for strong washing power, saving water and electricity.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm70-fd10829/hwm70-fd10829-03.jpg\" alt=\"Haier HWM70-FD10829 7 KG Washing Machine\" width=\"920\" height=\"450\"><h3>Hijab Mode</h3><p>Another great feature of the Haier HWM70-FD10829 Washing Machine is hijab mode. The first dedicated hijab washing mode has this Haier washing machine, designed to wash your tudong.  </p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm70-fd10829/hwm70-fd10829-04.jpg\" alt=\"Haier HWM70-FD10829 7 KG Washing Machine\" width=\"920\" height=\"450\"><h3>ABT: Anti-Bacterial Technology</h3><p>The Haier HWM70-FD10829 Washing Machine patented Anti-bacterial Technology (ABT) can eliminate more than 99.99% of germs. The ABT is specially made with an exclusive treatment to prevent bacterial growth and create a more hygienic and clean washing environment.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm70-fd10829/hwm70-fd10829-05.jpg\" alt=\"Haier HWM70-FD10829 7 KG Washing Machine\" width=\"920\" height=\"450\"><h2>Buy Haier HWM70-FD10829 7 KG Washing Machine From Star Tech</h2><p>In Bangladesh, you can get original <strong>Haier HWM70-FD10829 Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/haier-washing-machine\" target=\"\">Haier Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Haier HWM70-FD10829 7 KG Washing Machine comes with Motor: Lifetime warranty (Parts &amp; Service: 1 Year warranty).&nbsp;Haier Warranty Card must be kept for warranty claims.</p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Front Load"},{"key":"Washing Capacity","value":"7kg"},{"key":"Drying Capacity","value":"No Dryer"},{"key":"Modes","value":"Cotton, Shirts, Baby Care, Duvet, Delicate / Silk, Disinfection, Self Clean, Heavy, Mix, Express 15 min, Sport, Spin, Rinse+Spin, Hygienic"},{"key":"Motor Type","value":"Inverter Motor"},{"key":"Spin Speed","value":"1000 RPM"},{"key":"Door Type","value":"One Layer Magic Door"},{"key":"Control Panel","value":"LED Flat Panel"},{"key":"Display","value":"LED"},{"key":"Noise level","value":"56 / 75 dB"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595 x 460 x 850mm"},{"key":"Color","value":"White"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"Motor: Lifetime Warranty"}]}],"latest_price":{"heading":"What is the price of Haier HWM70-FD10829 7 KG Washing Machine in Bangladesh?","paragraph":"The latest price of Haier HWM70-FD10829 7 KG Washing Machine in Bangladesh is 39,000৳. You can buy the Haier HWM70-FD10829 7 KG Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm70-fd10829/hwm70-fd10829-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm70-fd10829/hwm70-fd10829-02-500x500.webp"],"product_seo_title":"Haier HWM70-FD10829 7 KG Washing Machine Price in Bangladesh","product_seo_description":"Buy Haier HWM70-FD10829 7 KG Washing Machine at the best price in Bangladesh. Latest Haier HWM70-FD10829 Washing Machine available at Star Tech. Order online to delivery in BD.","product_seo_keywords":"Haier HWM70-FD10829 7 KG Front Loading Washing Machine"},{"url":"https://www.startech.com.bd/haier-hw90-bp14959s6-front-loading-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw90-bp14959s6/hw90-bp14959s6-01-228x228.webp","title":"Haier HW90-BP14959S6 9 KG Front Loading Washing Machine","product_list_short_description":["Type: Front Load Fully Automatic","Washing Drum Capacity: 9 Kg, 525mm Super Drum","Drum type: Pillow Shape Drum, Spin Speeds: 1400 rpm","Features: Super Drum, AI-DBT, Dual Spray, ABT"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Out Of Stock","code":"32312","brand":"Haier","product_page_short_description":["Model: HW90-BP14959S6","Type: Front Load Fully Automatic","Washing Drum Capacity: 9 Kg, 525mm Super Drum","Drum type: Pillow Shape Drum, Spin Speeds: 1400 rpm","Features: Super Drum, AI-DBT, Dual Spray, ABT"],"emi_price":0,"full_description":"<h2>Haier HW90-BP14959S6 9 KG Front Loading Washing Machine</h2><p>The Haier <strong>HW90-BP14959S6</strong> is a Front Loading Washing Machine that is smart and efficient. This Haier washing machine comes with a front-load, fully automatic design to save space and energy. It has a super-drum washing capacity of 9 kg and 525 doors that can open wide and allow easy loading and unloading. The Haier HW90-BP14959S6 Washing Machine features an ABT gasket that prevents bacteria and mold growth and keeps clothes hygienic. Their unique pillow-shaped drum design with laser-seamless welding technology protects clothes from damage and reduces noise and vibration. The Haier HW90-BP14959S6 Washing Machine has 15 programs and functions that can suit different types of fabrics and washing needs. It has programs such as cotton, synthetics, mix, baby care, daily, delicate, refresh, quick'15, hygiene, jeans, drum clean, spin, and more, providing optimal washing conditions and results. The Haier washing machine has a dual spray feature to spray water on clothes during the washing cycle and improve rinsing efficiency. It also has a spinning speed of up to 1400 rpm, removes more water, and reduces the drying time. </p><h3>525mm XL Super Drum</h3><p>The Haier HW90-BP14959S6 Front Loading Washing Machine is equipped with an XL 525mm big drum with an effective natural wash motion, which ensures 25% more clearing using gravity.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw90-bp14959s6/hw90-bp14959s6-04.jpg\" alt=\"Haier HW90-BP14959S6 9 KG Washing Machine\" width=\"920\" height=\"450\"><h3>Super Inverter Motor</h3><p>Reduce vibrations and ensure greater stability with an advanced high-tech brushless super inverter motor. The Haier HW90-BP14959S6 Washing Machine proves more reliable than the conventional motor to experience the ultimate washing with extensive care of garments.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw90-bp14959s6/hw90-bp14959s6-05.jpg\" alt=\"Haier HW90-BP14959S6 9 KG Washing Machine\" width=\"920\" height=\"450\"><h3>Smart Dual Spray</h3><p>The Haier HW90-BP14959S6 9 KG Washing Machine is equipped with smart dual sprays to give a clear and hygienic wash every time. It helps remove lather and residue hidden in drums and windows.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw90-bp14959s6/hw90-bp14959s6-06.jpg\" alt=\"Haier HW90-BP14959S6 9 KG Washing Machine\" width=\"920\" height=\"450\"><h3>ABT: Anti-Bacterial Technology</h3><p>The Haier HW90-BP14959S6 9 KG Washing Machine patented Anti-bacterial Technology (ABT) can eliminate more than 99.99% of germs. The ABT is specially made with an exclusive treatment to prevent bacterial growth and create a more hygienic and clean washing environment.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw90-bp14959s6/hw90-bp14959s6-07.jpg\" alt=\"Haier HW90-BP14959S6 9 KG Washing Machine\" width=\"920\" height=\"450\"><h2>Buy Haier HW90-BP14959S6 9 KG Washing Machine From Star Tech</h2><p>In Bangladesh, you can get original <strong>Haier HW90-BP14959S6 Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/haier-washing-machine\" target=\"\">Haier&nbsp;Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Haier HW90-BP14959S6 9 KG Washing Machine comes with Motor: Lifetime warranty (Parts &amp; Service: 1 Year warranty).&nbsp;Haier Warranty Card must be kept for warranty claims.</p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Front Load"},{"key":"Washing Capacity","value":"9kg"},{"key":"Modes","value":"Cotton, Synthetics, Mix, Baby Care, Daily, Delicate, Refresh, Quick'15, Hygiene, Jeans, Drum Clean, Spin"},{"key":"Motor Type","value":"Super Inverter Motor"},{"key":"Spin Speed","value":"1400 RPM"},{"key":"Drum Type","value":"Pillow Shape Drum"},{"key":"Drum Volume","value":"525mm Super Drum"},{"key":"Door Type","value":"Single Layer 525mm Door"},{"key":"Control Panel","value":"Yes"},{"key":"Display","value":"LED"},{"key":"Noise level","value":"56/75 dB"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595*500*850"},{"key":"Color","value":"Starry Silver"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"Motor: Lifetime Warranty"}]}],"latest_price":{"heading":"What is the price of Haier HW90-BP14959S6 9 KG Washing Machine in Bangladesh?","paragraph":"The latest price of Haier HW90-BP14959S6 9 KG Washing Machine in Bangladesh is 52,000৳. You can buy the Haier HW90-BP14959S6 9 KG Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw90-bp14959s6/hw90-bp14959s6-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw90-bp14959s6/hw90-bp14959s6-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw90-bp14959s6/hw90-bp14959s6-03-500x500.webp"],"product_seo_title":"Haier HW90-BP14959S6 9 KG Washing Machine Price in Bangladesh","product_seo_description":"Buy Haier HW90-BP14959S6 9 KG Washing Machine at the best price in Bangladesh. Latest Haier HW100-B14929S3U1 Washing Machine available at Star Tech. Order online to delivery in BD.","product_seo_keywords":"Haier HW90-BP14959S6 9 KG Front Loading Washing Machine"},{"url":"https://www.startech.com.bd/haier-hw100-b14929s3u1-front-loading-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw100-b14929s3u1/hw100-b14929s3u1-01-228x228.webp","title":"Haier HW100-B14929S3U1 10 KG Front Loading Washing Machine","product_list_short_description":["Type: Front Load Fully Automatic","Washing Drum Capacity: 10 Kg, 525mm Super Drum","Drum type: Pillow Shape Drum, Laser Seamless Welding","Features: Direct Motion Motor, Anti Bacterial Treatment"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Out Of Stock","code":"32308","brand":"Haier","product_page_short_description":["Model: HW100-B14929S3U1","Type: Front Load Fully Automatic","Washing Drum Capacity: 10 Kg, 525mm Super Drum","Drum type: Pillow Shape Drum, Laser Seamless Welding","Features: Direct Motion Motor, Anti Bacterial Treatment"],"emi_price":0,"full_description":"<h2>Haier HW100-B14929S3U1 10 KG Front Loading Washing Machine</h2><p>The Haier <strong>HW100-B14929S3U1</strong> is a front-loading washing machine that is smart and power-efficient. This Haier washing machine comes with a front-load fully automatic design, which can save space and energy. It has a super-drum washing capacity of 10 kg and 525 doors that can open wide and allow easy loading and unloading. The Haier HW100-B14929S3U1 Front Loading Washing Machine features an ABT gasket and dispenser that prevents bacteria and mold growth and keeps clothes hygienic. Their direct-motion motor without a belt-pulley provides powerful and stable operation and a long lifespan. The Haier HW100-B14929S3U1 Washing Machine has 14 programs and functions for different types of fabrics and washing needs. It has programs such as cotton, synthetics, mix, allergen, baby care, daily, delicate, refresh, quick'15, sportswear, jeans, duvet, self-clean, shirts, and spin, providing optimal washing conditions and results.</p><h3>525mm Super Drum</h3><p>The Haier HW100-B14929S3U1 Front Loading Washing Machine is equipped with 525mm big drum with effective natural wash motion which ensures 25% more clearing using gravity. Their compact design occupy less space and 2kg more wash.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-05.jpg\" alt=\"Haier HW100-B14929S3U1 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h3>Unique Pillow Shape Drum</h3><p>Unique pillow shaped drum design with Haier HW100-B14929S3U1 Front Loading Washing Machine provides gentle scrub to ensuring no wear &amp; tear to clothes. The 2.2mm diameter holes between the pillow bugle pushes the clothes gently. They providing clothes the most tender care and reducing abrasion.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-07.jpg\" alt=\"Haier HW100-B14929S3U1 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h3>Driect Motion Motor</h3><p>The direct motion motor directly attached with the drum and its operate without bely-pulley. It has more control on drum to ensure better wash, less vibration and noise. Its also increased durability and reduced energy consumption that present the Haier HW100-B14929S3U1 Washing Machine more dependable and more cost friendly.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw100-b14929s3u1/hw100-b14929s3u1-05.webp\" alt=\"Haier HW100-B14929S3U1 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h3>Dynamic Balance with AI DBT</h3><p>Real-time computing with third generation AI DBT of shock absorption and balance system. It can monitor the working status of the washer ad offer a quieter wash experience.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-08.jpg\" alt=\"Haier HW100-B14929S3U1 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h3>ABT: Anti-Bacterial Technology</h3><p>The The Haier HW100-B14929S3U1 Washing machine patented Anti-bacterial Technology (ABT) its can eliminate more than 99.99% germs. The ABT specially made with exclusive treatment to prevent bacterial growth, and bringing more hygienic and clean washing environment.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-09.jpg\" alt=\"Haier HW100-B14929S3U1 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h2>Buy Haier HW100-B14929S3U1 10 KG Washing Machine From Star Tech</h2><p>In Bangladesh, you can get original <strong>Haier HW100-B14929S3U1 Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/haier-washing-machine\" target=\"\">Haier Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Haier HW100-B14929S3U1 10 KG Washing Machine comes with Motor: Lifetime warranty (Parts &amp; Service: 1 Year warranty).&nbsp;Haier Warranty Card must be kept for warranty claims.</p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Front Load"},{"key":"Washing Capacity","value":"10kg"},{"key":"Modes","value":"Mix, Express 15 min, Wool, Shirts, Duvet, Disinfectant, Intense, Self-Clean, Delicate/Silk, Heavy, Underwear, Baby Care, Daily Wash, Hygienic, Spin, Rinse + Spin"},{"key":"Motor Type","value":"Direct Motion Motor"},{"key":"Spin Speed","value":"0-400-600-800-1000-1200-1400 rpm"},{"key":"Drum Type","value":"Pillow Shape Drum"},{"key":"Drum Volume","value":"525mm Super Drum"},{"key":"Door Type","value":"Double Layer 525 Door"},{"key":"Control Panel","value":"Yes"},{"key":"Display","value":"LED"},{"key":"Noise level","value":"50/70 dB"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595*560*850"},{"key":"Color","value":"Titanium Grey"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"Motor: Lifetime Warranty"}]}],"latest_price":{"heading":"What is the price of Haier HW100-B14929S3U1 10 KG Washing Machine in Bangladesh?","paragraph":"The latest price of Haier HW100-B14929S3U1 10 KG Washing Machine in Bangladesh is 59,000৳. You can buy the Haier HW100-B14929S3U1 10 KG Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw100-b14929s3u1/hw100-b14929s3u1-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw100-b14929s3u1/hw100-b14929s3u1-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw100-b14929s3u1/hw100-b14929s3u1-03-500x500.webp"],"product_seo_title":"Haier HW100-B14929S3U1 10 KG Washing Machine Price in Bangladesh","product_seo_description":"Buy Haier HW100-B14929S3U1 10 KG Washing Machine at the best price in Bangladesh. Latest Haier HW100-B14929S3U1 Washing Machine available at Star Tech. Order online to delivery in BD.","product_seo_keywords":"Haier HW100-B14929S3U1 10 KG Front Loading Washing Machine"},{"url":"https://www.startech.com.bd/haier-hw120-bp14959s6-front-loading-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-01-228x228.webp","title":"Haier HW120-BP14959S6 12 KG Front Loading Washing Machine","product_list_short_description":["Type: Front Load Fully Automatic","Washing Drum Capacity: 12 Kg, 525mm Super Drum","Function: Delay, Steam, Temp, Speed, Extra Rinse, Start/Pause","Features: Super Drum, AI-DBT, Dual Spray, PuriSteam, ABT"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Out Of Stock","code":"32304","brand":"Haier","product_page_short_description":["Model: HW120-BP14959S6","Type: Front Load Fully Automatic","Washing Drum Capacity: 12 Kg, 525mm Super Drum","Function: Delay, Steam, Temp, Speed, Extra Rinse, Start/Pause","Features: Super Drum, AI-DBT, Dual Spray, PuriSteam, ABT"],"emi_price":0,"full_description":"<h2>Haier HW120-BP14959S6 12 KG Front Loading Washing Machine</h2><p>The Haier <strong>HW120-BP14959S6</strong> is a front-loading washing machine that is smart and power-efficient. This Haier washing machine comes with a front-load fully automatic design, which can save space and energy. It has a super-drum washing capacity of 12 kg and 525 doors that can open wide and allow easy loading and unloading. The Haier HW120-BP14959S6 Front Loading Washing Machine features an ABT gasket and dispenser that prevents bacteria and mold growth and keeps clothes hygienic. Their BLDC motor provides powerful and stable operation and a long lifespan. The Haier HW120-BP14959S6 Washing Machine has 14 programs and functions for different types of fabrics and washing needs. It has programs such as cotton, synthetics, mix, allergen, baby care, daily, delicate, refresh, quick'15, sportswear, jeans, duvet, self-clean, shirts, and spin, providing optimal washing conditions and results.</p><h3>525mm Super Drum</h3><p>The Haier HW120-BP14959S6 Front Loading Washing Machine is equipped with a 525mm big drum with an effective natural wash motion, which ensures 25% more clearing using gravity. Their compact design provides less space and 2kg more wash.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-05.jpg\" alt=\"Haier HW120-BP14959S6 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h3>Unique Pillow-Shape Drum</h3><p>Unique pillow-shaped drum design with Haier HW120-BP14959S6 Front Loading Washing Machine provides a gentle scrub, ensuring no wear and tear to clothes. The 2.2-mm-diameter holes between the pillow bugle push the clothes gently. They provide clothes with the most tender care, reducing abrasion.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-07.jpg\" alt=\"Haier HW120-BP14959S6 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h3>Energy-Efficient BLDC Motor</h3><p>The Haier Wasing Machine with BLDC Motor: Advanced high-tech brushless inverter motors This motor ensures less energy consumption, reduces vibration, and provides greater stability.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-06.jpg\" alt=\"Haier HW120-BP14959S6 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h3>Dynamic Balance with AI DBT</h3><p>Real-time computing with a third-generation AI DBT shock absorption and balance system It can monitor the working status of the washer and offer a quieter wash experience.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-08.jpg\" alt=\"Haier HW120-BP14959S6 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h3>ABT: Anti-Bacterial Technology</h3><p>The Haier HW120-BP14959S6 washing machine patented anti-bacterial technology (ABT) can eliminate more than 99.99% of germs. The ABT is specially made with an exclusive treatment to prevent bacterial growth and create a more hygienic and clean washing environment.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-09.jpg\" alt=\"Haier HW120-BP14959S6 Front Loading Washing Machine\" width=\"920\" height=\"450\"><h2>Buy Haier HW120-BP14959S6 12 KG Washing Machine From Star Tech</h2><p>In Bangladesh, you can get original <strong>Haier HW120-BP14959S6 Washing Machine</strong> From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/haier-washing-machine\" target=\"\">Haier Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Haier HW120-BP14959S6 12 KG Washing Machine comes with Motor: Lifetime warranty (Parts &amp; Service: 1 Year warranty).&nbsp;Haier Warranty Card must be kept for warranty claims.</p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Front Load"},{"key":"Washing Capacity","value":"12 Kg"},{"key":"Modes","value":"Cotton, Synthetics, Mix, Allergen, Baby Care, Daily, Delicate, Refresh, Quick'15, Sportwear, Jeans, Duvet, Self-Clean, Shirts, Spin"},{"key":"Motor Type","value":"Inverter BLDC Motor"},{"key":"Spin Speed","value":"1400 rpm"},{"key":"Drum Type","value":"Pillow Shape Drum"},{"key":"Drum Volume","value":"525mm Super Drum"},{"key":"Door Type","value":"Single Layer, 525 door"},{"key":"Control Panel","value":"Yes"},{"key":"Display","value":"LED"},{"key":"Noise level","value":"56/75 dB"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"595*600*845"},{"key":"Color","value":"Grey"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"Motor: Lifetime warranty"}]}],"latest_price":{"heading":"What is the price of Haier HW120-BP14959S6 Front Loading Washing Machine in Bangladesh?","paragraph":"The latest price of Haier HW120-BP14959S6 Front Loading Washing Machine in Bangladesh is 62,900৳. You can buy the Haier HW120-BP14959S6 Front Loading Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-03-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hw120-bp14959s6/hw120-bp14959s6-04-500x500.webp"],"product_seo_title":"Haier HW120-BP14959S6 12 KG Washing Machine Price in Bangladesh","product_seo_description":"Buy Haier HW120-BP14959S6 12 KG Washing Machine at the best price in Bangladesh. Latest Haier HW120-BP14959S6 Washing Machine available at Star Tech. Order online to delivery in BD.","product_seo_keywords":"Haier HW120-BP14959S6 12 KG Front Loading Washing Machine"},{"url":"https://www.startech.com.bd/haier-hwm70-1269s5-7-kg-automatic-washing-machine","img":"https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm70-1269s5/hwm70-1269s5-01-228x228.webp","title":"Haier HWM70-1269S5 7 KG Top Load Fully Automatic Washing Machine","product_list_short_description":["Type: Top Load Fully Automatic","Washing Capacity: 7 Kg, Pillow Drum","Motor Type: High-Efficiency Motor","Features: Quick Wash, Bionic Magic Filter, LED Screen"],"price_new":0,"price_old":0,"price_single":null,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Washing Machine Price in Bangladesh 2024 | Star Tech","cat_seo_description":"Buy Washing Machine at the best price in Bangladesh. latest Washing Machine from Hitachi, Sharp, Samsung, LG, and Whirlpool available at Star Tech Shop. Order online and get delivery in BD.","cat_seo_keywords":"Washing Machine, Washing Machine Price in Bangladesh,","status":"Up Coming","code":"32345","brand":"Haier","product_page_short_description":["Model: HWM70-1269S5","Type: Top Load Fully Automatic","Washing Capacity: 7 Kg, Pillow Drum","Motor Type: High-Efficiency Motor","Features: Quick Wash, Bionic Magic Filter, LED Screen"],"emi_price":0,"full_description":"<h2>Haier HWM70-1269S5 7 KG Top Load Fully Automatic Washing Machine</h2><p><span style=\"font-size: 12px;\">The Haier <strong>HWM70-1269S5</strong> Top Load Automatic Washing Machine has a 7 kg washing capacity that is suitable for small to medium-sized families. This automatic washing machine comes with a pillow drum design that has soft and smooth pillow-shaped pads. The pillow drum protects your clothes from wear and tear and reduces friction and noise. It also improves the washing performance and ensures a thorough and gentle wash. The <strong>Haier HWM70-1269S5 7kg Automatic Washing Machine</strong> also has Super NZP Technology, which allows the washing machine to operate effectively even at low water pressure. The Super NZP technology detects the water level and adjusts the water flow accordingly. It ensures a reliable and consistent wash even at 0.001-0.002 MPA water pressure. The Haier HWM70-1269S5 7 KG Top Load Fully Automatic Washing Machine also has an Oceanus Wave tub design to mimic the ocean waves and create a strong and dynamic water flow. The Oceanus Wave tub design enhances washing performance and removes dirt and stains from the clothes. It also has a deep-plate pulsator design that creates a powerful and deep water flow. The Deep Plate Pulsator design agitates the clothes and removes stubborn dirt and grime.</span></p><h3>Pillow Drum</h3><p>The Pillow Drum is a unique drum design that has soft and smooth pillow-shaped pads. The pillow drum protects your clothes from wear and tear and reduces friction and noise. Its 560 protrusions increase its flexibility across washing. When in operation, the 720 micropores (diameter of 2.5 mm) that spray water lessen wear and speed up cleaning.</p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm100-m826/hwm100-m826-04.jpg\" alt=\"Haier HWM70-1269S5 7 KG Top Load Automatic Washing Machine\" width=\"920\" height=\"450\"><h3>Dual Bionic Magic Filter&nbsp;</h3><p><span style=\"font-size: 12px;\">Their 2x Bionic Magic Filter has a dual-layer filter that catches lint, hair, and other impurities from the water. The Bionic Magic Filter ensures a clean and hygienic wash and prevents clogging and odor.</span></p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm70-1269s5/hwm70-1269s5-04.jpg\" alt=\"Haier HWM70-1269S5 7 KG Top Load Automatic Washing Machine\" width=\"920\" height=\"450\" style=\"\"><h3>15 Minutes Quick Wash</h3><p><span style=\"font-size: 12px;\">Another feature of this Haier HWM70-1269S5 7kg washing machine is the Quick Wash, which is a time-saving option that washes lightly soiled clothes in just 15 minutes. The Quick Wash function saves time and energy. It also has an auto-restart function, which automatically resumes the wash cycle after a power outage or interruption.</span></p><img src=\"https://www.startech.com.bd/image/catalog/washing-machine/haier/hwm70-1269s5/hwm70-1269s5-05.jpg\" alt=\"Haier HWM70-1269S5 7 KG Top Load Automatic Washing Machine\" width=\"920\" height=\"450\"><h2>Buy Haier HWM70-1269S5 7 KG Top Load Fully Automatic Washing Machine From Star Tech</h2><p>In Bangladesh, you can get original <span style=\"font-size: 12px; font-weight: 700;\">Haier HWM70-1269S5 7 KG Top Load Fully Automatic Washing Machine</span>&nbsp;From Star Tech. We have a large collection of latest <a href=\"https://www.startech.com.bd/haier-washing-machine\" target=\"\">Haier Washing Machine</a> to purchase. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd\" target=\"\">Star Tech</a> Shop to get yours at lowest price. The Haier HWM70-1269S5 7 KG Automatic Washing Machine comes with Motor: 10 Years warranty (Parts &amp; Service: 1 Year Warranty). Haier Warranty Card must be kept for warranty claims.</p>","specifications":[{"heading":"General Information","values":[{"key":"Machine Type","value":"Fully Automatic"},{"key":"Loading Type","value":"Top Load"},{"key":"Washing Capacity","value":"7kg"},{"key":"Motor Type","value":"High Efficiency Motor"},{"key":"Drum Type","value":"Pillow Drum"},{"key":"Control Panel","value":"Yes"},{"key":"Display","value":"LED Screen"}]},{"heading":"Physical Information","values":[{"key":"Dimension","value":"520*550*950mm"}]},{"heading":"Warranty Information","values":[{"key":"Warranty","value":"Motor: 10 Years Warranty"}]}],"latest_price":{"heading":"What is the price of Haier HWM70-1269S5 7 KG Automatic Washing Machine in Bangladesh?","paragraph":"The latest price of Haier HWM70-1269S5 7 KG Automatic Washing Machine in Bangladesh is 24,900৳. You can buy the Haier HWM70-1269S5 7 KG Automatic Washing Machine at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm70-1269s5/hwm70-1269s5-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/washing-machine/haier/hwm70-1269s5/hwm70-1269s5-02-500x500.webp"],"product_seo_title":"Haier HWM70-1269S5 7 KG Automatic Washing Machine Price in Bangladesh","product_seo_description":"Buy Haier HWM70-1269S5 7 KG Automatic Washing Machine at the best price in Bangladesh. Latest Haier HWM70-1269S5 7 KG Top Load Automatic Washing Machine available at Star Tech. Order online to get delivery in BD.","product_seo_keywords":"Haier HWM70-1269S5 7 KG Top Load Fully Automatic Washing Machine"}]