[{"url":"https://www.startech.com.bd/baseus-suyt-d0g-control-smartphone-handheld-folding-gimbal-stabilizer","img":"https://www.startech.com.bd/image/cache/catalog/gimbal/baseus/suyt-d0g/suyt-d0g-01-228x228.jpg","title":"Baseus SUYT-D0G Control Smartphone Handheld Folding Gimbal Stabilizer","product_list_short_description":["Metal arm anti-shake and stable","Six-axis attitude sensor control","Freely switch between horizontal and vertical","Universal rotating rocking bar"],"price_new":10000,"price_old":11340,"price_single":10000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"Baseus Gimbal Price in Bangladesh | Star Tech","cat_seo_description":"Buy Baseus Gimbal at competitive price in Bangladesh. Order online or visit your nearest Star Tech branch","cat_seo_keywords":"Baseus Gimbal","status":"In Stock","code":"27410","brand":"Baseus","product_page_short_description":["MPN: SUYT-D0G","Model: SUYT-D0G","Metal arm anti-shake and stable","Six-axis attitude sensor control","Freely switch between horizontal and vertical","Universal rotating rocking bar"],"emi_price":1040,"full_description":"<h2>Baseus SUYT-D0G Control Smartphone Handheld Folding Gimbal Stabilizer</h2><p>Baseus SUYT-D0G Control Smartphone Handheld Folding Gimbal Stabilizer helps you capture smooth and stable videos with your smartphone. It features a three-axis motor and metal arms that provide anti-shake performance and a comfortable grip. It also has a built-in 4500mAh battery that can last up to 12 hours of continuous use. You can easily switch between horizontal and vertical shooting modes with one key, and use the dolly zoom function to create cinematic effects. You can also connect your smartphone to the gimbal via wireless 4.0 and use the app to access multiple intelligent functions such as smart follow, time-lapse, panorama, etc. The gimbal supports phones with a width of 58-92mm and a thickness of below 9.8mm, and it has a Type-C port for fast charging. The gimbal is made of PC+Aluminum alloy material and has a compact size that can be collapsed or stretched according to your needs. Baseus SUYT-D0G Control Smartphone Handheld Folding Gimbal Stabilizer is the perfect companion for your smartphone photography and videography. Whether you are traveling, vlogging, live streaming, or just having fun, this gimbal will help you record every moment with ease and style.</p><h2>Buy Baseus SUYT-D0G Control Smartphone Handheld Folding Gimbal Stabilizer from Star Tech</h2><p>In Bangladesh, you can get original Baseus SUYT-D0G Control Smartphone Handheld Folding Gimbal Stabilizer From Star Tech. We have a large collection of latest Baseus Gimbal Stabilizer to purchase for your mobile phone. Order Online Or Visit your Nearest Star Tech Shop to get yours at lowest price. The Baseus SUYT-D0G Control Smartphone Handheld Folding Gimbal Stabilizer comes with 6 months warranty.</p>","specifications":[{"heading":"General","values":[{"key":"Dimension","value":"Collapsed: 140*115*64mm"},{"key":"Weight","value":"about 330g"},{"key":"Compatibility","value":"Universal"}]},{"heading":"Battery","values":[{"key":"Type","value":"lithium-ion battery"},{"key":"Capacity","value":"4500mAh"},{"key":"Energy","value":"16.65Wh/3.7V"},{"key":"Charging Temperature","value":"5°C to 35°C"},{"key":"Operating Temperature","value":"0°C to 40°C"},{"key":"Operating Time","value":"12h (Test reference value under the leveling condition)"},{"key":"Charging Time","value":"2.5h (Use a 10W charger)"},{"key":"Ports","value":"Type-C"}]},{"heading":"Gimbal","values":[{"key":"Width of Compatible","value":"58-92mm"},{"key":"Thickness of Compatible","value":"below 9.8mm"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"6 Month"}]}],"latest_price":{"heading":"What is the price of Baseus SUYT-D0G Control Smartphone Handheld Gimbal in Bangladesh?","paragraph":"The latest price of Baseus SUYT-D0G Control Smartphone Handheld Gimbal in Bangladesh is 10,000৳. You can buy the Baseus SUYT-D0G Control Smartphone Handheld Gimbal at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/gimbal/baseus/suyt-d0g/suyt-d0g-01-500x500.jpg","https://www.startech.com.bd/image/cache/catalog/gimbal/baseus/suyt-d0g/suyt-d0g-02-500x500.jpg"],"product_seo_title":"Baseus SUYT-D0G Control Smartphone Handheld Gimbal Stabilizer Price in BD","product_seo_description":"Buy Baseus SUYT-D0G Control Smartphone Handheld Folding Gimbal Stabilizer at best price in BD. Order latest Baseus SUYT-D0G Gimbal Stabilizer from Star Tech online shop in BD.","product_seo_keywords":"Baseus SUYT-D0G Control Smartphone Handheld Folding Gimbal Stabilizer"}]