[{"url":"https://www.startech.com.bd/adidas-z-n-e-01-anc-tws-earbuds","img":"https://www.startech.com.bd/image/cache/catalog/earbuds/adidas/z-n-e-01-anc/z-n-e-01-anc-01-228x228.webp","title":"Adidas Z.N.E. 01 ANC True Wireless Earbuds","product_list_short_description":["Active noise cancellation","In-ear comfort fit","Silicone, plastic","IPX5 rating in earbuds"],"price_new":0,"price_old":0,"price_single":19000,"category_description":null,"category_intro_h1":null,"category_intro_p":null,"category_intro_child_list":[],"cat_seo_title":"adidas Earbuds Price in Bangladesh | Star Tech","cat_seo_description":"Buy adidas Earbuds at the best price in Bangladesh. Latest adidas TWS True Wireless Earbuds available at Star Tech Shop. Order online to get delivery anywhere in BD.\n","cat_seo_keywords":"adidas Earbuds","status":"In Stock","code":"28693","brand":"adidas","product_page_short_description":["Model: Z.N.E. 01 ANC","Active noise cancellation","In-ear comfort fit","Silicone, plastic","IPX5 rating in earbuds"],"emi_price":1750,"full_description":"<h2>Adidas Z.N.E. 01 ANC True Wireless Earbuds</h2><p>The Adidas Z.N.E. 01 ANC True Wireless Earbuds are designed to elevate your music experience and keep you in the zone. With their immersive sound quality, these earbuds connect you to the moment, allowing you to fully immerse yourself in your favorite tracks. The sleek ergonomics and carefully considered style make them a perfect companion for both your workouts and daily life, seamlessly blending with any outfit. Featuring active noise cancellation technology, these earbuds block out distractions, enabling you to stay focused on your activities or tasks at hand. Whether you're working out at the gym, commuting, or simply enjoying your leisure time, the Adidas Z.N.E. 01 ANC earbuds create a soundscape that enhances your overall experience. Not only are these earbuds stylish and performance-driven, but they are also designed to withstand your active lifestyle. With a sweat-proof and water-resistant rating of IPX5, you can confidently use them during intense workouts or in light rain without worrying about damage. The earbuds offer a playtime of 4.5 hours on a single charge, and the included on-the-go charging case provides an additional 15.5 hours of battery life. This ensures that you can enjoy your music for extended periods, whether you're on a long trip or simply going about your day. The Adidas Z.N.E. 01 ANC earbuds also come with an eco-charging option. This feature helps prolong the lifespan of the earbuds by optimizing the charging process, reducing unnecessary strain on the battery. Comfort is a key consideration, and these earbuds provide an in-ear fit that ensures a secure and comfortable experience. You can wear them for extended periods without discomfort, allowing you to fully immerse yourself in your favorite music or podcasts. The Adidas Z.N.E. 01 ANC True Wireless Earbuds offer a winning combination of immersive sound, stylish design, active noise cancellation, durability, and comfort. Whether you're an athlete, a fitness enthusiast, or someone who appreciates high-quality audio, these earbuds are designed to enhance your music experience and keep you in the zone.</p><h2><span style=\"color: inherit; font-family: inherit;\">Buy </span>Adidas Z.N.E. 01 ANC True Wireless Earbuds<span style=\"color: inherit; font-family: inherit;\">&nbsp;from the best Earbuds Shop in Bangladesh: Star Tech</span><br></h2><p>In Bangladesh, you can get original <a href=\"https://www.startech.com.bd/adidas-z-n-e-01-anc-tws-earbuds\" target=\"\">Adidas Z.N.E. 01 ANC True Wireless Earbuds</a> From Star Tech. We have a large collection of the latest Adidas&nbsp;<a href=\"https://www.startech.com.bd/marshall-earbuds\" target=\"\" style=\"\">Earbuds</a> to purchase for your <a href=\"https://www.startech.com.bd/mobile-phone\" target=\"\">Mobile Phone</a>. Order Online Or Visit your Nearest <a href=\"https://www.startech.com.bd/\" target=\"\">Star Tech</a> Shop to get yours at the lowest price. The Adidas Z.N.E. 01 ANC True Wireless Earbuds come with no warranty.<br></p>","specifications":[{"heading":"Main Feature","values":[{"key":"Frequency","value":"20 Hz – 20 Khz"},{"key":"Impedance","value":"16"},{"key":"Sound level/Sensitivity","value":"106±2 Db @ 1 Mw (0.126vrms) 1 Khz"},{"key":"Microphone","value":"Yes"},{"key":"Duration","value":"4.5 hours of playtime and 15.5 hours of on-the-go chargin"},{"key":"Others","value":"Active noise cancellation"}]},{"heading":"Physical Specification","values":[{"key":"Dimensions","value":"5 cm x 6 cm x 3 cm"},{"key":"Weight","value":"Earbud: 4.2g / Case: 37g"},{"key":"Color","value":"Night Grey / Grey"}]},{"heading":"Warranty","values":[{"key":"Warranty","value":"No warranty"}]}],"latest_price":{"heading":"What is the price of Adidas Z.N.E. 01 ANC TWS Earbuds in Bangladesh?","paragraph":"The latest price of Adidas Z.N.E. 01 ANC TWS Earbuds in Bangladesh is 19,000৳. You can buy the Adidas Z.N.E. 01 ANC TWS Earbuds at best price from our website or visit any of our showrooms."},"images":["https://www.startech.com.bd/image/cache/catalog/earbuds/adidas/z-n-e-01-anc/z-n-e-01-anc-01-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/adidas/z-n-e-01-anc/z-n-e-01-anc-02-500x500.webp","https://www.startech.com.bd/image/cache/catalog/earbuds/adidas/z-n-e-01-anc/z-n-e-01-anc-03-500x500.webp"],"product_seo_title":"Adidas Z.N.E. 01 ANC True Wireless Earbuds Earbuds Price in Bangladesh","product_seo_description":"Buy Adidas Z.N.E. 01 ANC True Wireless Earbuds at best price in BD. Latest Adidas Z.N.E. 01 ANC TWS Earbuds available at Star Tech Shop. Order online for delivery in BD.","product_seo_keywords":"Adidas Z.N.E. 01 ANC True Wireless Earbuds"}]